import streamlit as st
import pandas as pd
import numpy as np
import plotly.graph_objects as go
import pickle
import os
import joblib
from tensorflow import keras

# настройка страницы
st.set_page_config(
    page_title="Прогнозирование спроса на образовательные услуги",
    page_icon="🎓",
    layout="wide",
    initial_sidebar_state="expanded"
)


@st.cache_resource
def load_program_model_components(models_dir='./models', data_dir='./prepared_data'):
    """
    Загружает компоненты для модели прогнозирования спроса на ПРОГРАММЫ.
    """
    components = {}
    try:
        # Загрузка модели
#        model_path = os.path.join(models_dir, 'model_demand_program.keras')  #для неоптимизированной модели
        model_path = os.path.join(models_dir, 'model_tuned_demand_program.keras')  #для оптимизированной модели
        if not os.path.exists(model_path):
            raise FileNotFoundError(f"Модель для программ не найдена: {model_path}")
        components['model'] = keras.models.load_model(model_path)

        # Загрузка скалера
        scaler_path = os.path.join(models_dir, "scaler_demand_program.pkl")
        if not os.path.exists(scaler_path):
            raise FileNotFoundError(f"Скалер для программ не найден: {scaler_path}")
        with open(scaler_path, 'rb') as f:
            components['scaler'] = pickle.load(f)

        # Загрузка кодировщика для университетов
        encoder_path = os.path.join('./data', 'university_label_encoder.pkl')
        if not os.path.exists(encoder_path):
            raise FileNotFoundError(f"Кодировщик для университетов не найден: {encoder_path}")
        components['university_encoder'] = joblib.load(encoder_path)

        st.success("Компоненты для модели программ успешно загружены.")
        return components
    except Exception as e:
        st.error(f"Критическая ошибка при загрузке компонентов модели программ: {e}")
        return None


@st.cache_resource  # Кэшируем ресурсы для быстрой загрузки
def load_prediction_components(models_dir='./models', data_dir='./prepared_data'):
    """
    Загружает модель, скалер и список признаков в ПРОСТОЙ СЛОВАРЬ.
    """
    components = {}
    try:
        # 1. Загрузка Keras модели
        model_path = os.path.join(models_dir, 'model_demand_university.keras')
        if not os.path.exists(model_path):
            raise FileNotFoundError(f"Модель не найдена: {model_path}")
        components['model'] = keras.models.load_model(model_path) # Ключ: 'model'

        # 2. Загрузка скалера и списка признаков из PKL файла
        data_path = os.path.join(models_dir, 'scaler_demand_university.pkl')
        if not os.path.exists(data_path):
            raise FileNotFoundError(f"Файл данных 'scaler_demand_university.pkl' не найден: {data_path}")
        with open(data_path, 'rb') as f:
            components['scaler'] = pickle.load(f)

        feature_path = os.path.join(models_dir, 'features_demand_university.pkl')
        if not os.path.exists(feature_path):
            raise FileNotFoundError(f"Признаки не найдены: {feature_path}")
        with open(feature_path, 'rb') as f:
            components['feature_names'] = pickle.load(f)


        st.success("Компоненты для прогнозирования успешно загружены.")
        return components

    except Exception as e:
        st.error(f"Критическая ошибка при загрузке компонентов: {e}")
        return None

def prepare_program_features(common_inputs_from_widgets, university_id, university_name, program_name, is_debug_target):
    """
    Создает полный словарь признаков для модели прогнозирования спроса на программу.

    Args:
        common_inputs_from_widgets (dict): Словарь с общими признаками из виджетов.
        university_id (int): ID выбранного университета.
        university_name (str): Название выбранного университета.
        program_name (str): Название выбранной программы.

    Returns:
        dict: Полный словарь признаков, готовый для predict_program_demand_streamlit.
    """
    # Задаем полный набор признаков со значениями по умолчанию ("заглушками")
    # Эти значения должны быть типичными "сырыми" значениями
    default_features =  {
        "year": 2025,
        "ege_change_prev_year": 0.25466421841606207,
        "cost_of_education_rub": 200.3236446825803,
        "gdp_per_capita_usd": 9.858285722886126,
        "gdp_usd_billion": 1.7783387014237981,
        "gdp_rub_billion": 30.091806387525963,
        "inflation_rate_percent": 5.8332717257156625,
        "mrot_rub": 13.324083862617018,
        "avg_salary_rub": 52.117248126185245,
        "real_salary_growth_percent": 4.467448300773607,
        "cpi_index": 200.4461184190723,
        "base_cpi": 100.4491857559977,
        "base_inflation_percent": 5.917807410974986,
        "gdp_deflator": 121.35555010384996,
        "population_million": 146.61882243159448,
        "unemployment_rate_percent": 4.536531109840162,
        }
    # 2. Начинаем с значений по умолчанию
    features = default_features.copy()

    # 3. Обновляем словарь значениями, которые ввел пользователь
    features.update(common_inputs_from_widgets)

    # 4. Добавляем информацию о вузе и программе
    features['university'] = university_id
    features['university_text'] = university_name
    features['selected_program'] = program_name  # Добавляем для использования внутри predict_...

    # 5. Добавляем one-hot encoded признаки для программ
    # Сначала все OHE-признаки равны 0
    all_program_columns = [f'program_group_{p}' for p_list in program_groups.values() for p in p_list]
    unique_program_columns = sorted(list(set(all_program_columns)))  # Уникальные и отсортированные

    for col in unique_program_columns:
        features[col] = 0

    # Устанавливаем 1 для выбранной программы
    selected_program_col = f"program_group_{program_name}"
    if selected_program_col in features:
        features[selected_program_col] = 1

    if is_debug_target:
        with st.expander(f"🕵️‍♂️ Отладка признаков для ВЫБРАННОЙ программы: '{program_name}'"):
            st.json(features)

    return features


def prepare_features_for_prediction(features_dict, deep_features, numeric_features, wide_feature, scaler=None):
    """
    Готовит признаки для ПЕРВОЙ модели (спрос на университет).
    """
    if scaler is None:
        print("ОШИБКА: Скейлер не передан в prepare_features_for_prediction.")
        return pd.DataFrame()

    # Задаем значения по умолчанию для первой модели
    default_features = {
        "year": 2025,
        "ege_change_prev_year": 0.25466421841606207,
        "cost_of_education_rub": 200.3236446825803,
        "gdp_per_capita_usd": 9.858285722886126,
        "gdp_usd_billion": 1.7783387014237981,
        "gdp_rub_billion": 30.091806387525963,
        "inflation_rate_percent": 5.8332717257156625,
        "mrot_rub": 13.324083862617018,
        "avg_salary_rub": 52.117248126185245,
        "real_salary_growth_percent": 4.467448300773607,
        "cpi_index": 200.4461184190723,
        "base_cpi": 100.4491857559977,
        "base_inflation_percent": 5.917807410974986,
        "gdp_deflator": 121.35555010384996,
        "population_million": 146.61882243159448,
        "unemployment_rate_percent": 4.536531109840162,
    }

    input_data = default_features.copy()
    input_data.update(features_dict)

    deep_df = pd.DataFrame([input_data])

    for feat in deep_features:
        if feat not in deep_df.columns:
            deep_df[feat] = 0
        if deep_df[feat].dtype == 'bool':
            deep_df[feat] = deep_df[feat].astype(int)

    deep_df[numeric_features] = scaler.transform(deep_df[numeric_features])
    deep_input_values = deep_df[deep_features].values.astype('float32')

    wide_input_value = np.array([[input_data.get(wide_feature, 0)]])

    prediction_inputs = {
        'deep_input': deep_input_values,
        'wide_input': wide_input_value
    }
    return prediction_inputs

def predict_program_demand_streamlit(user_inputs, program_components, is_debug_target):
    """
    Подготавливает данные и предсказывает спрос на программу (для Streamlit)
    """
    if not program_components:
        st.warning("Компоненты модели программ не загружены.")
        return 0.0

    # Извлекаем компоненты
    model = program_components['model']
    scaler = program_components['scaler']
    university_encoder = program_components['university_encoder']

    # 1. ПОДГОТОВКА ЧИСЛОВЫХ ПРИЗНАКОВ (numeric_input)

    numeric_features = [
        'year', 'avg_ege_paid', 'ege_change_prev_year',
        'cost_of_education_rub', 'avg_ege_budget',
        'gdp_per_capita_usd', 'gdp_usd_billion', 'gdp_rub_billion',
        'inflation_rate_percent', 'mrot_rub', 'avg_salary_rub',
        'real_salary_growth_percent', 'cpi_index', 'base_cpi',
        'base_inflation_percent', 'gdp_deflator', 'population_million',
        'unemployment_rate_percent'
    ]
    df_numeric = pd.DataFrame([user_inputs])
    for col in numeric_features:
        if col not in df_numeric.columns:
            df_numeric[col] = 0

    df_numeric = df_numeric[numeric_features]
    X_numeric_scaled = scaler.transform(df_numeric)

    # 2. ПОДГОТОВКА ПРИЗНАКОВ ПРОГРАММ (program_groups_input)

    # gолучаем форму входов из самой модели. Это список кортежей.
    # model.input_shape -> нужен второй элемент (индекс 1) и его вторая размерность (индекс 1).
    try:
        expected_program_features = model.input_shape[1][1]
    except (IndexError, TypeError):
        st.warning("Не удалось автоматически определить размерность программ. Используется значение по умолчанию (67).")
        expected_program_features = 67

    X_programs = np.zeros((1, expected_program_features))


    # Находим индекс выбранной программы в списке ВСЕХ возможных программ модели
    try:
        # понадобится полный список program_features, который использовался при обучении.
        # предположим, что он есть.
        # Мы предполагаем, что порядок в program_groups соответствует OHE.
        available_programs_for_uni = program_groups.get(user_inputs.get('university', 0), [])
        if user_inputs.get('selected_program') in available_programs_for_uni:
            prog_index = available_programs_for_uni.index(user_inputs.get('selected_program'))
            if prog_index < expected_program_features:
                X_programs[0, prog_index] = 1

    except (ValueError, IndexError):
        # Если что-то пошло не так, просто оставляем нулевой вектор
        pass

    # 3. ПОДГОТОВКА ID УНИВЕРСИТЕТА (university_input)
    university_name = user_inputs.get('university_text', '')
    try:
        if university_name and university_name in university_encoder.classes_:
            X_university = university_encoder.transform([university_name])
        else:
            X_university = np.array([0])
    except:
        X_university = np.array([0])

    if is_debug_target:
        with st.expander("Отладка входов в модель (для ВЫБРАННОЙ программы)"):
            st.write(f"**Форма `numeric_input`**: `{X_numeric_scaled.shape}`")
            st.write(f"**Форма `program_groups_input`**: `{X_programs.shape}`")
            st.write(f"**Форма `university_input`**: `{X_university.reshape(-1, 1).shape}`")
            st.write(f"**Значение `university_input`**: `{X_university[0]}` (для вуза: '{university_name}')")
            st.write(f"**Индекс активной программы**: `{np.argmax(X_programs) if np.sum(X_programs) > 0 else 'Нет'}`")

    # 4. ПРЕДСКАЗАНИЕ
    model_inputs = {
        'numeric_input': X_numeric_scaled,
        'program_groups_input': X_programs,
        'university_input': X_university.reshape(-1, 1)
    }

    try:
        prediction = model.predict(model_inputs, verbose=0)[0, 0]
        print(f"Program predict :{prediction}")
        return max(0.0, float(prediction))
    except Exception as e:
        st.error(f"Ошибка при предсказании спроса на программу: {e}")
        return 0.0


def predict_demand_share(user_inputs, components):
    """
    Предсказывает ДОЛЮ спроса, используя компоненты из ПРОСТОГО СЛОВАРЯ.
    """
    # проверка наличия всех компонентов
    if not all(k in components for k in ['model', 'scaler', 'feature_names']):
        st.error("Компоненты модели загружены некорректно или отсутствуют.")
        st.write("Содержимое 'components':", components)  # Для отладки
        return 0.0



    # Прямое извлечение
    model = components['model']
    feature_names = components['feature_names']
    d_features = feature_names['deep_features_list']
    n_features = feature_names['numeric_features_deep']
    w_feature = feature_names['wide_feature']
    scaler = components['scaler']


    try:
        # Подготовка полного набора признаков
        features_prepared = prepare_features_for_prediction(user_inputs, d_features, n_features, w_feature, scaler)

        # Предсказание
        prediction = model.predict(features_prepared, verbose=0)[0, 0]

        return max(0.0, min(1.0, float(prediction)))
    except Exception as e:
        st.error(f"Ошибка во время предсказания: {e}")
        return 0.0


universities = {0: 'Адыгейский гос. ун-т., г. Майкоп',
1: 'Азово-Черноморский инженерный ин-т. - филиал Донского государственного аграрного ун-т.а в г. Зернограде',
2: 'Академия маркетинга и социально-информационных технологий - ИМСИТ, г. Краснодар',
3: 'Академия социального образования, г. Казань',
4: 'Академия труда и социальных отношений, г. Москва',
5: 'Академия управления и производства, г. Москва',
6: 'Алатырский филиал Чувашского государственного ун-т.а им. И.Н. Ульянова',
7: 'Алтайский гос. аграрный ун-т., г. Барнаул',
8: 'Алтайский гос. гуманитарно-педагогический ун-т. им. В.М. Шукшина, г. Бийск',
9: 'Алтайский гос. медицинский ун-т., г. Барнаул',
10: 'Алтайский гос. педагогический ун-т., г. Барнаул',
11: 'Алтайский гос. техн. ун-т. им. И.И. Ползунова, г. Барнаул',
12: 'Алтайский гос. ун-т., г. Барнаул',
13: 'Алтайский ин-т. экономики – филиал Санкт-Петербургского ун-т.а технологий управления и экономики',
14: 'Алтайский филиал РАНХиГС',
15: 'Алтайский филиал Финансового ун-т.а при Правительстве РФ',
16: 'Альметьевский гос. нефтяной ин-т.',
17: 'Альметьевский гос. технол. ун-т. "Высшая школа нефти"',
18: 'Альметьевский филиал Казанского национального исследовательского технического ун-т.а им. А.Н.Туполева',
19: 'Амурская гос. медицинская академия, г. Благовещенск',
20: 'Амурский гос. ун-т., г. Благовещенск',
21: 'Амурский гуманитарно-педагогический гос. ун-т., г. Комсомольск-на-Амуре',
22: 'Амурский ин-т. железнодорожного транспорта - филиал Дальневосточного государственного ун-т.а путей сообщения в г. Свободном',
23: 'Анапский филиал Московского педагогического государственного ун-т.а',
24: 'Ангарский гос. техн. ун-т.',
25: 'Арзамасский филиал Национального исследовательского Нижегородского государственного ун-т.а им. Н.И. Лобачевского',
26: 'Арктический гос. агротехнол. ун-т.',
27: 'Армавирский гос. педагогический ун-т.',
28: 'Армавирский гуманитарно-социальный ин-т.',
29: 'Армавирский механико-технол. ин-т. (филиал) Кубанского государственного технологического ун-т.а',
30: 'Астраханский гос. медицинский ун-т.',
31: 'Астраханский гос. техн. ун-т.',
32: 'Астраханский гос. ун-т.',
33: 'Астраханский инженерно-строительный ин-т.',
34: 'Астраханский филиал Международного юридического ин-т.а',
35: 'Астраханский филиал РАНХиГС',
36: 'Астраханский филиал Саратовской государственной юридической академии',
37: 'Ачинский филиал Красноярского государственного аграрного ун-т.а',
38: 'Байкальский гос. ун-т., г. Иркутск',
39: 'Байкальский гуманитарный ин-т.',
40: 'Балаковский инженерно-технол. ин-т. – филиал Национального исследовательского ядерного ун-т.а «МИФИ»',
41: 'Балаковский филиал РАНХиГС',
42: 'Балаковский филиал Саратовской государственной юридической академии',
43: 'Балашовский ин-т. (филиал) Саратовского национального исследовательского государственного ун-т.а им. Н.Г. Чернышевского',
44: 'Балтийская гос. академия рыбопромыслового флота, г. Калининград',
45: 'Балтийский гос. техн. ун-т. "Военмех" им. Д.Ф. Устинова, г. Санкт-Петербург',
46: 'Балтийский ин-т. иностранных языков и межкультурного сотрудничества, г. Санкт-Петербург',
47: 'Балтийский ин-т. экологии, политики и права, г. Санкт-Петербург',
48: 'Балтийский федеральный ун-т. им. И. Канта',
49: 'Барнаульский филиал Финансового ун-т.а при Правительстве РФ',
50: 'Башкирский гос. аграрный ун-т., г. Уфа',
51: 'Башкирский гос. медицинский ун-т., г. Уфа',
52: 'Башкирский гос. педагогический ун-т. им. М. Акмуллы, г. Уфа',
53: 'Башкирский гос. ун-т., г. Уфа',
54: 'Башкирский ин-т. социальных технологий (филиал) Академии труда и социальных отношений',
55: 'Башкирский ин-т. технологий и управления (филиал) Московского государственного ун-т.а технологий и управления им. К.Г. Разумовского',
56: 'Башкирский кооперативный ин-т. (филиал) Российского ун-т.а кооперации',
57: 'Белгородский гос. аграрный ун-т. им. В.Я. Горина',
58: 'Белгородский гос. ин-т. искусств и культуры',
59: 'Белгородский гос. национальный исследовательский ун-т.',
60: 'Белгородский гос. технол. ун-т. им. В.Г. Шухова',
61: 'Белгородский ун-т. кооперации, экономики и права',
62: 'Беловский ин-т. (филиал) Кемеровского государственного ун-т.а',
63: 'Березниковский филиал Пермского национального исследовательского политехнического ун-т.а',
64: 'Бийский технол. ин-т. (филиал) Алтайского государственного технического ун-т.а им. И.И. Ползунова',
65: 'Бийский филиал им. В. М. Шукшина Алтайского государственного педагогического ун-т.а',
66: 'Бирский филиал Башкирского государственного ун-т.а',
67: 'Бирский филиал Уфимского ун-т.а науки и технологий',
68: 'Благовещенский гос. педагогический ун-т.',
69: 'Бокситогорский ин-т. (филиал) Ленинградского государственного ун-т.а им. А.С. Пушкина',
70: 'Борисоглебский филиал Воронежского государственного ун-т.а',
71: 'Братский гос. ун-т.',
72: 'Бронницкий филиал Московского автомобильно-дорожного государственного технического ун-т.а (МАДИ)',
73: 'Брянский гос. аграрный ун-т.',
74: 'Брянский гос. инженерно-технол. ун-т.',
75: 'Брянский гос. техн. ун-т.',
76: 'Брянский гос. ун-т. им. И.Г. Петровского',
77: 'Брянский филиал РАНХиГС',
78: 'Брянский филиал РЭУ им. Г.В. Плеханова',
79: 'Бугульминский филиал Казанского национального исследовательского технологического ун-т.а',
80: 'Бузулукский гуманитарно-технол. ин-т. (филиал) Оренбургского государственного ун-т.а',
81: 'Бурятская гос. сельскохозяйственная академия им. В.Р. Филиппова, г. Улан-Удэ',
82: 'Бурятский гос. ун-т., г. Улан-Удэ',
83: 'Бурятский ин-т. инфокоммуникаций (филиал) Сибирского государственного ун-т.а телекоммуникаций и информатики в г. Улан-Удэ',
84: 'Великолукская гос. сельскохозяйственная академия',
85: 'Верхневолжский гос. агробиотехнол. ун-т.',
86: 'Владивостокский гос. ун-т.',
87: 'Владивостокский гос. ун-т. экономики и сервиса',
88: 'Владивостокский филиал Российской таможенной академии',
89: 'Владикавказский ин-т. управления',
90: 'Владикавказский филиал Финансового ун-т.а при Правительстве РФ',
91: 'Владимирский гос. ун-т.',
92: 'Владимирский филиал РАНХиГС',
93: 'Владимирский филиал Российского ун-т.а кооперации',
94: 'Владимирский филиал Финансового ун-т.а при Правительстве РФ',
95: 'Волго-Вятский ин-т. (филиал) Ун-т.а им. О.Е. Кутафина (МГЮА)',
96: 'Волго-Вятский филиал Московского технического ун-т.а связи и информатики',
97: 'Волгоградский гос. аграрный ун-т.',
98: 'Волгоградский гос. медицинский ун-т.',
99: 'Волгоградский гос. социально-педагогический ун-т.',
100: 'Волгоградский гос. техн. ун-т.',
101: 'Волгоградский гос. ун-т.',
102: 'Волгоградский ин-т. бизнеса',
103: 'Волгоградский ин-т. управления - филиал РАНХиГС',
104: 'Волгоградский филиал Московского финансово-юридического ун-т.а МФЮА (МФЮА)',
105: 'Волгоградский филиал РЭУ им. Г.В. Плеханова',
106: 'Волгодонский инженерно-техн. ин-т. Филиал Национального исследовательского ядерного ун-т.а "МИФИ"',
107: 'Волжский гос. ун-т. водного транспорта, г. Нижний Новгород',
108: 'Волжский гуманитарный ин-т. (филиал) Волгоградского государственного ун-т.а',
109: 'Волжский ин-т. экономики, педагогики и права',
110: 'Волжский политехн. ин-т. (филиал) Волгоградского государственного технического ун-т.а',
111: 'Волжский ун-т. им. В.Н. Татищева, г. Тольятти',
112: 'Волжский филиал Международного юридического ин-т.а',
113: 'Волжский филиал Московского автомобильно-дорожного государственного технического ун-т.а (МАДИ)',
114: 'Вологодская гос. молочнохозяйственная академия им. Н.В. Верещагина',
115: 'Вологодский гос. ун-т.',
116: 'Вологодский филиал РАНХиГС',
117: 'Волховский филиал Российского государственного педагогического ун-т.а им. А.И. Герцена',
118: 'Воркутинский филиал Ухтинского государственного технического ун-т.а',
119: 'Воронежский гос. аграрный ун-т. им. императора Петра I (бывшая им. К.Д. Глинки)',
120: 'Воронежский гос. лесотехн. ун-т. им. Г.Ф. Морозова',
121: 'Воронежский гос. медицинский ун-т. им. Н.Н. Бурденко',
122: 'Воронежский гос. педагогический ун-т.',
123: 'Воронежский гос. техн. ун-т.',
124: 'Воронежский гос. ун-т.',
125: 'Воронежский гос. ун-т. инженерных технологий',
126: 'Воронежский ин-т. высоких технологий',
127: 'Воронежский филиал Государственного ун-т.а морского и речного флота им. адмирала С.О. Макарова',
128: 'Воронежский филиал РАНХиГС',
129: 'Воронежский филиал РЭУ им. Г.В. Плеханова',
130: 'Воронежский экономико-правовой ин-т.',
131: 'Восточная экономико-юридическая гуманитарная академия',
132: 'Восточно-Сибирский гос. ун-т. технологий и управления, г. Улан-Удэ',
133: 'Восточно-Сибирский филиал Российского государственного ун-т.а правосудия в г. Иркутск',
134: 'Воткинский филиал Ижевского государственного технического ун-т.а им. М.Т. Калашникова',
135: 'Всероссийская академия внешней торговли, г. Москва',
136: 'Всероссийский гос. ун-т. юстиции (РПА Минюста России), г. Москва',
137: 'Выборгский филиал РАНХиГС',
138: 'Выборгский филиал Российского государственного педагогического ун-т.а им. А.И. Герцена',
139: 'Выксунский филиал Национального исследовательского технологического ун-т.а "МИСиС"',
140: 'Вятская гос. сельскохозяйственная академия, г. Киров',
141: 'Вятский гос. агротехнол. ун-т., г. Киров',
142: 'Вятский гос. ун-т., г. Киров',
143: 'Глазовский гос. инженерно-педагогический ин-т. им. В.Г. Короленко',
144: 'Глазовский гос. педагогический ин-т. им. В.Г. Короленко',
145: 'Горно-Алтайский гос. ун-т.',
146: 'Горский гос. аграрный ун-т., г. Владикавказ',
147: 'Гос. аграрный ун-т. Северного Зауралья, г. Тюмень',
148: 'Гос. академический ун-т. гуманитарных наук, г. Москва',
149: 'Гос. гуманитарно-технол. ун-т., г. Орехово-Зуево',
150: 'Гос. ин-т. русского языка им. А.С. Пушкина, г. Москва',
151: 'Гос. ин-т. экономики, финансов, права и технологий, г. Гатчина',
152: 'Гос. морской ун-т. им. адмирала Ф.Ф. Ушакова, г. Новороссийск',
153: 'Гос. социально-гуманитарный ун-т., г. Коломна',
154: 'Гос. ун-т. "Дубна"',
155: 'Гос. ун-т. морского и речного флота им. адмирала С.О. Макарова, г. Санкт-Петербург',
156: 'Гос. ун-т. по землеустройству, г. Москва',
157: 'Гос. ун-т. просвещения, г. Мытищи',
158: 'Гос. ун-т. управления, г. Москва',
159: 'Грозненский гос. нефтяной техн. ун-т. им. академика М.Д. Миллионщикова',
160: 'Гуковский ин-т. экономики и права (филиал) Ростовского государственного экономического ун-т.а "РИНХ"',
161: 'Гуманитарно-педагогическая академия (филиал) Крымского федерального ун-т.а им. В.И. Вернадского в г. Ялте',
162: 'Гуманитарно-социальный ин-т., г. Москва',
163: 'Гуманитарный ин-т. им. П.А. Столыпина, г. Москва',
164: 'Гуманитарный ин-т. телевидения и радиовещания им. М.А. Литовчина, г. Москва',
165: 'Гуманитарный ин-т., г. Москва',
166: 'Гуманитарный ун-т., г. Екатеринбург',
167: 'Дагестанский гос. аграрный ун-т., г. Махачкала',
168: 'Дагестанский гос. медицинский ун-т., г. Махачкала',
169: 'Дагестанский гос. педагогический ун-т., г. Махачкала',
170: 'Дагестанский гос. техн. ун-т., г. Махачкала',
171: 'Дагестанский гос. ун-т. народного хозяйства, г. Махачкала',
172: 'Дагестанский гос. ун-т., г. Махачкала',
173: 'Дагестанский гуманитарный ин-т. (филиал) Академии труда и социальных отношений',
174: 'Дальневосточный гос. аграрный ун-т., г. Благовещенск',
175: 'Дальневосточный гос. медицинский ун-т., г. Хабаровск',
176: 'Дальневосточный гос. техн. рыбохозяйственный ун-т., г. Владивосток',
177: 'Дальневосточный гос. ун-т. путей сообщения, г. Хабаровск',
178: 'Дальневосточный ин-т. (филиал) Всероссийского государственного ун-т.а юстиции в г. Хабаровске',
179: 'Дальневосточный ин-т. управления - филиал РАНХиГС, г. Хабаровск',
180: 'Дальневосточный федеральный ун-т.',
181: 'Дальневосточный филиал Всероссийской академии внешней торговли',
182: 'Дальневосточный филиал Российского государственного ун-т.а правосудия в г. Хабаровск',
183: 'Дзержинский филиал Нижегородского государственного ун-т.а им. Н.И. Лобачевского',
184: 'Дзержинский филиал РАНХиГС',
185: 'Димитровградский инженерно-технол. ин-т. - филиал Национального исследовательского ядерного ун-т.а «МИФИ»',
186: 'Дмитровский ин-т. непрерывного образования (филиал) Государственного ун-т.а "Дубна"',
187: 'Дмитровский ин-т. непрерывного образования (филиал) Международного ун-т.а природы, общества и человека "Дубна"',
188: 'Дмитровский рыбохозяйственный технол. ин-т. (филиал) Астраханского государственного технического ун-т.а',
189: 'Домодедовский филиал Российского нового ун-т.а',
190: 'Донской гос. аграрный ун-т., пос. Персиановский',
191: 'Донской гос. техн. ун-т., г. Ростов-на-Дону',
192: 'Донской казачий гос. ин-т. пищевых технологий и экономики (филиал) Московского государственного ун-т.а технологий и управления им. К.Г. Разумовского',
193: 'Евпаторийский ин-т. социальных наук (филиал) Крымского федерального ун-т.а им. В.И. Вернадского',
194: 'Егорьевский технол. ин-т. (филиал) Московского государственного технологического ун-т.а "Станкин"',
195: 'Елабужский ин-т. (филиал) Казанского (Приволжского) федерального ун-т.а',
196: 'Елецкий гос. ун-т. им. И.А. Бунина',
197: 'Ессентукский ин-т. управления, бизнеса и права',
198: 'Жуковский филиал «Стрела» Московского авиационного ин-т.а (национального исследовательского ун-т.а)',
199: 'Забайкальский аграрный ин-т. - филиал Иркутского государственного аграрного ун-т.а им. А.А. Ежевского',
200: 'Забайкальский гос. ун-т.',
201: 'Забайкальский ин-т. железнодорожного транспорта – филиал Иркутского государственного ун-т.а путей сообщения',
202: 'Западно-Сибирский филиал Российского государственного ун-т.а правосудия в г. Томск',
203: 'Западный филиал РАНХиГС',
204: 'Заполярный гос. ун-т. им. Н.М. Федоровского',
205: 'Зеленодольский ин-т. машиностроения и информационных технологий (филиал) Казанского национального исследовательского технического ун-т.а им. А.Н.Туполева',
206: 'Ивангородский гуманитарно-техн. ин-т. (филиал) Санкт-Петербургского государственного ун-т.а аэрокосмического приборостроения',
207: 'Ивановская гос. медицинская академия',
208: 'Ивановская гос. сельскохозяйственная академия им. Д.К. Беляева',
209: 'Ивановский (г. Иваново) филиал Международного юридического ин-т.а',
210: 'Ивановский гос. политехн. ун-т.',
211: 'Ивановский гос. ун-т.',
212: 'Ивановский гос. химико-технол. ун-т.',
213: 'Ивановский гос. энергетический ун-т.',
214: 'Ивановский филиал РАНХиГС',
215: 'Ивановский филиал Российского экономического ун-т.а им. Г.В. Плеханова',
216: 'Ижевская гос. медицинская академия',
217: 'Ижевская гос. сельскохозяйственная академия',
218: 'Ижевский гос. техн. ун-т. им. М.Т. Калашникова',
219: 'Ижевский ин-т. (филиал) Всероссийского государственного ун-т.а юстиции',
246: 'Ингушский гос. ун-т., г. Магас',
220: 'Ин-т. "Высшие столыпинские курсы государственного права и управления", г. Москва',
221: 'Ин-т. бизнеса и дизайна, г. Москва',
222: 'Ин-т. водного транспорта им. Г.Я. Седова филиал Государственного морского ун-т.а им. адмирала Ф.Ф. Ушакова',
223: 'Ин-т. гуманитарного образования и информационных технологий, г. Москва',
224: 'Ин-т. деловой карьеры, г. Москва',
225: 'Ин-т. законоведения и управления Всероссийской полицейской ассоциации, г. Тула',
226: 'Ин-т. иностранных языков, г. Санкт-Петербург',
227: 'Ин-т. кино и телевидения (ГИТР), г. Москва',
228: 'Ин-т. кино и телевидения, г. Москва',
229: 'Ин-т. международного права и экономики им. А.С. Грибоедова, г. Москва',
230: 'Ин-т. международных экономических связей, г. Москва',
231: 'Ин-т. мировой экономики и финансов, г. Архангельск',
232: 'Ин-т. мировых цивилизаций, г. Москва',
233: 'Ин-т. педагогического образования и менеджмента (филиал) Крымского федерального ун-т.а им. В.И. Вернадского в г. Армянск',
234: 'Ин-т. пищевых технологий и дизайна - филиал Нижегородского государственного инженерно-экономического ун-т.а',
235: 'Ин-т. правоведения и предпринимательства, г. Санкт-Петербург',
236: 'Ин-т. сервиса, туризма и дизайна (филиал) Северо-Кавказского федерального ун-т.а',
237: 'Ин-т. современного искусства, г. Москва',
238: 'Ин-т. сферы обслуживания и предпринимательства (филиал) Донского государственного технического ун-т.а в г. Шахты',
239: 'Ин-т. технологий (филиал) Донского государственного технического ун-т.а в г. Волгодонске',
240: 'Ин-т. туризма и гостеприимства (г.Москва) (филиал) Российского государственного ун-т.а туризма и сервиса',
241: 'Ин-т. управления, бизнеса и права, г. Пятигорск',
242: 'Ин-т. управления, г. Архангельск',
243: 'Ин-т. экономики и антикризисного управления, г. Москва',
244: 'Ин-т. экономики и права (филиал) Академии труда и социальных отношений в г.Севастополе',
245: 'Ин-т. ядерной энергетики (филиал) Санкт-Петербургского политехнического ун-т.а Петра Великого в г. Сосновый Бор',
247: 'Иркутский гос. аграрный ун-т. им. А.А. Ежевского',
248: 'Иркутский гос. медицинский ун-т.',
249: 'Иркутский гос. ун-т.',
250: 'Иркутский гос. ун-т. путей сообщения',
251: 'Иркутский ин-т. (филиал) Всероссийского государственного ун-т.а юстиции',
252: 'Иркутский национальный исследовательский техн. ун-т.',
253: 'Иркутский филиал Московского государственного технического ун-т.а гражданской авиации',
254: 'Ишимский педагогический ин-т. им. П.П. Ершова (филиал) Тюменского государственного ун-т.а',
255: 'Кабардино-Балкарский гос. аграрный ун-т. им. В.М. Кокова',
256: 'Кабардино-Балкарский гос. ун-т. им. Х.М. Бербекова, г. Нальчик',
257: 'Казанская гос. академия ветеринарной медицины им. Н.Э. Баумана',
258: 'Казанский (Приволжский) федеральный ун-т.',
259: 'Казанский гос. аграрный ун-т.',
260: 'Казанский гос. архитектурно-строительный ун-т.',
261: 'Казанский гос. медицинский ун-т.',
262: 'Казанский гос. энергетический ун-т.',
264: 'Казанский инновационный ун-т. им. В.Г. Тимирясова',
263: 'Казанский ин-т. (филиал) Всероссийского государственного ун-т.а юстиции',
265: 'Казанский национальный исследовательский техн. ун-т. им. А.Н.Туполева',
266: 'Казанский национальный исследовательский технол. ун-т.',
267: 'Казанский филиал Волжского государственного ун-т.а водного транспорта',
268: 'Казанский филиал Российского государственного ун-т.а правосудия в г. Казань',
269: 'Калининградский гос. техн. ун-т.',
270: 'Калининградский филиал Московского финансово-юридического ун-т.а (МФЮА)',
271: 'Калининградский филиал Российского ун-т.а кооперации',
272: 'Калининградский филиал Санкт-Петербургского государственного аграрного ун-т.а',
273: 'Калмыцкий гос. ун-т., г. Элиста',
274: 'Калужский гос. ун-т. им. К.Э. Циолковского',
275: 'Калужский ин-т. (филиал) Всероссийского государственного ун-т.а юстиции',
276: 'Калужский филиал Московского государственного технического ун-т.а им. Н.Э. Баумана',
277: 'Калужский филиал РАНХиГС',
278: 'Калужский филиал Российского государственного аграрного ун-т.а — МСХА им. К.А. Тимирязева',
279: 'Калужский филиал Финансового ун-т.а при Правительстве РФ',
280: 'Каменский ин-т. (филиал) Южно-Российского государственного политехнического ун-т.а им. М.И. Платова',
281: 'Камчатский гос. техн. ун-т., г. Петропавловск-Камчатский',
282: 'Камчатский гос. ун-т. им. Витуса Беринга, г. Петропавловск-Камчатский',
283: 'Камышинский технол. ин-т. (филиал) Волгоградского государственного технического ун-т.а',
284: 'Карачаево-Черкесский гос. ун-т. им. У.Д. Алиева',
285: 'Карельский филиал РАНХиГС',
286: 'Каспийский ин-т. морского и речного транспорта - филиал Волжского государственного ун-т.а водного транспорта',
287: 'Кемеровский гос. медицинский ун-т.',
288: 'Кемеровский гос. сельскохозяйственный ин-т.',
289: 'Кемеровский гос. ун-т.',
290: 'Кемеровский ин-т. (филиал) РЭУ им. Г.В. Плеханова',
291: 'Керченский гос. морской технол. ун-т.',
292: 'Кировский гос. медицинский ун-т.',
293: 'Кировский филиал Московского гуманитарно-экономического ин-т.а',
294: 'Кировский филиал Московского финансово-юридического ун-т.а',
295: 'Кировский филиал Московского финансово-юридического ун-т.а (МФЮА)',
296: 'Кировский филиал РАНХиГС',
297: 'Ковровская гос. технологическая академия им. В.А. Дегтярева',
298: 'Коломенский ин-т. (филиал) Московского политехнического ун-т.а',
299: 'Коми республиканская академия государственной службы и управления, г. Сыктывкар',
300: 'Комсомольский-на-Амуре гос. техн. ун-т.',
301: 'Королёвский (г. Королёв Московской области) филиал Международного юридического ин-т.а',
302: 'Костромская гос. сельскохозяйственная академия',
303: 'Костромской гос. ун-т.',
304: 'Костромской гос. ун-т. им. Н.А. Некрасова',
305: 'Краснодарский филиал РЭУ им. Г.В. Плеханова',
306: 'Краснодарский филиал Финансового ун-т.а при Правительстве РФ',
307: 'Красноярский гос. аграрный ун-т.',
308: 'Красноярский гос. медицинский ун-т. им. В.Ф. Войно-Ясенецкого',
309: 'Красноярский гос. педагогический ун-т. им. В.П. Астафьева',
310: 'Красноярский ин-т. железнодорожного транспорта – филиал Иркутского государственного ун-т.а путей сообщения',
311: 'Крымский инженерно-педагогический ун-т., г. Симферополь',
312: 'Крымский федеральный ун-т. им. В.И. Вернадского',
313: 'Крымский филиал Российского государственного ун-т.а правосудия в г. Симферополь',
314: 'Кубанский гос. аграрный ун-т. им. И.Т. Трубилина, г. Краснодар',
315: 'Кубанский гос. аграрный ун-т., г. Краснодар',
316: 'Кубанский гос. медицинский ун-т., г. Краснодар',
317: 'Кубанский гос. технол. ун-т., г. Краснодар',
318: 'Кубанский гос. ун-т., г. Краснодар',
319: 'Кубанский ин-т. информзащиты',
320: 'Кубанский казачий гос. ин-т. пищевой индустрии и бизнеса (филиал) Московского государственного ун-т.а технологий и управления им. К.Г. Разумовского',
321: 'Кубанский социально-экономический ин-т., г. Краснодар',
322: 'Кузбасский гос. аграрный ун-т. им. В.Н. Полецкова',
323: 'Кузбасский гос. техн. ун-т. им. Т.Ф. Горбачева, г. Кемерово',
324: 'Кузбасский гуманитарно-педагогический ин-т. Кемеровского государственного ун-т.а',
325: 'Куйбышевский филиал Новосибирского государственного педагогического ун-т.а',
326: 'Кумертауский филиал Оренбургского государственного ун-т.а',
327: 'Курганская гос. сельскохозяйственная академия им. Т.С. Мальцева, г. Лесниково',
328: 'Курганский гос. ун-т.',
329: 'Курганский ин-т. железнодорожного транспорта - филиал Уральского государственного ун-т.а путей сообщения',
330: 'Курганский филиал РАНХиГС',
331: 'Курская академия государственной и муниципальной службы',
332: 'Курская гос. сельскохозяйственная академия',
333: 'Курский гос. аграрный ун-т.',
334: 'Курский гос. медицинский ун-т.',
335: 'Курский гос. ун-т.',
336: 'Курский ин-т. кооперации (филиал) Белгородского ун-т.а кооперации, экономики и права',
337: 'Курский филиал Финансового ун-т.а при Правительстве РФ',
338: 'Ленинградский гос. ун-т. им. А.С. Пушкина, г. Санкт-Петербург',
339: 'Лениногорский филиал Казанского национального исследовательского технического ун-т.а им. А.Н.Туполева',
340: 'Лесосибирский филиал Сибирского государственного ун-т.а науки и технологий им. М.Ф. Решетнева',
341: 'Липецкий гос. педагогический ун-т.',
342: 'Липецкий гос. техн. ун-т.',
343: 'Липецкий казачий ин-т. технологий и управления (филиал) Московского государственного ун-т.а технологий и управления им. К.Г. Разумовского',
344: 'Липецкий кооперативный ин-т. (филиал) Белгородского ун-т.а кооперации, экономики и права',
345: 'Липецкий кооперативный ин-т. (филиал) Белгородского ун-т.а потребительской кооперации',
346: 'Липецкий филиал Московской гуманитарно-технической академии',
347: 'Липецкий филиал РАНХиГС',
348: 'Липецкий филиал Финансового ун-т.а при Правительстве РФ',
349: 'Литературный ин-т. им. А.М. Горького, г. Москва',
350: 'Лужский ин-т. (филиал) Ленинградского государственного ун-т.а им. А.С. Пушкина',
351: 'Лысьвенский филиал Пермского национального исследовательского политехнического ун-т.а',
353: 'Магнитогорский гос. техн. ун-т. им. Г.И. Носова',
354: 'Майкопский гос. технол. ун-т.',
355: 'Марийский гос. ун-т., г. Йошкар-Ола',
356: 'Махачкалинский филиал Московского автомобильно-дорожного государственного технического ун-т.а (МАДИ)',
357: 'Медицинский ун-т. "РЕАВИЗ", г. Самара',
358: 'Международная академия бизнеса и новых технологий, г. Ярославль',
359: 'Международный банковский ин-т., г. Санкт-Петербург',
360: 'Международный ин-т. компьютерных технологий, г. Воронеж',
361: 'Международный ин-т. рынка, г. Самара',
362: 'Международный ун-т. природы, общества и человека "Дубна"',
363: 'Международный юридический ин-т., г. Москва',
364: 'Межрегиональный открытый социальный ин-т., г. Йошкар-Ола',
365: 'Миасский филиал Челябинского государственного ун-т.а',
352: 'МИРЭА - Российский технол. ун-т.',
366: 'Мичуринский гос. аграрный ун-т.',
367: 'Мордовский гос. педагогический ин-т. им. М.Е. Евсевьева, г. Саранск',
368: 'Морской гос. ун-т. им. адмирала Г.И. Невельского, г. Владивосток',
369: 'Моск. авиационный ин-т. (национальный исследовательский ун-т.)',
370: 'Моск. автомобильно-дорожный гос. техн. ун-т. (МАДИ)',
371: 'Моск. архитектурный ин-т. (гос. академия)',
372: 'Моск. высшая школа социальных и экономических наук',
373: 'Моск. высшая школа социальных и экономических наук (Шанинка)',
374: 'Моск. высшая школа социальных и экономических наук*',
375: 'Моск. городской педагогический ун-т.',
376: 'Моск. городской ун-т. управления Правительства Москвы',
377: 'Моск. гос. академия ветеринарной медицины и биотехнологии им. К.И. Скрябина',
378: 'Моск. гос. академия водного транспорта – филиал Государственного ун-т.а морского и речного флота им. адмирала С.О. Макарова',
379: 'Моск. гос. гуманитарно-экономический ун-т.',
380: 'Моск. гос. ин-т. индустрии туризма им. Ю.А. Сенкевича',
381: 'Моск. гос. ин-т. международных отношений',
382: 'Моск. гос. лингвистический ун-т.',
383: 'Моск. гос. медико-стоматологический ун-т.',
384: 'Моск. гос. областной ун-т.',
385: 'Моск. гос. психолого-педагогический ун-т.',
386: 'Моск. гос. техн. ун-т. гражданской авиации',
387: 'Моск. гос. техн. ун-т. им. Н.Э. Баумана',
388: 'Моск. гос. технол. ун-т. "Станкин"',
389: 'Моск. гос. ун-т. геодезии и картографии',
390: 'Моск. гос. ун-т. им. М.В. Ломоносова',
391: 'Моск. гос. ун-т. пищевых производств',
392: 'Моск. гос. ун-т. спорта и туризма им. Ю.А. Сенкевича',
393: 'Моск. гос. ун-т. технологий и управления им. К.Г. Разумовского (Первый казачий ун-т.)',
394: 'Моск. гос. юридический ун-т. им. О.Е. Кутафина',
395: 'Моск. гуманитарно-техническая академия',
396: 'Моск. гуманитарно-экономический ин-т.',
397: 'Моск. гуманитарный ун-т.',
398: 'Моск. ин-т. государственного управления и права',
399: 'Моск. ин-т. психоанализа',
400: 'Моск. ин-т. экономики, политики и права',
401: 'Моск. информационно-технол. ун-т. – Моск. архитектурно-строительный ин-т. (МИТУ-МАСИ)',
402: 'Моск. медицинский ун-т. "РЕАВИЗ"',
403: 'Моск. международная академия',
404: 'Моск. международная высшая школа бизнеса «МИРБИС» (Ин-т.)',
405: 'Моск. областной казачий ин-т. технологий и управления (филиал) Московского государственного ун-т.а технологий и управления им. К.Г. Разумовского',
406: 'Моск. областной филиал РАНХиГС, г. Красногорск',
407: 'Моск. педагогический гос. ун-т.',
408: 'Моск. политехн. ун-т.',
409: 'Моск. православный ин-т. святого Иоанна Богослова',
410: 'Моск. психолого-социальный ун-т.',
411: 'Моск. региональный социально-экономический ин-т.',
412: 'Моск. социально-педагогический ин-т.',
413: 'Моск. социально-экономический ин-т.',
414: 'Моск. техн. ун-т. связи и информатики',
415: 'Моск. технол. ин-т.',
416: 'Моск. ун-т. им. С.Ю.Витте',
417: 'Моск. физико-техн. ин-т.',
418: 'Моск. финансово-юридический ун-т. МФЮА',
419: 'Моск. экономический ин-т.',
420: 'Мурманская академия экономики и управления',
421: 'Мурманский арктический гос. ун-т.',
422: 'Мурманский арктический ун-т.',
423: 'Мурманский гос. техн. ун-т.',
424: 'Мурманский филиал РАНХиГС',
425: 'Муромский ин-т. (филиал) Владимирского государственного ун-т.а им. Александра Григорьевича и Николая Григорьевича Столетовых',
426: 'Мытищинский филиал МГТУ им. Н. Э. Баумана (МГУЛ)',
427: 'Мытищинский филиал Национального исследовательского Московского государственного строительного ун-т.а',
428: 'Набережночелнинский гос. педагогический ун-т.',
429: 'Набережночелнинский ин-т. (филиал) Казанского (Приволжского) федерального ун-т.а',
430: 'Набережночелнинский филиал Казанского инновационного ун-т.а им. В.Г. Тимирясова (ИЭУП)',
431: 'Набережночелнинский филиал Казанского национального исследовательского технического ун-т.а им. А.Н.Туполева',
432: 'Набережночелнинский филиал Ун-т.а управления "ТИСБИ"',
434: 'Национальный ин-т. бизнеса, г. Москва',
435: 'Национальный ин-т. дизайна, г. Москва',
433: 'Национальный Ин-т. им. Екатерины Великой, г. Москва',
436: 'Национальный исследовательский Мордовский гос. ун-т. им. Н.П. Огарева, г. Саранск',
437: 'Национальный исследовательский Моск. гос. строительный ун-т.',
438: 'Национальный исследовательский Нижегородский гос. ун-т. им. Н.И. Лобачевского',
442: 'Национальный исследовательский технол. ун-т. "МИСиС", г. Москва',
439: 'Национальный исследовательский Томский гос. ун-т.',
440: 'Национальный исследовательский Томский политехн. ун-т.',
443: 'Национальный исследовательский ун-т. "Высшая школа экономики", г. Москва',
444: 'Национальный исследовательский ун-т. "Высшая школа экономики", филиал, г. Нижний Новгород',
445: 'Национальный исследовательский ун-т. "Высшая школа экономики", филиал, г. Пермь',
446: 'Национальный исследовательский ун-т. "Высшая школа экономики", филиал, г. Санкт-Петербург',
447: 'Национальный исследовательский ун-т. "Моск. энергетический ин-т."',
448: 'Национальный исследовательский ун-т. "Моск. энергетический ин-т." (НИУ МЭИ)',
449: 'Национальный исследовательский ун-т. «МИЭТ» (Моск. гос. ин-т. электронной техники)',
450: 'Национальный исследовательский ун-т. «МИЭТ» (Моск. ин-т. электронной техники)',
441: 'Национальный исследовательский Южно-Уральский гос. ун-т., г. Челябинск',
451: 'Национальный исследовательский ядерный ун-т. "МИФИ", г. Москва',
452: 'Невинномысский гос. гуманитарно-техн. ин-т.',
453: 'Невинномысский ин-т. экономики, управления и права',
454: 'Невинномысский технол. ин-т. (филиал) Северо-Кавказского федерального ун-т.а',
455: 'Нефтекамский филиал Башкирского государственного ун-т.а',
456: 'Нефтекамский филиал Уфимского ун-т.а науки и технологий',
457: 'Нижегородская гос. сельскохозяйственная академия',
458: 'Нижегородский гос. агротехнол. ун-т.',
459: 'Нижегородский гос. архитектурно-строительный ун-т.',
460: 'Нижегородский гос. инженерно-экономический ин-т., г. Княгинино',
461: 'Нижегородский гос. инженерно-экономический ун-т., г. Княгинино',
462: 'Нижегородский гос. лингвистический ун-т. им. Н.А. Добролюбова',
463: 'Нижегородский гос. педагогический ун-т. им. Козьмы Минина',
464: 'Нижегородский гос. техн. ун-т. им. Р.Е. Алексеева',
465: 'Нижегородский гос. ун-т. им. Н.И. Лобачевского',
466: 'Нижегородский ин-т. (филиал) Московского гуманитарно-экономического ун-т.а',
467: 'Нижегородский ин-т. управления - филиал РАНХиГС',
468: 'Нижневартовский гос. ун-т.',
469: 'Нижневартовский экономико-правовой ин-т. (филиал) Тюменского государственного ун-т.а',
470: 'Нижнекамский филиал Казанского инновационного ун-т.а им. В.Г. Тимирясова (ИЭУП)',
471: 'Нижнекамский химико-технол. ин-т. (филиал) Казанского национального исследовательского технологического ун-т.а',
472: 'Нижнетагильский гос. социально-педагогический ин-т.',
473: 'Нижнетагильский технол. ин-т. (филиал) Уральского федерального ун-т.а им. Б.Н. Ельцина',
474: 'Новгородский гос. ун-т. им. Ярослава Мудрого',
475: 'Новгородский филиал РАНХиГС',
476: 'Нововоронежский политехн. ин-т. НИЯУ МИФИ',
477: 'Новокузнецкий ин-т. (филиал) Кемеровского государственного ун-т.а',
478: 'Новомосковский ин-т. (филиал) Российского химико-технологического ун-т.а им. Д.И. Менделеева',
479: 'Новороссийский ин-т. (филиал) Московского гуманитарно-экономического ун-т.а',
480: 'Новороссийский политехн. ин-т. (филиал) Кубанского государственного технологического ун-т.а',
481: 'Новороссийский филиал Пятигорского государственного ун-т.а',
482: 'Новороссийский филиал Финансового ун-т.а при Правительстве РФ',
483: 'Новосибирский гос. аграрный ун-т.',
484: 'Новосибирский гос. архитектурно-строительный ун-т.',
485: 'Новосибирский гос. медицинский ун-т.',
486: 'Новосибирский гос. педагогический ун-т.',
487: 'Новосибирский гос. техн. ун-т.',
488: 'Новосибирский гос. ун-т. архитектуры, дизайна и искусств',
489: 'Новосибирский гос. ун-т. экономики и управления',
490: 'Новосибирский национальный исследовательский гос. ун-т.',
491: 'Новосибирский технол. ин-т. (филиал) РГУ им. А.Н. Косыгина',
492: 'Новосибирский юридический ин-т. (филиал) Национального исследовательского Томского государственного ун-т.а',
493: 'Новотроицкий филиал Национального исследовательского технологического ун-т.а "МИСиС"',
494: 'Новоуральский технол. ин-т. - филиал Национального исследовательского ядерного ун-т.а «МИФИ»',
495: 'Новочеркасский инженерно-мелиоративный ин-т. им. А.К. Кортунова - филиал Донского государственного аграрного ун-т.а',
496: 'Норильский гос. индустриальный ин-т.',
497: 'Обнинский ин-т. атомной энергетики - филиал Национального исследовательского ядерного ун-т.а «МИФИ»',
498: 'Одинцовский филиал Международного юридического ин-т.а',
499: 'Одинцовский филиал Московского государственного ин-т.а международных отношений',
500: 'Озерский технол. ин-т. - филиал Национального исследовательского ядерного ун-т.а «МИФИ»',
501: 'Октёмский филиал Якутской государственной сельскохозяйственной академии',
502: 'Омская юридическая академия',
503: 'Омский гос. аграрный ун-т.',
504: 'Омский гос. медицинский ун-т.',
505: 'Омский гос. педагогический ун-т.',
506: 'Омский гос. техн. ун-т.',
507: 'Омский гос. ун-т. им. Ф.М. Достоевского',
508: 'Омский гос. ун-т. путей сообщения',
509: 'Омский ин-т. водного транспорта (филиал) Сибирского государственного ун-т.а водного транспорта',
510: 'Омский филиал РАНХиГС',
511: 'Омский филиал Финансового ун-т.а при Правительстве РФ',
512: 'Оренбургский гос. аграрный ун-т.',
513: 'Оренбургский гос. медицинский ун-т.',
514: 'Оренбургский гос. педагогический ун-т.',
515: 'Оренбургский гос. ун-т.',
516: 'Оренбургский ин-т. (филиал) Ун-т.а им. О.Е. Кутафина (МГЮА)',
517: 'Оренбургский ин-т. путей сообщения - филиал Самарского государственного ун-т.а путей сообщения',
518: 'Оренбургский филиал РАНХиГС',
519: 'Оренбургский филиал РЭУ им. Г.В. Плеханова',
520: 'Орловский гос. аграрный ун-т.',
521: 'Орловский гос. ун-т.',
522: 'Орловский гос. ун-т. им. И.С. Тургенева',
523: 'Орловский филиал Финансового ун-т.а при Правительстве РФ',
524: 'Орский гуманитарно-технол. ин-т. (филиал) Оренбургского государственного ун-т.а',
525: 'Орский филиал Московского финансово-юридического ун-т.а (МФЮА)',
526: 'Павловский филиал Нижегородского государственного ун-т.а им. Н.И. Лобачевского',
527: 'Пензенский гос. аграрный ун-т.',
528: 'Пензенский гос. технол. ун-т.',
529: 'Пензенский гос. ун-т.',
530: 'Пензенский гос. ун-т. архитектуры и строительства',
531: 'Пензенский казачий ин-т. технологий (филиал) Московского государственного ун-т.а технологий и управления им. К.Г. Разумовского',
532: 'Пензенский филиал Финансового ун-т.а при Правительстве РФ',
534: 'Первый гос. московский медицинский ун-т. им. И.М. Сеченова',
533: 'Первый Санкт-Петербургский гос. медицинский ун-т. им. И.П. Павлова',
535: 'Пермская гос. фармацевтическая академия',
536: 'Пермский гос. аграрно-технол. ун-т. им. академика Д.Н. Прянишникова',
537: 'Пермский гос. гуманитарно-педагогический ун-т.',
538: 'Пермский гос. медицинский ун-т.',
539: 'Пермский гос. национальный исследовательский ун-т.',
540: 'Пермский ин-т. (филиал) РЭУ им. Г.В. Плеханова',
541: 'Пермский ин-т. железнодорожного транспорта - филиал Уральского государственного ун-т.а путей сообщения',
542: 'Пермский национальный исследовательский политехн. ун-т.',
543: 'Пермский филиал РАНХиГС',
544: 'Петербургский гос. ун-т. путей сообщения',
545: 'Петрозаводский гос. ун-т.',
546: 'Поволжский гос. технол. ун-т., г. Йошкар-Ола',
547: 'Поволжский гос. ун-т. сервиса, г. Тольятти',
548: 'Поволжский гос. ун-т. телекоммуникаций и информатики, г. Самара',
549: 'Поволжский ин-т. (филиал) Всероссийского государственного ун-т.а юстиции в г. Саратове',
550: 'Поволжский ин-т. управления - филиал РАНХиГС, г. Саратов',
551: 'Поволжский казачий ин-т. управления и пищевых технологий (филиал) Московского государственного ун-т.а технологий и управления им. К.Г. Разумовского',
552: 'Поволжский кооперативный ин-т. (филиал) Российского ун-т.а кооперации',
553: 'Покровский филиал Московского педагогического государственного ун-т.а',
554: 'Политехн. ин-т. (филиал) Донского государственного технического ун-т.а в г. Таганроге',
555: 'Политехн. ин-т. (филиал) СВФУ в г. Мирном',
556: 'Православный Свято-Тихоновский Гуманитарный Ун-т., г. Москва',
557: 'Приамурский гос. ун-т. им. Шолом-Алейхема, г. Биробиджан',
558: 'Приволжский исследовательский медицинский ун-т., г. Нижний Новгород',
559: 'Приволжский филиал Российского государственного ун-т.а правосудия в г. Нижний Новгород',
560: 'Прикамский социальный ин-т.',
561: 'Приморская гос. сельскохозяйственная академия, г. Уссурийск',
562: 'Приморский гос. аграрно-технол. ун-т., г. Уссурийск',
563: 'Приморский ин-т. железнодорожного транспорта - филиал Дальневосточного государственного ун-т.а путей сообщения в г. Уссурийске',
564: 'Приморский филиал РАНХиГС, г. Владивосток',
565: 'Псковский гос. ун-т.',
566: 'Пущинский филиал Российского биотехнологического ун-т.а (ПущГЕНИ — филиал РОСБИОТЕХ)',
567: 'Пятигорский гос. ун-т.',
568: 'Пятигорский ин-т. (филиал) Северо-Кавказского федерального ун-т.а',
569: 'Пятигорский медико-фармацевтический ин-т. – филиал Волгоградского государственного медицинского ун-т.а',
570: 'Российская академия адвокатуры и нотариата',
571: 'Российская академия народного хозяйства и государственной службы при Президенте РФ, г. Москва',
572: 'Российская гос. академия интеллектуальной собственности, г. Москва',
573: 'Российская таможенная академия, г. Люберцы',
574: 'Российский биотехнол. ун-т. (РОСБИОТЕХ), г. Москва',
575: 'Российский гос. аграрный ун-т. — МСХА им. К.А. Тимирязева, г. Москва',
576: 'Российский гос. геологоразведочный ун-т. им. Серго Орджоникидзе, г. Москва',
577: 'Российский гос. гидрометеорологический ун-т., г. Санкт-Петербург',
578: 'Российский гос. гуманитарный ун-т., г. Москва',
579: 'Российский гос. педагогический ун-т. им. А.И. Герцена, г. Санкт-Петербург',
580: 'Российский гос. профессионально-педагогический ун-т., г. Екатеринбург',
581: 'Российский гос. социальный ун-т., г . Москва',
582: 'Российский гос. ун-т. им. А.Н. Косыгина (Технологии. Дизайн. Искусство), г. Москва',
583: 'Российский гос. ун-т. народного хозяйства им. В.И. Вернадского, г. Балашиха',
584: 'Российский гос. ун-т. нефти и газа им. И.М. Губкина, г. Москва',
585: 'Российский гос. ун-т. правосудия, г. Москва',
586: 'Российский гос. ун-т. социальных технологий',
587: 'Российский гос. ун-т. туризма и сервиса, г. Черкизово',
588: 'Российский национальный исследовательский медицинский ун-т. им. Н.И. Пирогова, г. Москва',
589: 'Российский новый ун-т., г. Москва',
590: 'Российский православный ин-т. святого Иоанна Богослова',
591: 'Российский ун-т. дружбы народов, г. Москва',
592: 'Российский ун-т. кооперации, г. Мытищи',
593: 'Российский ун-т. транспорта (МИИТ)',
594: 'Российский химико-технол. ун-т. им. Д.И. Менделеева, г. Москва',
595: 'Российский химико-технол. ун-т. им. Д.И. Менделеева, г.Москва',
596: 'Российский экономический ун-т. им. Г.В. Плеханова, г. Москва',
597: 'Ростовский гос. медицинский ун-т.',
598: 'Ростовский гос. ун-т. путей сообщения',
599: 'Ростовский гос. экономический ун-т. "РИНХ"',
600: 'Ростовский ин-т. (филиал) Всероссийского государственного ун-т.а юстиции в г. Ростове-на-Дону',
601: 'Ростовский филиал Российского государственного ун-т.а правосудия в г. Ростов-на-Дону',
602: 'Ростовский филиал Российской таможенной академии',
604: 'Рубцовский индустриальный ин-т. (филиал) Алтайского государственного технического ун-т.а им. И.И. Ползунова',
603: 'Рубцовский ин-т. (филиал) Алтайского государственного ун-т.а',
605: 'Рузаевский ин-т. машиностроения (филиал) Национального исследовательского Мордовского государственного ун-т.а им. Н.П. Огарева',
606: 'Русская христианская гуманитарная академия, г. Санкт-Петербург',
607: 'Рыбинский гос. авиационный техн. ун-т. им. П.А. Соловьева',
608: 'Рязанский гос. агротехнол. ун-т. им. П.А. Костычева',
609: 'Рязанский гос. медицинский ун-т. им. И.П. Павлова',
610: 'Рязанский гос. радиотехн. ун-т.',
611: 'Рязанский гос. ун-т. им. С.А. Есенина',
612: 'Рязанский ин-т. (филиал) Московского политехнического ун-т.а',
613: 'Самарская гос. областная академия (Наяновой)',
614: 'Самарская гос. сельскохозяйственная академия',
615: 'Самарская гуманитарная академия',
616: 'Самарский гос. аграрный ун-т.',
617: 'Самарский гос. медицинский ун-т.',
618: 'Самарский гос. социально-педагогический ун-т.',
619: 'Самарский гос. техн. ун-т.',
620: 'Самарский гос. ун-т. путей сообщения',
621: 'Самарский гос. экономический ун-т.',
622: 'Самарский национальный исследовательский ун-т. им. академика С.П. Королева',
623: 'Самарский филиал Московского городского педагогического ун-т.а',
624: 'Санкт-Петербургская гос. академия ветеринарной медицины',
625: 'Санкт-Петербургская гос. химико-фармацевтическая академия',
627: 'Санкт-Петербургский горный ун-т.',
628: 'Санкт-Петербургский гос. аграрный ун-т.',
629: 'Санкт-Петербургский гос. архитектурно-строительный ун-т.',
630: 'Санкт-Петербургский гос. ин-т. психологии и социальной работы',
631: 'Санкт-Петербургский гос. лесотехн. ун-т. им. С.М. Кирова',
632: 'Санкт-Петербургский гос. морской техн. ун-т.',
633: 'Санкт-Петербургский гос. педиатрический медицинский ун-т.',
634: 'Санкт-Петербургский гос. технол. ин-т. (техн. ун-т.)',
635: 'Санкт-Петербургский гос. ун-т.',
636: 'Санкт-Петербургский гос. ун-т. аэрокосмического приборостроения',
637: 'Санкт-Петербургский гос. ун-т. ветеринарной медицины',
638: 'Санкт-Петербургский гос. ун-т. гражданской авиации',
639: 'Санкт-Петербургский гос. ун-т. промышленных технологий и дизайна',
640: 'Санкт-Петербургский гос. ун-т. телекоммуникаций им. М.А. Бонч-Бруевича',
641: 'Санкт-Петербургский гос. экономический ун-т.',
642: 'Санкт-Петербургский гос. электротехн. ун-т. “ЛЭТИ”',
626: 'Санкт-Петербургский Гуманитарный ун-т. профсоюзов',
643: 'Санкт-Петербургский гуманитарный ун-т. профсоюзов',
644: 'Санкт-Петербургский им. В.Б. Бобкова филиал Российской таможенной академии',
645: 'Санкт-Петербургский ин-т. (филиал) Всероссийского государственного ун-т.а юстиции',
646: 'Санкт-Петербургский национальный исследовательский Академический ун-т. РАН',
647: 'Санкт-Петербургский национальный исследовательский Академический ун-т. РАН им. Ж.И. Алфёрова',
648: 'Санкт-Петербургский политехн. ун-т. Петра Великого',
649: 'Санкт-Петербургский ун-т. технологий управления и экономики',
650: 'Санкт-Петербургский филиал Финансового ун-т.а при Правительстве РФ',
651: 'Саранский кооперативный ин-т. (филиал) Российского ун-т.а кооперации',
652: 'Сарапульский политехн. ин-т. (филиал) Ижевского государственного технического ун-т.а им. М.Т. Калашникова',
653: 'Саратовская гос. юридическая академия',
654: 'Саратовский гос. аграрный ун-т. им. Н.И. Вавилова',
655: 'Саратовский гос. медицинский ун-т.',
656: 'Саратовский гос. техн. ун-т.',
657: 'Саратовский медицинский ун-т. "РЕАВИЗ"',
658: 'Саратовский национальный исследовательский гос. ун-т. им. Н. Г. Чернышевского',
659: 'Саратовский социально-экономический ин-т. (филиал) РЭУ им. Г.В. Плеханова',
660: 'Саровский физико-техн. ин-т. - филиал Национального исследовательского ядерного ун-т.а «МИФИ»',
661: 'Сахалинский гос. ун-т., г. Южно-Сахалинск',
662: 'Сахалинский ин-т. железнодорожного транспорта - филиал Дальневосточного государственного ун-т.а путей сообщения в г. Южно-Сахалинске',
663: 'Саяно-Шушенский филиал Сибирского федерального ун-т.а',
664: 'Себряковский филиал Волгоградского государственного технического ун-т.а',
665: 'Севастопольский гос. ун-т.',
666: 'Севастопольский филиал РЭУ им. Г.В. Плеханова',
667: 'Севастопольский экономико-гуманитарный ин-т. (филиал) Крымского федерального ун-т.а им. В.И. Вернадского',
668: 'Северный (Арктический) федеральный ун-т. им. М.В. Ломоносова',
669: 'Северный гос. медицинский ун-т., г. Архангельск',
670: 'Северный ин-т. (филиал) Всероссийского государственного ун-т.а юстиции в г. Петрозаводске',
671: 'Северо-Восточный гос. ун-т., г. Магадан',
672: 'Северо-Восточный федеральный ун-т. им. М.К. Аммосова',
673: 'Северо-Западный гос. медицинский ун-т. им. И.И.Мечникова, г. Санкт-Петербург',
674: 'Северо-Западный ин-т. (филиал) Ун-т.а им. О.Е. Кутафина (МГЮА)',
675: 'Северо-Западный ин-т. управления - филиал РАНХиГС, г. Санкт-Петербург',
676: 'Северо-Западный филиал Московского гуманитарно-экономического ин-т.а',
677: 'Северо-Западный филиал Российского государственного ун-т.а правосудия в г. Санкт-Петербург',
678: 'Северо-Кавказская академия управления, г. Нальчик',
679: 'Северо-Кавказская гос. академия, г. Черкесск',
680: 'Северо-Кавказская гос. гуманитарно-технологическая академия, г. Черкесск',
681: 'Северо-Кавказский горно-металлургический ин-т. (гос. технол. ун-т.) , г. Владикавказ',
683: 'Северо-Кавказский ин-т. - филиал РАНХиГС',
682: 'Северо-Кавказский ин-т. (филиал) Всероссийского государственного ун-т.а юстиции в г. Махачкале',
684: 'Северо-Кавказский социальный ин-т., г. Ставрополь',
685: 'Северо-Кавказский федеральный ун-т.',
686: 'Северо-Кавказский филиал Белгородского государственного технологического ун-т.а им. В.Г. Шухова в г. Минеральные Воды',
687: 'Северо-Кавказский филиал Московского автомобильно-дорожного государственного технического ун-т.а (МАДИ)',
688: 'Северо-Кавказский филиал Московского технического ун-т.а связи и информатики',
689: 'Северо-Кавказский филиал Российского государственного ун-т.а правосудия в г. Краснодар',
690: 'Северо-Осетинская гос. медицинская академия, г. Владикавказ',
691: 'Северо-Осетинский гос. педагогический ин-т., г. Владикавказ',
692: 'Северо-Осетинский гос. ун-т. им. К.Л. Хетагурова, г. Владикавказ',
693: 'Северский технол. ин-т. - филиал Национального исследовательского ядерного ун-т.а «МИФИ»',
694: 'Сибайский ин-т. (филиал) Башкирского государственного ун-т.а',
695: 'Сибайский ин-т. (филиал) Уфимского ун-т.а науки и технологий',
696: 'Сибирская академия финансов и банковского дела, г. Новосибирск',
697: 'Сибирский гос. автомобильно-дорожный ун-т., г. Омск',
698: 'Сибирский гос. индустриальный ун-т., г. Новокузнецк',
699: 'Сибирский гос. медицинский ун-т.,  г. Томск',
700: 'Сибирский гос. ун-т. водного транспорта',
701: 'Сибирский гос. ун-т. геосистем и технологий, г. Новосибирск',
702: 'Сибирский гос. ун-т. науки и технологий им. М.Ф. Решетнева, г. Красноярск',
703: 'Сибирский гос. ун-т. путей сообщения, г. Новосибирск',
704: 'Сибирский гос. ун-т. телекоммуникаций и информатики, г. Новосибирск',
705: 'Сибирский ин-т. управления - филиал РАНХиГС, г. Новосибирск',
706: 'Сибирский казачий ин-т. технологий и управления (филиал) Московского государственного ун-т.а технологий и управления им. К.Г.Разумовского',
707: 'Сибирский независимый ин-т., г. Новосибирск',
708: 'Сибирский ун-т. потребительской кооперации, г. Новосибирск',
709: 'Сибирский федеральный ун-т.',
710: 'Сибирский юридический ун-т.',
711: 'Смоленская гос. сельскохозяйственная академия',
712: 'Смоленский гос. медицинский ун-т.',
713: 'Смоленский гос. ун-т.',
714: 'Смоленский областной казачий ин-т. промышленных технологий и бизнеса (филиал) Московского государственного ун-т.а технологий и управления им. К.Г. Разумовского',
715: 'Смоленский филиал Международного юридического ин-т.а',
716: 'Смоленский филиал РАНХиГС',
717: 'Смоленский филиал РЭУ им. Г.В. Плеханова',
718: 'Смоленский филиал Саратовской государственной юридической академии',
719: 'Смоленский филиал Финансового ун-т.а при Правительстве РФ',
720: 'Смольный ин-т. Российской академии образования, г. Санкт-Петербург',
721: 'Снежинский физико-техн. ин-т. - филиал Национального исследовательского ядерного ун-т.а «МИФИ»',
722: 'Современный техн. ин-т., г. Рязань',
723: 'Соликамский гос. педагогический ин-т. (филиал) Пермского государственного национального исследовательского ун-т.а',
724: 'Сочинский гос. ун-т.',
725: 'Сочинский ин-т. (филиал) Российского ун-т.а дружбы народов',
726: 'Средне-Волжский ин-т. (филиал) Всероссийского государственного ун-т.а юстиции в г. Саранске',
727: 'Среднерусский ин-т. управления - филиал РАНХиГС, г. Орел',
728: 'Ставропольский гос. аграрный ун-т.',
729: 'Ставропольский гос. медицинский ун-т.',
730: 'Ставропольский гос. педагогический ин-т.',
731: 'Ставропольский ин-т. кооперации (филиал) Белгородского ун-т.а кооперации, экономики и права',
732: 'Ставропольский филиал Московского педагогического государственного ун-т.а',
733: 'Ставропольский филиал РАНХиГС',
734: 'Старооскольский технол. ин-т. им. А.А. Угарова (филиал МИСиС)',
735: 'Старооскольский филиал Белгородского государственного национального исследовательского ун-т.а',
736: 'Старооскольский филиал Российского государственного геологоразведочного ун-т.а им. Серго Орджоникидзе',
737: 'Стерлитамакский филиал Башкирского государственного ун-т.а',
738: 'Стерлитамакский филиал Уфимского ун-т.а науки и технологий',
739: 'Ступинский филиал Московского авиационного ин-т.а (национального исследовательского ун-т.а)',
740: 'Сургутский гос. педагогический ун-т.',
741: 'Сургутский гос. ун-т. Ханты-Мансийского автономного округа — Югры',
742: 'Сургутский ин-т. нефти и газа (филиал) Тюменского индустриального ун-т.а',
743: 'Сызранский филиал Самарского государственного экономического ун-т.а',
744: 'Сыктывкарский гос. ун-т.',
745: 'Сыктывкарский лесной ин-т. (филиал) Санкт-Петербургского государственного лесотехнического ун-т.а им. С.М. Кирова',
746: 'Таганрогский ин-т. им. А.П. Чехова (филиал) Ростовского государственного экономического ун-т.а (РИНХ)',
747: 'Таганрогский ин-т. управления и экономики',
748: 'Тамбовский гос. техн. ун-т.',
749: 'Тамбовский гос. ун-т. им. Г.Р. Державина',
750: 'Тамбовский филиал РАНХиГС',
751: 'Тамбовский филиал Российского нового ун-т.а',
752: 'Тарский филиал Омского государственного аграрного ун-т.а',
753: 'Тверская гос. сельскохозяйственная академия',
754: 'Тверской гос. медицинский ун-т.',
755: 'Тверской гос. техн. ун-т.',
756: 'Тверской гос. ун-т.',
757: 'Тверской ин-т. (филиал) Московского гуманитарно-экономического ун-т.а',
758: 'Тверской филиал РАНХиГС',
759: 'Техн. ин-т. (филиал) СВФУ в г. Нерюнгри',
760: 'Техн. ун-т. УГМК',
762: 'Технол. ин-т. - филиал Национального исследовательского ядерного ун-т.а «МИФИ»',
763: 'Технол. ин-т. - филиал Национального исследовательского ядерного ун-т.а «МИФИ», г. Лесной',
761: 'Технол. ин-т. (филиал) Донского государственного технического ун-т.а в г. Азове',
764: 'Технол. ин-т. сервиса (филиал) ДГТУ в г. Ставрополе',
765: 'Технол. ин-т. сервиса (филиал) Донского государственного технического ун-т.а в г. Ставрополе',
766: 'Технол. ун-т., г. Королев',
767: 'Тихоокеанский гос. медицинский ун-т., г. Владивосток',
768: 'Тихоокеанский гос. ун-т., г. Хабаровск',
769: 'Тобольский индустриальный ин-т. (филиал) Тюменского индустриального ун-т.а',
770: 'Тобольский педагогический ин-т. им. Д.И. Менделеева (филиал) Тюменского государственного ун-т.а',
771: 'Тольяттинская академия управления',
772: 'Тольяттинский гос. ун-т.',
773: 'Томский гос. архитектурно-строительный ун-т.',
774: 'Томский гос. педагогический ун-т.',
775: 'Томский гос. ун-т. систем управления и радиоэлектроники',
776: 'Томский сельскохозяйственный ин-т. - филиал Новосибирского государственного аграрного ун-т.а',
777: 'Трехгорный технол. ин-т. - филиал Национального исследовательского ядерного ун-т.а «МИФИ»',
778: 'Троицкий филиал Челябинского государственного ун-т.а',
779: 'Тувинский гос. ун-т., г. Кызыл',
780: 'Тульский гос. педагогический ун-т. им. Л.Н. Толстого',
781: 'Тульский гос. ун-т.',
782: 'Тульский ин-т. (филиал) Всероссийского государственного ун-т.а юстиции',
783: 'Тульский филиал РАНХиГС',
784: 'Тульский филиал РЭУ им. Г.В. Плеханова',
785: 'Тульский филиал Финансового ун-т.а при Правительстве РФ',
786: 'Тюменский гос. ин-т. культуры',
787: 'Тюменский гос. медицинский ун-т.',
788: 'Тюменский гос. ун-т.',
789: 'Тюменский индустриальный ун-т.',
790: 'Удмуртский гос. аграрный ун-т.',
791: 'Удмуртский гос. ун-т., г. Ижевск',
792: 'Ульяновский гос. аграрный ун-т. им. П.А.Столыпина',
793: 'Ульяновский гос. педагогический ун-т. им. И.Н. Ульянова',
794: 'Ульяновский гос. техн. ун-т.',
795: 'Ульяновский гос. ун-т.',
796: 'Ульяновский ин-т. гражданской авиации им. Главного маршала авиации Б.П. Бугаева',
797: 'Ульяновский филиал РАНХиГС',
799: 'Ун-т. Иннополис',
800: 'Ун-т. Иннополис*',
798: 'Ун-т. ИТМО, г. Санкт-Петербург',
801: 'Ун-т. при Межпарламентской Ассамблее ЕврАзЭС, г. Санкт-Петербург',
802: 'Ун-т. управления «ТИСБИ», г. Казань',
803: 'Уральский гос. аграрный ун-т., г. Екатеринбург',
804: 'Уральский гос. архитектурно-художественный ун-т., г. Екатеринбург',
805: 'Уральский гос. горный ун-т., г. Екатеринбург',
806: 'Уральский гос. лесотехн. ун-т., г. Екатеринбург',
807: 'Уральский гос. медицинский ун-т., г. Екатеринбург',
808: 'Уральский гос. педагогический ун-т., г. Екатеринбург',
809: 'Уральский гос. ун-т. путей сообщения, г. Екатеринбург',
810: 'Уральский гос. экономический ун-т., г. Екатеринбург',
811: 'Уральский гос. юридический ун-т., г. Екатеринбург',
812: 'Уральский ин-т. управления - филиал РАНХиГС, г. Екатеринбург',
813: 'Уральский социально-экономический ин-т. (филиал) Академии труда и социальных отношений',
814: 'Уральский техн. ин-т. связи и информатики (филиал) Сибирского государственного ун-т.а телекоммуникаций и информатики в г. Екатеринбурге',
815: 'Уральский федеральный ун-т. им. Б.Н. Ельцина',
816: 'Уральский филиал Российского государственного ун-т.а правосудия в г. Челябинск',
817: 'Уральский филиал Финансового ун-т.а при Правительстве РФ',
818: 'Уфимский гос. авиационный техн. ун-т.',
819: 'Уфимский гос. нефтяной техн. ун-т.',
820: 'Уфимский ун-т. науки и технологий (УУНиТ)',
821: 'Уфимский филиал Финансового ун-т.а при Правительстве РФ',
822: 'Ухтинский гос. техн. ун-т.',
823: 'Филиал "Взлет" Московского авиационного ин-т.а (национального исследовательского ун-т.а) в г. Ахтубинске',
824: 'Филиал "Восход" Московского авиационного ин-т.а (национального исследовательского ун-т.а), г. Байконур',
825: 'Филиал "Котельники" Государственного ун-т.а "Дубна"',
826: 'Филиал "Котельники" Международного ун-т.а природы, общества и человека "Дубна"',
827: 'Филиал "Протвино" Государственного ун-т.а "Дубна"',
828: 'Филиал "Протвино" Международного ун-т.а природы, общества и человека "Дубна"',
829: 'Филиал Адыгейского государственного ун-т.а в г. Белореченске',
830: 'Филиал Алтайского государственного ун-т.а в г. Бийске',
831: 'Филиал Байкальского государственного ун-т.а в г. Братске',
832: 'Филиал Байкальского государственного ун-т.а в г. Усть-Илимске',
833: 'Филиал Брянского государственного ун-т.а им. И.Г. Петровского в г. Новозыбкове',
834: 'Филиал Владивостокского государственного ун-т.а в г. Уссурийске',
835: 'Филиал Владивостокского государственного ун-т.а экономики и сервиса в г. Артеме',
836: 'Филиал Владивостокского государственного ун-т.а экономики и сервиса в г. Находке',
837: 'Филиал Воронежского государственного технического ун-т.а в г. Борисоглебске',
838: 'Филиал Государственного морского ун-т.а им. адмирала Ф.Ф. Ушакова в г. Севастополь',
839: 'Филиал Дагестанского государственного технического ун-т.а в г. Дербенте',
840: 'Филиал Дагестанского государственного технического ун-т.а в г. Каспийске',
841: 'Филиал Дагестанского государственного технического ун-т.а в г. Кизляре',
842: 'Филиал Дагестанского государственного ун-т.а в г. Дербенте',
843: 'Филиал Дагестанского государственного ун-т.а в г. Избербаше',
844: 'Филиал Дагестанского государственного ун-т.а в г. Кизляре',
845: 'Филиал Дагестанского государственного ун-т.а в г. Хасавюрте',
846: 'Филиал Керченского государственного морского технологического ун-т.а г. Феодосия',
847: 'Филиал Кубанского государственного ун-т.а в г. Армавире',
848: 'Филиал Кубанского государственного ун-т.а в г. Новороссийске',
849: 'Филиал Кубанского государственного ун-т.а в г. Славянске-на-Кубани',
850: 'Филиал Кубанского государственного ун-т.а в г. Тихорецке',
851: 'Филиал Кузбасского государственного технического ун-т.а им. Т.Ф. Горбачева в г. Междуреченске',
852: 'Филиал Кузбасского государственного технического ун-т.а им. Т.Ф. Горбачева в г. Новокузнецке',
853: 'Филиал Кузбасского государственного технического ун-т.а им. Т.Ф. Горбачева в г. Прокопьевске',
854: 'Филиал Майкопского государственного технологического ун-т.а в поселке Яблоновском',
855: 'Филиал Международного юридического ин-т.а в г. Тула',
856: 'Филиал Московского государственного ун-т.а им. М.В.Ломоносова в г. Севастополе',
857: 'Филиал Мурманского арктического государственного ун-т.а в г. Апатиты',
859: 'Филиал Национального исследовательского технологического ун-т.а "МИСиС" в г. Губкине',
860: 'Филиал Национального исследовательского ун-т.а «МЭИ» в г. Волжском',
861: 'Филиал Национального исследовательского ун-т.а «МЭИ» в г. Смоленске',
858: 'Филиал Национального исследовательского Южно-Уральского государственного ун-т.а в г. Миассе',
862: 'Филиал Омского государственного педагогического ун-т.а в г. Таре',
863: 'Филиал РГУ нефти и газа (НИУ) им. И.М. Губкина в г. Оренбурге',
865: 'Филиал Российского государственного гидрометеорологического ун-т.а в г. Туапсе',
866: 'Филиал Российского государственного гуманитарного ун-т.а в г. Домодедово Московской области',
867: 'Филиал Российского государственного социального ун-т.а в г. Анапе Краснодарского края',
868: 'Филиал Российского государственного социального ун-т.а в г. Клину Московской области',
869: 'Филиал Российского государственного социального ун-т.а в г. Павловском Посаде Московской области',
870: 'Филиал Российского государственного социального ун-т.а в г. Пятигорске',
871: 'Филиал Российского государственного социального ун-т.а в г. Сочи',
872: 'Филиал Российского государственного ун-т.а им. А. Н. Косыгина в г. Твери',
873: 'Филиал Российского государственного ун-т.а туризма и сервиса в г. Махачкале',
874: 'Филиал Российского технологического ун-т.а - МИРЭА в г. Ставрополе',
875: 'Филиал Российского технологического ун-т.а - МИРЭА в г. Фрязино',
876: 'Филиал Ростовского государственного ун-т.а путей сообщения в г. Воронеж',
877: 'Филиал Ростовского государственного экономического ун-т.а "РИНХ" в г. Ейске',
878: 'Филиал Ростовского государственного экономического ун-т.а "РИНХ" в г. Кисловодске Ставропольского края',
879: 'Филиал Ростовского государственного экономического ун-т.а "РИНХ" в г. Махачкале Республики Дагестан',
880: 'Филиал Ростовского государственного экономического ун-т.а "РИНХ" в г. Миллерово Ростовской области',
881: 'Филиал Ростовского государственного экономического ун-т.а "РИНХ" в г. Черкесске Карачаево-Черкесской Республики',
864: 'Филиал РЭУ им. Г.В. Плеханова в г. Пятигорске Ставропольского края',
882: 'Филиал Самарского государственного технического ун-т.а в г. Новокуйбышевске',
883: 'Филиал Самарского государственного технического ун-т.а в г. Сызрань',
884: 'Филиал Самарского государственного ун-т.а путей сообщения в г. Нижний Новгород',
885: 'Филиал Санкт-Петербургского государственного экономического ун-т.а в г. Кизляре',
886: 'Филиал Санкт-Петербургского государственного экономического ун-т.а в г. Пскове',
887: 'Филиал Северного (Арктического) федерального ун-т.а им. М.В. Ломоносова в г. Северодвинске',
888: 'Филиал Сочинского государственного ун-т.а в г. Анапе',
889: 'Филиал Ставропольского государственного педагогического ин-т.а в г. Железноводске',
890: 'Филиал Тюменского индустриального ун-т.а в г. Нижневартовске',
891: 'Филиал Удмуртского государственного ун-т.а в г. Воткинск',
892: 'Филиал Уральского государственного ун-т.а путей сообщения в г. Тюмени',
893: 'Филиал Уральского федерального ун-т.а им. Б.Н. Ельцина в г. Краснотурьинске',
894: 'Филиал Уфимского государственного авиационного технического ун-т.а в г. Ишимбае',
895: 'Филиал Уфимского государственного авиационного технического ун-т.а в г. Кумертау',
896: 'Филиал Уфимского государственного нефтяного технического ун-т.а в г. Октябрьском',
897: 'Филиал Уфимского государственного нефтяного технического ун-т.а в г. Салавате',
898: 'Филиал Уфимского государственного нефтяного технического ун-т.а в г. Стерлитамак',
899: 'Филиал Ухтинского государственного технического ун-т.а в г.Усинске',
903: 'Филиал филиал Международного юридического ин-т.а в г. Тула',
902: 'Филиал Южного федерального ун-т.а в г. Новошахтинске',
900: 'Филиал Южно-Уральского государственного ун-т.а в г. Златоусте',
901: 'Филиал Южно-Уральского государственного ун-т.а в г. Нижневартовске',
904: 'Финансовый ун-т. при Правительстве РФ, г. Москва',
905: 'Хабаровский гос. ун-т. экономики и права',
906: 'Хабаровский ин-т. инфокоммуникаций (филиал) Сибирского государственного ун-т.а телекоммуникаций и информатики',
907: 'Хакасский гос. ун-т. им. Н.Ф. Катанова, г. Абакан',
908: 'Хакасский техн. ин-т. – филиал Сибирского федерального ун-т.а',
909: 'Ханты-Мансийская гос. медицинская академия',
910: 'Центральный ун-т.',
911: 'Центральный филиал Российского государственного ун-т.а правосудия в г. Воронеж',
912: 'Чайковский филиал Пермского национального исследовательского политехнического ун-т.а',
913: 'Чебоксарский ин-т. (филиал) Московского гуманитарно-экономического ун-т.а',
914: 'Чебоксарский ин-т. (филиал) Московского политехнического ун-т.а',
915: 'Чебоксарский кооперативный ин-т. (филиал) Российского ун-т.а кооперации',
916: 'Чебоксарский филиал РАНХиГС',
917: 'Челябинский гос. ун-т.',
918: 'Челябинский ин-т. путей сообщения - филиал Уральского государственного ун-т.а путей сообщения',
919: 'Челябинский филиал РАНХиГС',
920: 'Челябинский филиал Финансового ун-т.а при Правительстве РФ',
921: 'Череповецкий гос. ун-т.',
922: 'Чеченский гос. педагогический ин-т., г. Грозный',
923: 'Чеченский гос. педагогический ун-т., г. Грозный',
924: 'Чеченский гос. ун-т. им. А.А. Кадырова',
925: 'Чеченский гос. ун-т., г. Грозный',
926: 'Чистопольский филиал "Восток" Казанского национального исследовательского технического ун-т.а им.А.Н.Туполева-КАИ" (ЧФ КНИТУ-КАИ)',
927: 'Читинская гос. медицинская академия',
928: 'Читинский ин-т. (филиал) Байкальского государственного ун-т.а',
929: 'Чувашская гос. сельскохозяйственная академия, г. Чебоксары',
930: 'Чувашский гос. аграрный ун-т., г. Чебоксары',
931: 'Чувашский гос. педагогический ун-т. им. И.Я. Яковлева, г. Чебоксары',
932: 'Чувашский гос. ун-т. им. И.Н. Ульянова, г. Чебоксары',
933: 'Шадринский гос. педагогический ин-т.',
934: 'Шахтинский ин-т. (филиал) Южно-Российского государственного политехнического ун-т.а им. М.И. Платова',
935: 'Школа педагогики, Филиал ДВФУ в г. Уссурийске',
936: 'Шуйский филиал Ивановского государственного ун-т.а',
937: 'Электростальский ин-т. (филиал) Московского политехнического ун-т.а',
938: 'Энгельсский технол. ин-т. (филиал) Саратовского государственного технического ун-т.а',
939: 'Юго-Западный гос. ун-т., г. Курск',
940: 'Югорский гос. ун-т., г. Ханты-Мансийск',
941: 'Южно-Российский гос. политехн. ун-т. им. М.И. Платова, г. Новочеркасск',
942: 'Южно-Российский гуманитарный ин-т., г. Ростов-на-Дону',
943: 'Южно-Российский ин-т. управления - филиал РАНХиГС, г. Ростов-на-Дону',
944: 'Южно-Уральский гос. аграрный ун-т., г. Троицк',
945: 'Южно-Уральский гос. гуманитарно-педагогический ун-т. (ЧГПУ), г. Челябинск',
946: 'Южно-Уральский гос. гуманитарно-педагогический ун-т., г. Челябинск',
947: 'Южно-Уральский гос. медицинский ун-т., г. Челябинск',
948: 'Южный ин-т. менеджмента, г. Краснодар',
949: 'Южный ун-т., г. Ростов-на-Дону',
950: 'Южный федеральный ун-т.',
951: 'Юргинский технол. ин-т. (филиал) ТПУ',
952: 'Якутская гос. сельскохозяйственная академия',
953: 'Якутский ин-т. водного транспорта - филиал Сибирского государственного ун-т.а водного транспорта',
954: 'Якутский экономико – правовой ин-т. (филиал) Академии труда и социальных отношений',
955: 'Ярославская гос. сельскохозяйственная академия',
956: 'Ярославский гос. медицинский ун-т.',
957: 'Ярославский гос. педагогический ун-т. им. К.Д. Ушинского',
958: 'Ярославский гос. техн. ун-т.',
959: 'Ярославский гос. ун-т. им. П.Г. Демидова',
960: 'Ярославский филиал Московского финансово-юридического ун-т.а (МФЮА)',
961: 'Ярославский филиал Финансового ун-т.а при Правительстве РФ'}
program_groups = {0: ['Экономика','Юриспруденция', 'Реклама и связи с общественностью', 'Психология', 'Физическая культура', 'Менеджмент', 'Информационная безопасность', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Дизайн', 'Филология', 'Журналистика и литературное творчество', 'Биология', 'Бизнес-информатика', 'История', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Математика', 'Социальная работа', 'Сфера обслуживания'],
1: ['Сельское и рыбное хозяйство', 'Экономика', 'Менеджмент', 'Транспортные средства', 'Государственное и муниципальное управление', 'Экология', 'Энергетика и энергетическое машиностроение'],
2: ['Экономика', 'Международные отношения', 'Менеджмент', 'Психология', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью', 'Сфера обслуживания', 'Педагогическое образование', 'Дизайн', 'Государственное и муниципальное управление', 'Юриспруденция', 'Бизнес-информатика', 'Геодезия и землеустройство'],
3: ['Менеджмент', 'Юриспруденция', 'Психология', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
4: ['Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Политология', 'Государственное и муниципальное управление', 'Юриспруденция', 'Экономика', 'Менеджмент', 'Социальная работа', 'Сфера обслуживания'],
5: ['Юриспруденция', 'Менеджмент', 'Экономика', 'Информатика и вычислительная техника', 'Психология', 'Государственное и муниципальное управление', 'Энергетика и энергетическое машиностроение'],
6: ['Экономика', 'Математика'],
7: ['Менеджмент', 'Геодезия и землеустройство', 'Сельское и рыбное хозяйство', 'Экономика', 'Транспортные средства', 'Профессиональное обучение', 'Государственное и муниципальное управление'],
8: ['Педагогическое образование', 'Профессиональное обучение', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
9: ['Здравоохранение', 'Психология'],
10: ['Физическая культура', 'Информатика и вычислительная техника', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Сфера обслуживания'],
11: ['Приборостроение и оптотехника', 'Строительство', 'Дизайн', 'Информационная безопасность', 'Менеджмент', 'Архитектура и градостроительство', 'Информатика и вычислительная техника', 'Экономика', 'Технологии легкой промышленности', 'Государственное и муниципальное управление', 'Бизнес-информатика', 'Экология', 'Транспортные средства', 'Пищевые технологии', 'Энергетика и энергетическое машиностроение', 'Технологические машины и оборудование', 'Машиностроение', 'Химическая и биотехнологии'],
12: ['Лингвистика и иностранные языки', 'Геодезия и землеустройство', 'Востоковедение и африканистика', 'Социология', 'Юриспруденция', 'Здравоохранение', 'Экономика', 'Филология', 'Журналистика и литературное творчество', 'Библиотеки и архивы', 'Информатика и вычислительная техника', 'Психология', 'История', 'Менеджмент', 'Политология', 'Международные отношения', 'Сфера обслуживания', 'Социальная работа', 'Государственное и муниципальное управление', 'Лесное дело', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Реклама и связи с общественностью', 'Профессиональное обучение', 'География', 'Физика', 'Теория искусств', 'Педагогическое образование', 'Биология', 'Математика', 'Экология', 'Информационная безопасность', 'Химия', 'Автоматика и управление', 'Философия', 'Религиоведение и теология', 'Бизнес-информатика', 'Химическая и биотехнологии'],
13: ['Юриспруденция'],
14: ['Реклама и связи с общественностью', 'Психология', 'Юриспруденция', 'Государственное и муниципальное управление', 'Экономика'],
15: ['Информатика и вычислительная техника', 'Экономика', 'Менеджмент'],
16: ['Экономика', 'Менеджмент', 'Бизнес-информатика', 'Нефтегазовое дело', 'Информатика и вычислительная техника'],
17: ['Бизнес-информатика', 'Менеджмент', 'Нефтегазовое дело', 'Экономика'],
18: ['Информатика и вычислительная техника', 'Экономика', 'Технологические машины и оборудование', 'Экология'],
19: ['Здравоохранение'],
20: ['Педагогическое образование', 'Лингвистика и иностранные языки', 'Менеджмент', 'Международные отношения', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Юриспруденция', 'Сфера обслуживания', 'Экономика', 'Журналистика и литературное творчество', 'Дизайн', 'Филология', 'Психология', 'Реклама и связи с общественностью', 'Технологии легкой промышленности', 'Экология', 'Социология', 'Физика', 'Энергетика и энергетическое машиностроение', 'Авиационная и ракетно-космическая техника', 'Религиоведение и теология'],
21: ['Дизайн', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Менеджмент', 'Экономика'],
22: ['Транспортные средства', 'Экономика'],
23: ['Государственное и муниципальное управление', 'Юриспруденция', 'Педагогическое образование', 'Менеджмент'],
24: ['Информатика и вычислительная техника', 'Химическая и биотехнологии', 'Экономика', 'Технологические машины и оборудование'],
25: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Психология', 'Информатика и вычислительная техника', 'Социальная работа'],
26: ['Экономика', 'Информатика и вычислительная техника', 'Сельское и рыбное хозяйство', 'Пищевые технологии'],
27: ['Педагогическое образование', 'Информатика и вычислительная техника', 'Профессиональное обучение', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
28: ['Юриспруденция', 'Экономика'],
29: ['Информатика и вычислительная техника'],
30: ['Психология', 'Здравоохранение'],
31: ['Сфера обслуживания', 'Экономика', 'Нефтегазовое дело', 'Менеджмент', 'Автоматика и управление', 'Электронная техника, радиотехника и связь', 'Архитектура и градостроительство', 'Транспортные средства', 'Информационная безопасность', 'Информатика и вычислительная техника', 'Юриспруденция', 'Бизнес-информатика', 'Химическая и биотехнологии', 'Технологические машины и оборудование', 'Строительство', 'Биология', 'Физическая культура', 'Пищевые технологии', 'Сельское и рыбное хозяйство', 'Энергетика и энергетическое машиностроение', 'Геология', 'Психология'],
32: ['Востоковедение и африканистика', 'Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Дизайн', 'Информационная безопасность', 'Журналистика и литературное творчество', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Юриспруденция', 'Экономика', 'Психология', 'Физическая культура', 'Педагогическое образование', 'Архитектура и градостроительство', 'Социология', 'Сфера обслуживания', 'Информатика и вычислительная техника', 'Химия', 'Международные отношения', 'Политология', 'Государственное и муниципальное управление', 'Менеджмент', 'Математика', 'Биология', 'Библиотеки и архивы', 'Сельское и рыбное хозяйство', 'Социальная работа', 'Геология', 'Филология'],
33: ['Архитектура и градостроительство', 'Экономика', 'Информатика и вычислительная техника', 'Геодезия и землеустройство', 'Экология', 'Строительство'],
34: ['Юриспруденция'],
35: ['Государственное и муниципальное управление', 'Экономика', 'Юриспруденция', 'Менеджмент'],
36: ['Юриспруденция'],
37: ['Юриспруденция', 'Сельское и рыбное хозяйство', 'Экономика'],
38: ['Психология', 'Экономика', 'Сфера обслуживания', 'Бизнес-информатика', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника', 'Юриспруденция', 'Реклама и связи с общественностью', 'Менеджмент', 'Журналистика и литературное творчество', 'Государственное и муниципальное управление', 'Международные отношения', 'Геодезия и землеустройство', 'Строительство', 'Социальная работа', 'Теория искусств', 'Лесное дело'],
39: ['Экономика', 'Юриспруденция'],
40: ['Энергетика и энергетическое машиностроение', 'Информатика и вычислительная техника', 'Экономика', 'Автоматика и управление'],
41: ['Юриспруденция', 'Информатика и вычислительная техника', 'Экономика', 'Государственное и муниципальное управление'],
42: ['Юриспруденция'],
43: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
44: ['Управление водным транспортом', 'Морская техника', 'Экология', 'Транспортные средства', 'Энергетика и энергетическое машиностроение', 'Информационная безопасность'],
45: ['Информатика и вычислительная техника', 'Менеджмент', 'Машиностроение', 'Приборостроение и оптотехника', 'Экономика', 'Психология', 'Лингвистика и иностранные языки', 'Физическая культура', 'Автоматика и управление', 'Бизнес-информатика', 'Авиационная и ракетно-космическая техника', 'Технологические машины и оборудование', 'Вооружение', 'Реклама и связи с общественностью', 'Экология', 'Управление качеством', 'Политология', 'Электронная техника, радиотехника и связь', 'Энергетика и энергетическое машиностроение'],
46: ['Лингвистика и иностранные языки'],
47: ['Дизайн'],
48: ['Лингвистика и иностранные языки', 'Электронная техника, радиотехника и связь', 'Философия', 'Машиностроение', 'Реклама и связи с общественностью', 'Филология', 'Химическая и биотехнологии', 'Сфера обслуживания', 'Математика', 'Международные отношения', 'Строительство', 'История', 'Физическая культура', 'Психология', 'Политология', 'Информационная безопасность', 'Педагогическое образование', 'Менеджмент', 'Дизайн', 'Журналистика и литературное творчество', 'Информатика и вычислительная техника', 'Юриспруденция', 'Здравоохранение', 'Социология', 'Бизнес-информатика', 'Транспортные средства', 'Экономика', 'Биология', 'Химия', 'Геодезия и землеустройство', 'Библиотеки и архивы', 'Социальная работа', 'Физика'],
49: ['Экономика', 'Менеджмент'],
50: ['Экономика', 'Информатика и вычислительная техника', 'Сельское и рыбное хозяйство', 'Лесное дело', 'Пищевые технологии', 'Экология', 'Геодезия и землеустройство', 'Бизнес-информатика', 'Транспортные средства', 'Строительство', 'Энергетика и энергетическое машиностроение'],
51: ['Здравоохранение', 'Психология', 'Сестринское дело2', 'Биология', 'Социальная работа'],
52: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Профессиональное обучение', 'Лингвистика и иностранные языки', 'Педагогическое образование', 'Дизайн', 'Информатика и вычислительная техника', 'Физическая культура', 'Электронная техника, радиотехника и связь', 'Биология', 'Библиотеки и архивы', 'Социальная работа', 'Экология'],
53: ['Менеджмент', 'Международные отношения', 'Юриспруденция', 'Культурология', 'Математика', 'История', 'Журналистика и литературное творчество', 'Информатика и вычислительная техника', 'Психология', 'Востоковедение и африканистика', 'Сфера обслуживания', 'Лингвистика и иностранные языки', 'Экономика', 'Филология', 'Экология', 'Государственное и муниципальное управление', 'Бизнес-информатика', 'Педагогическое образование', 'Биология', 'Информационная безопасность', 'Реклама и связи с общественностью', 'Политология', 'Социология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Электронная техника, радиотехника и связь', 'Химическая и биотехнологии', 'Геология', 'Философия', 'Химия', 'География', 'Социальная работа', 'Материалы', 'Религиоведение и теология', 'Библиотеки и архивы', 'Издательское дело'],
54: ['Информатика и вычислительная техника', 'Юриспруденция'],
55: ['Информатика и вычислительная техника', 'Экономика', 'Пищевые технологии'],
56: ['Государственное и муниципальное управление', 'Экономика'],
57: ['Менеджмент', 'Лесное дело', 'Экология', 'Пищевые технологии', 'Экономика', 'Информатика и вычислительная техника', 'Профессиональное обучение', 'Сельское и рыбное хозяйство', 'Геодезия и землеустройство'],
58: ['Педагогическое образование', 'Социальная работа', 'Дизайн', 'Издательское дело', 'Сфера обслуживания', 'Библиотеки и архивы'],
59: ['Физическая культура', 'Социология', 'История', 'Сфера обслуживания', 'Филология', 'Педагогическое образование', 'Юриспруденция', 'Экономика', 'Журналистика и литературное творчество', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Здравоохранение', 'Информатика и вычислительная техника', 'Математика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Биология', 'Международные отношения', 'Психология', 'Менеджмент', 'Политология', 'Государственное и муниципальное управление', 'Автоматика и управление', 'Бизнес-информатика', 'Химия', 'Культурология', 'Информационная безопасность', 'Химическая и биотехнологии', 'Материалы', 'Философия', 'Библиотеки и архивы', 'Физика', 'Геология', 'Лесное дело', 'Социальная работа', 'Пищевые технологии', 'Экология', 'География', 'Приборостроение и оптотехника', 'Электронная техника, радиотехника и связь'],
60: ['Менеджмент', 'Автоматика и управление', 'Транспортные средства', 'Строительство', 'Технологические машины и оборудование', 'Бизнес-информатика', 'Политология', 'Архитектура и градостроительство', 'Экономика', 'Энергетика и энергетическое машиностроение', 'Управление качеством', 'Геология', 'Информатика и вычислительная техника', 'Машиностроение', 'Химическая и биотехнологии', 'Геодезия и землеустройство', 'Информационная безопасность', 'Профессиональное обучение', 'Лесное дело'],
61: ['Государственное и муниципальное управление', 'Юриспруденция', 'Сфера обслуживания', 'Экономика', 'Пищевые технологии', 'Психология', 'Менеджмент', 'Информационная безопасность', 'Бизнес-информатика', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью'],
62: ['Юриспруденция', 'Педагогическое образование', 'Экономика', 'Менеджмент', 'Математика'],
63: ['Информатика и вычислительная техника'],
64: ['Информатика и вычислительная техника', 'Экономика', 'Приборостроение и оптотехника', 'Транспортные средства'],
65: ['Педагогическое образование'],
66: ['Педагогическое образование'],
67: ['Педагогическое образование', 'Экология'],
68: ['Педагогическое образование', 'Математика', 'Информатика и вычислительная техника', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Физическая культура'],
69: ['Информатика и вычислительная техника'],
70: ['Машиностроение', 'Педагогическое образование'],
71: ['Менеджмент', 'Строительство', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Экономика', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
72: ['Транспортные средства', 'Экономика'],
73: ['Экономика', 'Информатика и вычислительная техника', 'Сельское и рыбное хозяйство', 'Менеджмент', 'Геодезия и землеустройство', 'Транспортные средства', 'Экология', 'Пищевые технологии', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение'],
74: ['Информатика и вычислительная техника', 'Экономика', 'Менеджмент', 'Государственное и муниципальное управление', 'Строительство', 'Химическая и биотехнологии', 'Транспортные средства'],
75: ['Бизнес-информатика', 'Менеджмент', 'Экономика', 'Информатика и вычислительная техника', 'Информационная безопасность', 'Транспортные средства', 'Энергетика и энергетическое машиностроение', 'Электронная техника, радиотехника и связь', 'Математика', 'Машиностроение', 'Автоматика и управление', 'Технологические машины и оборудование'],
76: ['Менеджмент', 'Биология', 'Профессиональное обучение', 'Юриспруденция', 'Экономика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Журналистика и литературное творчество', 'Международные отношения', 'Математика', 'Химия', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Педагогическое образование', 'Государственное и муниципальное управление', 'Социология', 'Социальная работа', 'Сфера обслуживания', 'Экология', 'Религиоведение и теология', 'География'],
77: ['Государственное и муниципальное управление', 'Экономика', 'Юриспруденция'],
78: ['Юриспруденция', 'Менеджмент', 'Экономика', 'Пищевые технологии'],
79: ['Технологические машины и оборудование', 'Химическая и биотехнологии', 'Менеджмент'],
80: ['Юриспруденция', 'Педагогическое образование', 'Строительство', 'Биология', 'Экономика', 'Транспортные средства'],
81: ['Геодезия и землеустройство', 'Энергетика и энергетическое машиностроение', 'Государственное и муниципальное управление', 'Лесное дело', 'Сельское и рыбное хозяйство', 'Сфера обслуживания', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Экономика', 'Реклама и связи с общественностью', 'Биология', 'Менеджмент', 'Экология'],
82: ['Юриспруденция', 'Физика', 'Экономика', 'Журналистика и литературное творчество', 'География', 'Здравоохранение', 'Информатика и вычислительная техника', 'Филология', 'Физическая культура', 'Психология', 'Менеджмент', 'Востоковедение и африканистика', 'Философия', 'Политология', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Международные отношения', 'Геология', 'Математика', 'Экология', 'Химия', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Биология', 'Социология', 'История', 'Социальная работа', 'Реклама и связи с общественностью', 'Геодезия и землеустройство'],
83: ['Электронная техника, радиотехника и связь', 'Информатика и вычислительная техника', 'Экономика'],
84: ['Информатика и вычислительная техника', 'Сельское и рыбное хозяйство', 'Экономика'],
85: ['Сельское и рыбное хозяйство'],
86: ['Информационная безопасность', 'Менеджмент', 'Экономика', 'Юриспруденция', 'Международные отношения', 'Реклама и связи с общественностью', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Строительство', 'Бизнес-информатика', 'Транспортные средства', 'Физическая культура', 'Государственное и муниципальное управление', 'Нефтегазовое дело', 'Социальная работа', 'Дизайн', 'Психология', 'Экология', 'Сфера обслуживания', 'Архитектура и градостроительство', 'Лингвистика и иностранные языки', 'Технологии легкой промышленности', 'Автоматика и управление'],
87: ['Психология', 'Физическая культура', 'Менеджмент', 'Бизнес-информатика', 'Экономика', 'Педагогическое образование', 'Технологии легкой промышленности', 'Информационная безопасность', 'Юриспруденция', 'Международные отношения', 'Нефтегазовое дело', 'Государственное и муниципальное управление', 'Транспортные средства', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника', 'Сфера обслуживания', 'Дизайн', 'Реклама и связи с общественностью', 'Экология', 'Электронная техника, радиотехника и связь'],
88: ['Экономика', 'Юриспруденция'],
89: ['Экономика', 'Юриспруденция'],
90: ['Экономика', 'Бизнес-информатика', 'Менеджмент', 'Государственное и муниципальное управление'],
91: ['Сфера обслуживания', 'Математика', 'Государственное и муниципальное управление', 'Физическая культура', 'Бизнес-информатика', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Журналистика и литературное творчество', 'Информатика и вычислительная техника', 'Психология', 'Архитектура и градостроительство', 'Охрана памятников', 'Реклама и связи с общественностью', 'Менеджмент', 'Экономика', 'Социология', 'Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информационная безопасность', 'Строительство', 'История', 'Автоматика и управление', 'Биология', 'Энергетика и энергетическое машиностроение', 'Управление качеством', 'Международные отношения', 'Религиоведение и теология', 'Приборостроение и оптотехника', 'Химическая и биотехнологии', 'Философия', 'Экология', 'Дизайн'],
92: ['Юриспруденция', 'Экономика', 'Менеджмент', 'Государственное и муниципальное управление'],
93: ['Сфера обслуживания', 'Пищевые технологии', 'Экономика'],
94: ['Государственное и муниципальное управление', 'Экономика', 'Менеджмент'],
95: ['Юриспруденция'],
96: ['Информационная безопасность', 'Электронная техника, радиотехника и связь'],
97: ['Экология', 'Экономика', 'Энергетика и энергетическое машиностроение', 'Сфера обслуживания', 'Информатика и вычислительная техника', 'Менеджмент', 'Сельское и рыбное хозяйство', 'Бизнес-информатика', 'Геодезия и землеустройство', 'Пищевые технологии', 'Профессиональное обучение', 'Лесное дело'],
98: ['Психология', 'Здравоохранение', 'Сельское и рыбное хозяйство', 'Менеджмент', 'Биология', 'Социальная работа', 'Приборостроение и оптотехника'],
99: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Дизайн', 'Сфера обслуживания', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Менеджмент', 'Информатика и вычислительная техника', 'Социальная работа'],
100: ['Автоматика и управление', 'Реклама и связи с общественностью', 'Сфера обслуживания', 'Энергетика и энергетическое машиностроение', 'Архитектура и градостроительство', 'Химическая и биотехнологии', 'Экология', 'Технологические машины и оборудование', 'Управление качеством', 'Технологии легкой промышленности', 'Строительство', 'Менеджмент', 'Информатика и вычислительная техника', 'Металлургия', 'Бизнес-информатика', 'Транспортные средства', 'Экономика', 'Пищевые технологии', 'Физика', 'Приборостроение и оптотехника', 'Авиационная и ракетно-космическая техника', 'Машиностроение'],
101: ['Лингвистика и иностранные языки', 'История', 'Сфера обслуживания', 'Юриспруденция', 'Педагогическое образование', 'Журналистика и литературное творчество', 'Химическая и биотехнологии', 'Психология', 'Экономика', 'Реклама и связи с общественностью', 'Социология', 'Филология', 'Биология', 'Международные отношения', 'Политология', 'Электронная техника, радиотехника и связь', 'Государственное и муниципальное управление', 'Бизнес-информатика', 'Социальная работа', 'Информатика и вычислительная техника', 'Менеджмент', 'Математика', 'Информационная безопасность', 'Экология', 'География', 'Геология', 'Физика'],
102: ['Экономика', 'Юриспруденция'],
103: ['Социология', 'Государственное и муниципальное управление', 'Юриспруденция', 'Психология', 'Экономика', 'Менеджмент'],
104: ['Юриспруденция', 'Государственное и муниципальное управление', 'Экономика', 'Менеджмент'],
105: ['Экономика', 'Менеджмент'],
106: ['Юриспруденция', 'Информатика и вычислительная техника', 'Экономика', 'Энергетика и энергетическое машиностроение'],
107: ['Экономика', 'Юриспруденция', 'Информационная безопасность', 'Экология', 'Строительство', 'Информатика и вычислительная техника', 'Управление водным транспортом', 'Менеджмент', 'Транспортные средства', 'Морская техника'],
108: ['Лингвистика и иностранные языки', 'Юриспруденция', 'Экономика', 'Математика'],
109: ['Менеджмент', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Экономика', 'Юриспруденция'],
110: ['Химическая и биотехнологии', 'Управление качеством', 'Экономика', 'Информатика и вычислительная техника', 'Архитектура и градостроительство', 'Бизнес-информатика', 'Менеджмент', 'Реклама и связи с общественностью', 'Строительство'],
111: ['Психология', 'Юриспруденция', 'Дизайн', 'Экономика', 'Реклама и связи с общественностью', 'Журналистика и литературное творчество', 'Информатика и вычислительная техника', 'Актерское исполнительство', 'Биология', 'Филология', 'Автоматика и управление', 'Социальная работа', 'Экология'],
112: ['Юриспруденция'],
113: ['Строительство'],
114: ['Сельское и рыбное хозяйство', 'Экономика', 'Менеджмент', 'Технологические машины и оборудование', 'Пищевые технологии', 'Управление качеством'],
115: ['Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Юриспруденция', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Архитектура и градостроительство', 'Экономика', 'Машиностроение', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Журналистика и литературное творчество', 'Сфера обслуживания', 'Химия', 'Физическая культура', 'Биология', 'Менеджмент', 'Социальная работа'],
116: ['Государственное и муниципальное управление', 'Экономика'],
117: ['Педагогическое образование'],
118: ['Нефтегазовое дело'],
119: ['Лесное дело', 'Сельское и рыбное хозяйство', 'Профессиональное обучение', 'Экономика', 'Информатика и вычислительная техника', 'Юриспруденция', 'Транспортные средства', 'Геодезия и землеустройство', 'Менеджмент', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Пищевые технологии'],
120: ['Автоматика и управление', 'Экономика', 'Информатика и вычислительная техника', 'Менеджмент', 'Сфера обслуживания', 'Лесное дело', 'Юриспруденция', 'Транспортные средства', 'Дизайн', 'Экология', 'Химическая и биотехнологии', 'Технологические машины и оборудование'],
121: ['Здравоохранение', 'Психология'],
122: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Дизайн', 'Педагогическое образование', 'Профессиональное обучение', 'Информатика и вычислительная техника', 'Экология'],
123: ['Приборостроение и оптотехника', 'Транспортные средства', 'Нефтегазовое дело', 'Экономика', 'Геодезия и землеустройство', 'Строительство', 'Архитектура и градостроительство', 'Информатика и вычислительная техника', 'Менеджмент', 'Реклама и связи с общественностью', 'Информационная безопасность', 'Автоматика и управление', 'Экология', 'Журналистика и литературное творчество', 'Электронная техника, радиотехника и связь', 'Сфера обслуживания', 'Металлургия', 'Энергетика и энергетическое машиностроение', 'Бизнес-информатика', 'Машиностроение', 'Физика', 'Технологические машины и оборудование', 'Авиационная и ракетно-космическая техника', 'Материалы', 'Ядерные физика и технологии'],
124: ['Бизнес-информатика', 'Востоковедение и африканистика', 'Здравоохранение', 'Политология', 'Юриспруденция', 'Менеджмент', 'Химия', 'Информатика и вычислительная техника', 'Библиотеки и архивы', 'Журналистика и литературное творчество', 'Экономика', 'Информационная безопасность', 'История', 'Математика', 'Психология', 'Лингвистика и иностранные языки', 'Издательское дело', 'Международные отношения', 'Ядерные физика и технологии', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Филология', 'Сфера обслуживания', 'Реклама и связи с общественностью', 'Геология', 'Государственное и муниципальное управление', 'Теория искусств', 'Социология', 'Биология', 'Философия', 'Экология', 'Автоматика и управление', 'География', 'Физика', 'Материалы', 'Почвоведение', 'Электронная техника, радиотехника и связь'],
125: ['Автоматика и управление', 'Управление качеством', 'Химическая и биотехнологии', 'Информационная безопасность', 'Сфера обслуживания', 'Информатика и вычислительная техника', 'Менеджмент', 'Экономика', 'Пищевые технологии', 'Технологические машины и оборудование', 'Энергетика и энергетическое машиностроение', 'Сельское и рыбное хозяйство', 'Биология', 'Экология'],
126: ['Информатика и вычислительная техника', 'Менеджмент', 'Сфера обслуживания'],
127: ['Юриспруденция', 'Экономика', 'Информатика и вычислительная техника'],
128: ['Менеджмент', 'Юриспруденция', 'Государственное и муниципальное управление'],
129: ['Сфера обслуживания', 'Менеджмент', 'Экономика', 'Информатика и вычислительная техника'],
130: ['Экономика', 'Менеджмент', 'Информатика и вычислительная техника', 'Юриспруденция', 'Психология'],
131: ['Юриспруденция'],
132: ['Международные отношения', 'Экономика', 'Реклама и связи с общественностью', 'Журналистика и литературное творчество', 'Юриспруденция', 'Дизайн', 'Менеджмент', 'Технологии легкой промышленности', 'Экология', 'Геология', 'Бизнес-информатика', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Лесное дело', 'Сфера обслуживания', 'Энергетика и энергетическое машиностроение', 'Пищевые технологии', 'Строительство', 'Математика'],
133: ['Юриспруденция'],
134: ['Экономика', 'Технологические машины и оборудование', 'Информатика и вычислительная техника'],
135: ['Государственное и муниципальное управление', 'Экономика', 'Юриспруденция', 'Менеджмент'],
136: ['Юриспруденция'],
137: ['Государственное и муниципальное управление', 'Экономика'],
138: ['Педагогическое образование'],
139: ['Металлургия', 'Материалы'],
140: ['Биология', 'Экономика', 'Сельское и рыбное хозяйство', 'Транспортные средства', 'Менеджмент'],
141: ['Менеджмент', 'Биология', 'Информатика и вычислительная техника', 'Сельское и рыбное хозяйство', 'Экономика', 'Транспортные средства'],
142: ['Математика', 'Филология', 'Бизнес-информатика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Журналистика и литературное творчество', 'Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Физическая культура', 'Информационная безопасность', 'Экономика', 'Сфера обслуживания', 'Психология', 'Государственное и муниципальное управление', 'Юриспруденция', 'Менеджмент', 'Педагогическое образование', 'Электронная техника, радиотехника и связь', 'Дизайн', 'Архитектура и градостроительство', 'Информатика и вычислительная техника', 'Автоматика и управление', 'История', 'Машиностроение', 'Социальная работа', 'Социология', 'Химическая и биотехнологии', 'Международные отношения', 'Строительство', 'Геодезия и землеустройство', 'Технологии легкой промышленности', 'Энергетика и энергетическое машиностроение', 'Экология', 'Культурология', 'География', 'Химия', 'Биология', 'Материалы', 'Лесное дело'],
143: ['Педагогическое образование'],
144: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника'],
145: ['Экономика', 'Юриспруденция', 'География', 'Социальная работа', 'Сфера обслуживания', 'Педагогическое образование', 'Филология', 'Математика', 'Экология', 'История'],
146: ['Юриспруденция', 'Сельское и рыбное хозяйство', 'Менеджмент', 'Энергетика и энергетическое машиностроение', 'Химическая и биотехнологии', 'Экономика', 'Геодезия и землеустройство', 'Транспортные средства'],
147: ['Лесное дело', 'Геодезия и землеустройство', 'Экология', 'Сельское и рыбное хозяйство', 'Пищевые технологии', 'Биология'],
148: ['Экономика', 'Юриспруденция', 'Культурология', 'Политология', 'История', 'Менеджмент', 'Психология', 'Лингвистика и иностранные языки', 'Философия', 'Международные отношения', 'Востоковедение и африканистика', 'Социология'],
149: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Здравоохранение', 'Юриспруденция', 'Государственное и муниципальное управление', 'Лингвистика и иностранные языки'],
150: ['Филология'],
151: ['Государственное и муниципальное управление', 'Лингвистика и иностранные языки', 'Дизайн', 'Экономика', 'Бизнес-информатика', 'Юриспруденция', 'Менеджмент', 'Сфера обслуживания', 'Социальная работа'],
152: ['Информационная безопасность', 'Транспортные средства', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Морская техника', 'Управление водным транспортом', 'Юриспруденция', 'Экономика'],
153: ['Экономика', 'Юриспруденция', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Профессиональное обучение', 'Государственное и муниципальное управление', 'Сфера обслуживания'],
154: ['Физика', 'Экономика', 'Юриспруденция', 'Психология', 'Лингвистика и иностранные языки', 'Государственное и муниципальное управление', 'Бизнес-информатика', 'Информатика и вычислительная техника', 'Социология', 'Экология', 'Математика', 'Материалы', 'Химия', 'Автоматика и управление', 'Авиационная и ракетно-космическая техника', 'Энергетика и энергетическое машиностроение', 'Ядерные физика и технологии', 'Геология', 'Электронная техника, радиотехника и связь'],
155: ['Информатика и вычислительная техника', 'Управление водным транспортом', 'Менеджмент', 'Морская техника', 'Экономика', 'Математика', 'Юриспруденция', 'Государственное и муниципальное управление', 'Транспортные средства', 'Информационная безопасность', 'Строительство', 'Энергетика и энергетическое машиностроение', 'Сфера обслуживания', 'Авиационные системы (эксплуатация)', 'Экология'],
156: ['Геодезия и землеустройство', 'Архитектура и градостроительство', 'Лесное дело', 'Юриспруденция', 'Экология', 'Менеджмент', 'Дизайн'],
157: ['Дизайн', 'История', 'Педагогическое образование', 'Менеджмент', 'Психология', 'Биология', 'Государственное и муниципальное управление', 'Физическая культура', 'Экономика', 'Здравоохранение', 'Политология', 'Филология', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Юриспруденция', 'Экология'],
158: ['Психология', 'Политология', 'Менеджмент', 'Юриспруденция', 'Экономика', 'Информатика и вычислительная техника', 'Социология', 'Реклама и связи с общественностью', 'Сфера обслуживания', 'Государственное и муниципальное управление', 'Математика', 'Бизнес-информатика', 'Экология'],
159: ['Лесное дело', 'Юриспруденция', 'Геодезия и землеустройство', 'Энергетика и энергетическое машиностроение', 'Экология', 'Архитектура и градостроительство', 'Менеджмент', 'Экономика', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Нефтегазовое дело', 'Электронная техника, радиотехника и связь', 'Государственное и муниципальное управление', 'Технологические машины и оборудование', 'Строительство', 'Химическая и биотехнологии', 'Транспортные средства', 'Автоматика и управление'],
160: ['Юриспруденция', 'Экономика'],
161: ['Филология', 'Экономика', 'Педагогическое образование', 'Сфера обслуживания', 'Дизайн'],
162: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Бизнес-информатика', 'Государственное и муниципальное управление', 'Юриспруденция', 'Менеджмент'],
163: ['Менеджмент', 'Государственное и муниципальное управление'],
164: ['Журналистика и литературное творчество'],
165: ['Государственное и муниципальное управление', 'Экономика', 'Педагогическое образование', 'Психология', 'Юриспруденция', 'Лингвистика и иностранные языки'],
166: ['Информатика и вычислительная техника', 'Журналистика и литературное творчество', 'Психология', 'Юриспруденция', 'Сфера обслуживания', 'Реклама и связи с общественностью', 'Экономика', 'Менеджмент'],
167: ['Пищевые технологии', 'Экономика', 'Сельское и рыбное хозяйство', 'Информатика и вычислительная техника', 'Биология', 'Энергетика и энергетическое машиностроение'],
168: ['Здравоохранение'],
169: ['Профессиональное обучение', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Психология'],
170: ['Информатика и вычислительная техника', 'Психология', 'Архитектура и градостроительство', 'Автоматика и управление', 'Информационная безопасность', 'Строительство', 'Нефтегазовое дело', 'Экономика', 'Юриспруденция', 'Транспортные средства', 'Менеджмент'],
171: ['Менеджмент', 'Юриспруденция', 'Экономика', 'Информационная безопасность', 'Лингвистика и иностранные языки', 'Строительство', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Геодезия и землеустройство', 'Сфера обслуживания'],
172: ['Юриспруденция', 'Востоковедение и африканистика', 'Журналистика и литературное творчество', 'Менеджмент', 'Математика', 'Международные отношения', 'Лингвистика и иностранные языки', 'Биология', 'Филология', 'Экономика', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Психология', 'Государственное и муниципальное управление', 'Информационная безопасность', 'Химия', 'Сфера обслуживания', 'Педагогическое образование', 'Социальная работа', 'История', 'Политология'],
173: ['Юриспруденция', 'Государственное и муниципальное управление', 'Экономика'],
174: ['Энергетика и энергетическое машиностроение', 'Лесное дело', 'Экология', 'Строительство', 'Экономика', 'Сельское и рыбное хозяйство', 'Менеджмент', 'Транспортные средства', 'Геодезия и землеустройство'],
175: ['Психология', 'Здравоохранение'],
176: ['Экономика', 'Энергетика и энергетическое машиностроение', 'Экология', 'Менеджмент', 'Технологические машины и оборудование', 'Управление водным транспортом', 'Морская техника', 'Химическая и биотехнологии', 'Сельское и рыбное хозяйство', 'Транспортные средства', 'Управление качеством', 'Пищевые технологии'],
177: ['Экономика', 'Информатика и вычислительная техника', 'Сфера обслуживания', 'Международные отношения', 'Юриспруденция', 'Психология', 'Нефтегазовое дело', 'Архитектура и градостроительство', 'Менеджмент', 'Информационная безопасность', 'Математика', 'Электронная техника, радиотехника и связь', 'Библиотеки и архивы', 'Лингвистика и иностранные языки', 'Экология', 'Строительство', 'Энергетика и энергетическое машиностроение', 'Транспортные средства'],
178: ['Юриспруденция'],
179: ['Экономика', 'Государственное и муниципальное управление', 'Юриспруденция', 'Менеджмент', 'Социальная работа'],
180: ['Биология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Геология', 'Информатика и вычислительная техника', 'Политология', 'Химия', 'Юриспруденция', 'Энергетика и энергетическое машиностроение', 'Педагогическое образование', 'Психология', 'Международные отношения', 'История', 'Пищевые технологии', 'Журналистика и литературное творчество', 'Философия', 'Социология', 'Филология', 'Математика', 'Дизайн', 'Сфера обслуживания', 'Лингвистика и иностранные языки', 'Машиностроение', 'Востоковедение и африканистика', 'Строительство', 'Информационная безопасность', 'Транспортные средства', 'Нефтегазовое дело', 'Геодезия и землеустройство', 'Менеджмент', 'Экономика', 'Морская техника', 'Архитектура и градостроительство', 'Химическая и биотехнологии', 'Здравоохранение', 'Реклама и связи с общественностью', 'Экология', 'Автоматика и управление', 'Бизнес-информатика', 'Электронная техника, радиотехника и связь', 'Физика', 'Физическая культура', 'Издательское дело', 'Социальная работа', 'Приборостроение и оптотехника', 'География', 'Государственное и муниципальное управление', 'Технологические машины и оборудование', 'Управление качеством'],
181: ['Экономика', 'Юриспруденция', 'Менеджмент'],
182: ['Юриспруденция'],
183: ['Юриспруденция', 'Экономика', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью', 'Государственное и муниципальное управление'],
184: ['Государственное и муниципальное управление', 'Экономика', 'Менеджмент', 'Бизнес-информатика'],
185: ['Юриспруденция', 'Экономика', 'Информатика и вычислительная техника'],
186: ['Информатика и вычислительная техника', 'Менеджмент', 'Строительство', 'Государственное и муниципальное управление', 'Транспортные средства'],
187: ['Строительство', 'Менеджмент', 'Экономика', 'Информатика и вычислительная техника', 'Транспортные средства'],
188: ['Экономика', 'Энергетика и энергетическое машиностроение', 'Сельское и рыбное хозяйство'],
189: ['Экономика'],
190: ['Экономика', 'Сельское и рыбное хозяйство', 'Экология', 'Пищевые технологии', 'Менеджмент', 'Сфера обслуживания', 'Химическая и биотехнологии'],
191: ['Авиационная и ракетно-космическая техника', 'Библиотеки и архивы', 'Сельское и рыбное хозяйство', 'Религиоведение и теология', 'Математика', 'Здравоохранение', 'Юриспруденция', 'Строительство', 'Морская техника', 'Лингвистика и иностранные языки', 'Дизайн', 'Психология', 'Физическая культура', 'Социальная работа', 'Реклама и связи с общественностью', 'Транспортные средства', 'Экология', 'Архитектура и градостроительство', 'Информационная безопасность', 'Педагогическое образование', 'Химическая и биотехнологии', 'Экономика', 'Технологии легкой промышленности', 'Менеджмент', 'Информатика и вычислительная техника', 'Автоматика и управление', 'Бизнес-информатика', 'Машиностроение', 'Сфера обслуживания', 'Пищевые технологии', 'Технологические машины и оборудование', 'Приборостроение и оптотехника', 'Материалы', 'Профессиональное обучение', 'Геодезия и землеустройство', 'Электронная техника, радиотехника и связь', 'Физика', 'Энергетика и энергетическое машиностроение', 'Управление качеством'],
192: ['Экономика', 'Пищевые технологии'],
193: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование'],
194: ['Автоматика и управление', 'Экология', 'Менеджмент', 'Энергетика и энергетическое машиностроение'],
195: ['Юриспруденция', 'Экономика', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника', 'Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Профессиональное обучение'],
196: ['Менеджмент', 'Психология', 'Информатика и вычислительная техника', 'Здравоохранение', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Педагогическое образование', 'Экономика', 'Журналистика и литературное творчество', 'Информационная безопасность', 'История', 'Социальная работа', 'Филология', 'Государственное и муниципальное управление', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
197: ['Информатика и вычислительная техника', 'Экономика', 'Менеджмент', 'Юриспруденция'],
198: ['Менеджмент', 'Электронная техника, радиотехника и связь', 'Информатика и вычислительная техника', 'Авиационная и ракетно-космическая техника', 'Авиационные системы (эксплуатация)'],
199: ['Сельское и рыбное хозяйство', 'Экономика', 'Биология', 'Геодезия и землеустройство'],
200: ['Экономика', 'Психология', 'Профессиональное обучение', 'Лингвистика и иностранные языки', 'Востоковедение и африканистика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Сфера обслуживания', 'Юриспруденция', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Журналистика и литературное творчество', 'Филология', 'Международные отношения', 'Педагогическое образование', 'Архитектура и градостроительство', 'Социальная работа', 'Менеджмент', 'Реклама и связи с общественностью', 'Информационная безопасность', 'Дизайн', 'Математика', 'Строительство', 'Геология', 'Социология', 'Политология', 'Энергетика и энергетическое машиностроение', 'Транспортные средства'],
201: ['Экономика', 'Транспортные средства', 'Менеджмент'],
202: ['Юриспруденция'],
203: ['Менеджмент', 'Государственное и муниципальное управление', 'Юриспруденция', 'Экономика', 'Сфера обслуживания'],
204: ['Экономика', 'Автоматика и управление', 'Менеджмент', 'Информатика и вычислительная техника', 'Строительство'],
205: ['Информатика и вычислительная техника', 'Технологические машины и оборудование'],
206: ['Информатика и вычислительная техника', 'Экономика', 'Юриспруденция'],
207: ['Психология', 'Здравоохранение'],
208: ['Экономика', 'Сельское и рыбное хозяйство', 'Геодезия и землеустройство'],
209: ['Юриспруденция'],
210: ['Технологии легкой промышленности', 'Сфера обслуживания', 'Архитектура и градостроительство', 'Строительство', 'Информатика и вычислительная техника', 'Дизайн', 'Экономика', 'Технологические машины и оборудование', 'Управление качеством', 'Материалы', 'Транспортные средства', 'Менеджмент'],
211: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Филология', 'Юриспруденция', 'Журналистика и литературное творчество', 'Физическая культура', 'Международные отношения', 'Реклама и связи с общественностью', 'Педагогическое образование', 'Экономика', 'История', 'Менеджмент', 'Математика', 'Социология', 'Психология', 'Информационная безопасность', 'Биология', 'Информатика и вычислительная техника', 'Химия', 'Физика', 'Автоматика и управление', 'Социальная работа'],
212: ['Информатика и вычислительная техника', 'Технологические машины и оборудование', 'Менеджмент', 'Химия', 'Автоматика и управление', 'Химическая и биотехнологии', 'Технологии легкой промышленности', 'Пищевые технологии', 'Управление качеством'],
213: ['Информатика и вычислительная техника', 'Менеджмент', 'Ядерные физика и технологии', 'Энергетика и энергетическое машиностроение', 'Технологические машины и оборудование', 'Электронная техника, радиотехника и связь', 'Математика', 'Экология', 'Автоматика и управление'],
214: ['Государственное и муниципальное управление', 'Экономика', 'Юриспруденция'],
215: ['Экономика', 'Информатика и вычислительная техника', 'Менеджмент', 'Пищевые технологии'],
216: ['Здравоохранение'],
217: ['Экономика', 'Менеджмент', 'Сельское и рыбное хозяйство', 'Информатика и вычислительная техника', 'Лесное дело', 'Пищевые технологии'],
218: ['Архитектура и градостроительство', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Информационная безопасность', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Менеджмент', 'Экономика', 'Дизайн', 'Физическая культура', 'Строительство', 'Технологические машины и оборудование', 'Профессиональное обучение', 'Электронная техника, радиотехника и связь', 'Энергетика и энергетическое машиностроение', 'Вооружение', 'Управление качеством', 'Государственное и муниципальное управление', 'Транспортные средства', 'Автоматика и управление', 'Авиационная и ракетно-космическая техника', 'Экология', 'Машиностроение', 'Приборостроение и оптотехника'],
219: ['Юриспруденция'],
246: ['Экономика', 'Менеджмент', 'Информатика и вычислительная техника', 'Юриспруденция', 'Государственное и муниципальное управление', 'История', 'Здравоохранение', 'Педагогическое образование', 'Филология', 'Психология', 'Химия', 'Социальная работа'],
220: ['Юриспруденция', 'Государственное и муниципальное управление'],
221: ['Дизайн', 'Бизнес-информатика', 'Менеджмент', 'Реклама и связи с общественностью'],
222: ['Управление водным транспортом', 'Морская техника'],
223: ['Дизайн', 'Реклама и связи с общественностью', 'Теория искусств', 'Лингвистика и иностранные языки', 'Психология', 'Журналистика и литературное творчество'],
224: ['Менеджмент', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Экономика', 'Юриспруденция', 'Бизнес-информатика', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки'],
225: ['Менеджмент', 'Юриспруденция'],
226: ['Лингвистика и иностранные языки'],
227: ['Журналистика и литературное творчество', 'Реклама и связи с общественностью'],
228: ['Журналистика и литературное творчество', 'Реклама и связи с общественностью'],
229: ['Государственное и муниципальное управление', 'Журналистика и литературное творчество', 'Лингвистика и иностранные языки', 'Психология', 'Бизнес-информатика', 'Экономика', 'Реклама и связи с общественностью', 'Юриспруденция', 'Менеджмент', 'Информатика и вычислительная техника'],
230: ['Менеджмент', 'Юриспруденция', 'Психология', 'Бизнес-информатика', 'Реклама и связи с общественностью', 'Государственное и муниципальное управление', 'Экономика'],
231: ['Менеджмент', 'Экономика'],
232: ['Менеджмент', 'Юриспруденция', 'Государственное и муниципальное управление', 'Дизайн', 'Международные отношения', 'Политология', 'Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Экономика', 'Психология', 'Бизнес-информатика', 'Журналистика и литературное творчество'],
233: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
234: ['Сфера обслуживания', 'Пищевые технологии'],
235: ['Государственное и муниципальное управление', 'Юриспруденция', 'Менеджмент'],
236: ['Юриспруденция', 'Информационная безопасность', 'Экономика', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Информатика и вычислительная техника', 'Архитектура и градостроительство', 'Строительство', 'Энергетика и энергетическое машиностроение', 'Пищевые технологии', 'Дизайн', 'Автоматика и управление', 'Менеджмент', 'Транспортные средства'],
237: ['Дизайн', 'Менеджмент', 'Журналистика и литературное творчество'],
238: ['Юриспруденция', 'Дизайн', 'Экономика', 'Менеджмент', 'Сфера обслуживания', 'Технологии легкой промышленности', 'Технологические машины и оборудование', 'Информатика и вычислительная техника', 'Строительство', 'Энергетика и энергетическое машиностроение', 'Электронная техника, радиотехника и связь', 'Экология'],
239: ['Экономика', 'Сфера обслуживания', 'Информатика и вычислительная техника'],
240: ['Сфера обслуживания'],
241: ['Юриспруденция', 'Экономика'],
242: ['Юриспруденция', 'Экономика'],
243: ['Экономика', 'Менеджмент'],
244: ['Юриспруденция', 'Менеджмент', 'Экономика'],
245: ['Ядерные физика и технологии'],
247: ['Экономика', 'Геодезия и землеустройство', 'Менеджмент', 'Лесное дело', 'Транспортные средства', 'Энергетика и энергетическое машиностроение', 'Сельское и рыбное хозяйство', 'Профессиональное обучение', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Биология', 'Сфера обслуживания'],
248: ['Здравоохранение', 'Психология', 'Сестринское дело2'],
249: ['Психология', 'Менеджмент', 'Журналистика и литературное творчество', 'Экономика', 'Юриспруденция', 'Информатика и вычислительная техника', 'Педагогическое образование', 'Филология', 'Государственное и муниципальное управление', 'Лингвистика и иностранные языки', 'Социология', 'История', 'Политология', 'Международные отношения', 'Профессиональное обучение', 'Социальная работа', 'Сфера обслуживания', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Реклама и связи с общественностью', 'Математика', 'Философия', 'Информационная безопасность', 'Химия', 'Биология', 'Религиоведение и теология', 'Электронная техника, радиотехника и связь', 'Экология', 'Культурология', 'Почвоведение', 'Физика', 'География', 'Геология', 'Бизнес-информатика', 'Охрана памятников'],
250: ['Информатика и вычислительная техника', 'Экономика', 'Менеджмент', 'Информационная безопасность', 'Государственное и муниципальное управление', 'Строительство', 'Транспортные средства', 'Автоматика и управление'],
251: ['Юриспруденция', 'Государственное и муниципальное управление'],
252: ['Автоматика и управление', 'Лингвистика и иностранные языки', 'Авиационная и ракетно-космическая техника', 'Транспортные средства', 'Экономика', 'Строительство', 'Архитектура и градостроительство', 'Дизайн', 'Энергетика и энергетическое машиностроение', 'Журналистика и литературное творчество', 'Информационная безопасность', 'Нефтегазовое дело', 'Юриспруденция', 'Менеджмент', 'Информатика и вычислительная техника', 'Технологические машины и оборудование', 'Геология', 'Реклама и связи с общественностью', 'Химическая и биотехнологии', 'Пищевые технологии', 'Металлургия', 'Электронная техника, радиотехника и связь', 'Экология', 'Машиностроение', 'Геодезия и землеустройство', 'Авиационные системы (эксплуатация)', 'Управление качеством'],
253: ['Авиационные системы (эксплуатация)'],
254: ['Педагогическое образование'],
255: ['Экономика', 'Пищевые технологии', 'Строительство', 'Менеджмент', 'Профессиональное обучение', 'Сфера обслуживания', 'Сельское и рыбное хозяйство', 'Государственное и муниципальное управление', 'Энергетика и энергетическое машиностроение', 'Геодезия и землеустройство'],
256: ['История', 'Управление качеством', 'Сфера обслуживания', 'Здравоохранение', 'Информационная безопасность', 'Информатика и вычислительная техника', 'Архитектура и градостроительство', 'Социальная работа', 'Строительство', 'Журналистика и литературное творчество', 'Менеджмент', 'Психология', 'Государственное и муниципальное управление', 'Химия', 'Химическая и биотехнологии', 'Математика', 'Экономика', 'Автоматика и управление', 'Социология', 'Биология', 'Лингвистика и иностранные языки', 'Педагогическое образование', 'Юриспруденция', 'Филология', 'Электронная техника, радиотехника и связь', 'Физическая культура', 'Международные отношения', 'Дизайн'],
257: ['Сельское и рыбное хозяйство', 'Химическая и биотехнологии'],
258: ['Психология', 'Нефтегазовое дело', 'Реклама и связи с общественностью', 'Педагогическое образование', 'Химия', 'Юриспруденция', 'Геология', 'Математика', 'Журналистика и литературное творчество', 'Востоковедение и африканистика', 'Сфера обслуживания', 'Бизнес-информатика', 'Социология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Архитектура и градостроительство', 'Биология', 'Государственное и муниципальное управление', 'Политология', 'Профессиональное обучение', 'Дизайн', 'Информационная безопасность', 'Автоматика и управление', 'Международные отношения', 'Здравоохранение', 'Философия', 'Экономика', 'Филология', 'Издательское дело', 'История', 'Менеджмент', 'Информатика и вычислительная техника', 'Лингвистика и иностранные языки', 'Химическая и биотехнологии', 'Культурология', 'Религиоведение и теология', 'Почвоведение', 'Управление качеством', 'Экология', 'География', 'Геодезия и землеустройство', 'Физика', 'Технологические машины и оборудование', 'Приборостроение и оптотехника'],
259: ['Экология', 'Профессиональное обучение', 'Информатика и вычислительная техника', 'Геодезия и землеустройство', 'Химическая и биотехнологии', 'Транспортные средства', 'Бизнес-информатика', 'Сельское и рыбное хозяйство', 'Государственное и муниципальное управление', 'Экономика', 'Лесное дело', 'Менеджмент', 'Управление качеством'],
260: ['Менеджмент', 'Сфера обслуживания', 'Архитектура и градостроительство', 'Дизайн', 'Строительство', 'Лесное дело', 'Информатика и вычислительная техника', 'Геодезия и землеустройство', 'Экология', 'Транспортные средства'],
261: ['Здравоохранение', 'Сестринское дело2', 'Социальная работа'],
262: ['Реклама и связи с общественностью', 'Ядерные физика и технологии', 'Менеджмент', 'Социология', 'Энергетика и энергетическое машиностроение', 'Информатика и вычислительная техника', 'Экономика', 'Автоматика и управление', 'Экология'],
264: ['Лингвистика и иностранные языки', 'Дизайн', 'Менеджмент', 'Бизнес-информатика', 'Психология', 'Педагогическое образование', 'Управление качеством', 'Экономика', 'Информатика и вычислительная техника', 'Сфера обслуживания', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Государственное и муниципальное управление', 'Пищевые технологии', 'Юриспруденция', 'Экология'],
263: ['Юриспруденция'],
265: ['Энергетика и энергетическое машиностроение', 'Приборостроение и оптотехника', 'Авиационная и ракетно-космическая техника', 'Информационная безопасность', 'Информатика и вычислительная техника', 'Менеджмент', 'Авиационные системы (эксплуатация)', 'Математика', 'Экономика', 'Технологические машины и оборудование', 'Управление качеством', 'Автоматика и управление', 'Транспортные средства', 'Экология', 'Электронная техника, радиотехника и связь', 'Машиностроение', 'Морская техника', 'Физика', 'Материалы', 'Юриспруденция', 'Реклама и связи с общественностью'],
266: ['Сфера обслуживания', 'Информатика и вычислительная техника', 'Социология', 'Технологии легкой промышленности', 'Экология', 'Реклама и связи с общественностью', 'Экономика', 'Педагогическое образование', 'Информационная безопасность', 'Пищевые технологии', 'Государственное и муниципальное управление', 'Математика', 'Менеджмент', 'Химическая и биотехнологии', 'Автоматика и управление', 'Социальная работа', 'Нефтегазовое дело', 'Издательское дело', 'Лесное дело', 'Материалы', 'Энергетика и энергетическое машиностроение', 'Ядерные физика и технологии', 'Дизайн', 'Здравоохранение', 'Приборостроение и оптотехника', 'Технологические машины и оборудование', 'Геология', 'Управление качеством'],
267: ['Управление водным транспортом'],
268: ['Юриспруденция', 'Экономика'],
269: ['Автоматика и управление', 'Сельское и рыбное хозяйство', 'Экономика', 'Строительство', 'Экология', 'Информационная безопасность', 'Информатика и вычислительная техника', 'Менеджмент', 'Химическая и биотехнологии', 'Технологические машины и оборудование', 'Энергетика и энергетическое машиностроение', 'Морская техника', 'Пищевые технологии', 'Машиностроение', 'Сфера обслуживания'],
270: ['Менеджмент', 'Юриспруденция', 'Государственное и муниципальное управление', 'Реклама и связи с общественностью', 'Экономика'],
271: ['Психология', 'Экономика'],
272: ['Сельское и рыбное хозяйство'],
273: ['Филология', 'Лингвистика и иностранные языки', 'Библиотеки и архивы', 'Педагогическое образование', 'Журналистика и литературное творчество', 'История', 'Сельское и рыбное хозяйство', 'Строительство', 'Математика', 'Государственное и муниципальное управление', 'Востоковедение и африканистика', 'Юриспруденция', 'Экономика', 'Химия', 'Бизнес-информатика', 'Здравоохранение', 'Менеджмент', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Международные отношения', 'Сфера обслуживания', 'Информационная безопасность', 'Геодезия и землеустройство', 'Транспортные средства'],
274: ['Юриспруденция', 'Лингвистика и иностранные языки', 'Психология', 'Архитектура и градостроительство', 'Дизайн', 'Социальная работа', 'Экономика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Журналистика и литературное творчество', 'Политология', 'Информатика и вычислительная техника', 'Сфера обслуживания', 'Филология', 'Здравоохранение', 'Геодезия и землеустройство', 'Социология', 'Государственное и муниципальное управление', 'История', 'Химия', 'Биология', 'Менеджмент', 'Реклама и связи с общественностью'],
275: ['Юриспруденция'],
276: ['Автоматика и управление', 'Машиностроение', 'Приборостроение и оптотехника', 'Информационная безопасность', 'Информатика и вычислительная техника', 'Транспортные средства', 'Энергетика и энергетическое машиностроение', 'Электронная техника, радиотехника и связь', 'Менеджмент'],
277: ['Государственное и муниципальное управление', 'Экономика', 'Менеджмент'],
278: ['Экономика', 'Сельское и рыбное хозяйство', 'Менеджмент'],
279: ['Экономика', 'Бизнес-информатика', 'Менеджмент'],
280: ['Менеджмент', 'Информатика и вычислительная техника'],
281: ['Экономика', 'Менеджмент', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление'],
282: ['Лингвистика и иностранные языки', 'Юриспруденция', 'Сфера обслуживания', 'Педагогическое образование', 'Психология', 'Менеджмент', 'Политология', 'Биология'],
283: ['Технологии легкой промышленности', 'Информатика и вычислительная техника', 'Экономика'],
284: ['Математика', 'Педагогическое образование', 'География', 'Сфера обслуживания', 'Государственное и муниципальное управление', 'Экономика'],
285: ['Государственное и муниципальное управление', 'Экономика', 'Юриспруденция'],
286: ['Управление водным транспортом', 'Транспортные средства', 'Морская техника'],
287: ['Психология', 'Здравоохранение', 'Сестринское дело2'],
288: ['Экономика', 'Менеджмент', 'Государственное и муниципальное управление', 'Сельское и рыбное хозяйство', 'Транспортные средства'],
289: ['Экономика', 'Журналистика и литературное творчество', 'Экология', 'Государственное и муниципальное управление', 'Международные отношения', 'Менеджмент', 'Психология', 'Геология', 'Электронная техника, радиотехника и связь', 'Юриспруденция', 'Филология', 'Химия', 'Биология', 'Социология', 'Реклама и связи с общественностью', 'История', 'Лингвистика и иностранные языки', 'Сфера обслуживания', 'Математика', 'Педагогическое образование', 'Сельское и рыбное хозяйство', 'Физика', 'Информатика и вычислительная техника', 'Здравоохранение', 'Физическая культура', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'География', 'Пищевые технологии', 'Социальная работа', 'Технологические машины и оборудование', 'Энергетика и энергетическое машиностроение', 'Автоматика и управление', 'Химическая и биотехнологии'],
290: ['Информатика и вычислительная техника', 'Менеджмент', 'Экономика', 'Юриспруденция', 'Сфера обслуживания'],
291: ['Экономика'],
292: ['Психология', 'Здравоохранение', 'Сестринское дело2', 'Менеджмент'],
293: ['Юриспруденция', 'Реклама и связи с общественностью', 'Психология', 'Экономика', 'Журналистика и литературное творчество', 'Дизайн'],
294: ['Дизайн', 'Юриспруденция', 'Экономика', 'Менеджмент', 'Психология'],
295: ['Дизайн', 'Экономика', 'Юриспруденция'],
296: ['Государственное и муниципальное управление', 'Экономика', 'Юриспруденция', 'Менеджмент'],
297: ['Менеджмент', 'Экономика', 'Автоматика и управление', 'Приборостроение и оптотехника', 'Технологические машины и оборудование', 'Вооружение', 'Информатика и вычислительная техника'],
298: ['Энергетика и энергетическое машиностроение', 'Юриспруденция', 'Информатика и вычислительная техника', 'Строительство', 'Экономика', 'Технологические машины и оборудование', 'Автоматика и управление', 'Государственное и муниципальное управление', 'Менеджмент'],
299: ['Юриспруденция', 'Государственное и муниципальное управление', 'Экономика', 'Менеджмент', 'Международные отношения', 'Библиотеки и архивы'],
300: ['Юриспруденция', 'Государственное и муниципальное управление', 'Лингвистика и иностранные языки', 'Архитектура и градостроительство', 'Менеджмент', 'Экономика', 'Информатика и вычислительная техника', 'Библиотеки и архивы', 'Авиационная и ракетно-космическая техника', 'Машиностроение', 'Сфера обслуживания', 'Электронная техника, радиотехника и связь', 'Социальная работа', 'Энергетика и энергетическое машиностроение', 'Химическая и биотехнологии', 'Технологические машины и оборудование', 'Геодезия и землеустройство'],
301: ['Юриспруденция'],
302: ['Экономика', 'Лесное дело', 'Менеджмент', 'Архитектура и градостроительство', 'Сельское и рыбное хозяйство', 'Строительство', 'Энергетика и энергетическое машиностроение', 'Транспортные средства'],
303: ['Психология', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника', 'Юриспруденция', 'Экономика', 'Педагогическое образование', 'Филология', 'Технологические машины и оборудование', 'Журналистика и литературное творчество', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Дизайн', 'Химия', 'Менеджмент', 'История', 'Социальная работа', 'Бизнес-информатика', 'Математика', 'Государственное и муниципальное управление', 'Лесное дело', 'Сфера обслуживания'],
304: ['Менеджмент', 'Журналистика и литературное творчество', 'Биология', 'Филология', 'Государственное и муниципальное управление', 'Математика', 'Пищевые технологии', 'Бизнес-информатика', 'Экономика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника', 'Педагогическое образование', 'Юриспруденция', 'Сфера обслуживания', 'Дизайн', 'Информационная безопасность', 'Химия', 'Социальная работа', 'История'],
305: ['Экономика', 'Менеджмент', 'Сфера обслуживания', 'Пищевые технологии'],
306: ['Бизнес-информатика', 'Менеджмент', 'Экономика', 'Математика'],
307: ['Государственное и муниципальное управление', 'Экология', 'Юриспруденция', 'Экономика', 'Биология', 'Информатика и вычислительная техника', 'Профессиональное обучение', 'Сельское и рыбное хозяйство', 'Геодезия и землеустройство', 'Менеджмент', 'Лесное дело', 'Реклама и связи с общественностью', 'Технологические машины и оборудование'],
308: ['Психология', 'Здравоохранение'],
309: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Социальная работа', 'Политология'],
310: ['Менеджмент', 'Экономика', 'Транспортные средства', 'Строительство'],
311: ['Профессиональное обучение', 'Менеджмент', 'Журналистика и литературное творчество', 'Экономика', 'Дизайн', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника', 'Психология', 'Филология', 'История', 'Технологические машины и оборудование', 'Транспортные средства', 'Машиностроение', 'Педагогическое образование'],
312: ['Государственное и муниципальное управление', 'Бизнес-информатика', 'Лингвистика и иностранные языки', 'История', 'Философия', 'Политология', 'Здравоохранение', 'Педагогическое образование', 'Менеджмент', 'Реклама и связи с общественностью', 'Строительство', 'Журналистика и литературное творчество', 'Экономика', 'Международные отношения', 'Энергетика и энергетическое машиностроение', 'Сфера обслуживания', 'Физическая культура', 'Издательское дело', 'Психология', 'Информационная безопасность', 'Архитектура и градостроительство', 'Информатика и вычислительная техника', 'Электронная техника, радиотехника и связь', 'Математика', 'Филология', 'Юриспруденция', 'География', 'Сельское и рыбное хозяйство', 'Автоматика и управление', 'Культурология', 'Библиотеки и архивы', 'Биология', 'Химия', 'Экология'],
313: ['Юриспруденция'],
314: ['Транспортные средства', 'Экология', 'Пищевые технологии', 'Государственное и муниципальное управление', 'Строительство', 'Сельское и рыбное хозяйство', 'Энергетика и энергетическое машиностроение', 'Менеджмент', 'Бизнес-информатика', 'Экономика', 'Юриспруденция', 'Геодезия и землеустройство', 'Архитектура и градостроительство', 'Информатика и вычислительная техника'],
315: ['Менеджмент', 'Пищевые технологии', 'Строительство', 'Экология', 'Архитектура и градостроительство', 'Транспортные средства', 'Сельское и рыбное хозяйство', 'Информатика и вычислительная техника', 'Экономика', 'Государственное и муниципальное управление', 'Бизнес-информатика', 'Юриспруденция', 'Геодезия и землеустройство', 'Энергетика и энергетическое машиностроение'],
316: ['Здравоохранение'],
317: ['Экономика', 'Строительство', 'Архитектура и градостроительство', 'Реклама и связи с общественностью', 'Нефтегазовое дело', 'Геодезия и землеустройство', 'Сфера обслуживания', 'Энергетика и энергетическое машиностроение', 'Информатика и вычислительная техника', 'Транспортные средства', 'Технологические машины и оборудование', 'Пищевые технологии', 'Информационная безопасность', 'Автоматика и управление', 'Менеджмент', 'Государственное и муниципальное управление', 'Социология', 'Библиотеки и архивы', 'Химическая и биотехнологии', 'Экология'],
318: ['Биология', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Электронная техника, радиотехника и связь', 'Экология', 'Управление качеством', 'Юриспруденция', 'Востоковедение и африканистика', 'Социология', 'Химия', 'Реклама и связи с общественностью', 'Сфера обслуживания', 'Автоматика и управление', 'Библиотеки и архивы', 'Филология', 'Приборостроение и оптотехника', 'Журналистика и литературное творчество', 'Издательское дело', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Экономика', 'Дизайн', 'Государственное и муниципальное управление', 'Социальная работа', 'Архитектура и градостроительство', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Сельское и рыбное хозяйство', 'Философия', 'История', 'Математика', 'Политология', 'Психология', 'Геология', 'Менеджмент', 'Международные отношения', 'География', 'Физика', 'Религиоведение и теология'],
319: ['Информатика и вычислительная техника', 'Информационная безопасность'],
320: ['Автоматика и управление', 'Экология', 'Экономика', 'Пищевые технологии'],
321: ['Юриспруденция', 'Журналистика и литературное творчество', 'Менеджмент', 'Сфера обслуживания', 'Экология', 'Экономика'],
322: ['Менеджмент', 'Экономика', 'Педагогическое образование', 'Государственное и муниципальное управление', 'Транспортные средства'],
323: ['Технологические машины и оборудование', 'Информатика и вычислительная техника', 'Менеджмент', 'Экономика', 'Сфера обслуживания', 'Строительство', 'Геология', 'Государственное и муниципальное управление', 'Информационная безопасность', 'Химическая и биотехнологии', 'Геодезия и землеустройство', 'Энергетика и энергетическое машиностроение', 'Машиностроение', 'Автоматика и управление', 'Экология', 'Транспортные средства'],
324: ['Юриспруденция', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Профессиональное обучение', 'Педагогическое образование', 'Математика', 'Лингвистика и иностранные языки', 'Психология', 'Экономика', 'Менеджмент'],
325: ['Психолого-педагогическое и специальное (дефектологическое) образование'],
326: ['Строительство', 'Энергетика и энергетическое машиностроение', 'Экономика', 'Транспортные средства'],
327: ['Строительство', 'Экономика', 'Экология', 'Сельское и рыбное хозяйство', 'Геодезия и землеустройство'],
328: ['Педагогическое образование', 'Экономика', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Юриспруденция', 'Журналистика и литературное творчество', 'Дизайн', 'Государственное и муниципальное управление', 'Информационная безопасность', 'Информатика и вычислительная техника', 'Профессиональное обучение', 'Библиотеки и архивы', 'Социальная работа', 'Филология', 'Физическая культура', 'Биология', 'Математика', 'Химия', 'Менеджмент', 'Энергетика и энергетическое машиностроение', 'Философия', 'География', 'Физика', 'Социология', 'Автоматика и управление', 'Психология', 'Транспортные средства', 'Экология'],
329: ['Строительство', 'Транспортные средства'],
330: ['Государственное и муниципальное управление', 'Юриспруденция', 'Экономика'],
331: ['Экономика', 'Юриспруденция', 'Государственное и муниципальное управление'],
332: ['Сельское и рыбное хозяйство', 'Экология', 'Энергетика и энергетическое машиностроение', 'Экономика', 'Транспортные средства'],
333: ['Сельское и рыбное хозяйство', 'Энергетика и энергетическое машиностроение', 'Экономика', 'Геодезия и землеустройство'],
334: ['Психология', 'Здравоохранение', 'Химическая и биотехнологии', 'Экономика', 'Социальная работа'],
335: ['Юриспруденция', 'Архитектура и градостроительство', 'Экономика', 'Математика', 'Дизайн', 'Физическая культура', 'Информационная безопасность', 'Психология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Менеджмент', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Журналистика и литературное творчество', 'Международные отношения', 'История', 'Сфера обслуживания', 'Филология', 'Социология', 'Реклама и связи с общественностью', 'Химия', 'Строительство', 'Биология', 'Социальная работа', 'Философия', 'География', 'Электронная техника, радиотехника и связь', 'Экология', 'Профессиональное обучение'],
336: ['Экономика', 'Пищевые технологии', 'Сфера обслуживания'],
337: ['Экономика', 'Менеджмент'],
338: ['Журналистика и литературное творчество', 'Педагогическое образование', 'Юриспруденция', 'Химическая и биотехнологии', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Экономика', 'Дизайн', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Реклама и связи с общественностью', 'Менеджмент', 'История', 'Информатика и вычислительная техника', 'Психология', 'Лингвистика и иностранные языки', 'Экология', 'Культурология', 'Лесное дело', 'Библиотеки и архивы', 'Геодезия и землеустройство', 'Философия', 'Физическая культура', 'Социальная работа'],
339: ['Экономика', 'Информатика и вычислительная техника', 'Технологические машины и оборудование', 'Машиностроение'],
340: ['Экономика'],
341: ['Дизайн', 'Профессиональное обучение', 'Лингвистика и иностранные языки', 'Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника', 'Информационная безопасность', 'Химия', 'Социология', 'История', 'Физическая культура', 'Международные отношения', 'Экология', 'Политология', 'Социальная работа', 'Государственное и муниципальное управление'],
342: ['Информационная безопасность', 'Юриспруденция', 'Информатика и вычислительная техника', 'Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Экономика', 'Архитектура и градостроительство', 'Государственное и муниципальное управление', 'Сельское и рыбное хозяйство', 'Металлургия', 'Социология', 'Менеджмент', 'Химия', 'Математика', 'Строительство', 'Химическая и биотехнологии', 'Транспортные средства', 'Бизнес-информатика', 'Технологические машины и оборудование', 'Энергетика и энергетическое машиностроение', 'Машиностроение', 'Автоматика и управление', 'Приборостроение и оптотехника', 'Управление качеством', 'Библиотеки и архивы', 'Сфера обслуживания'],
343: ['Экономика'],
344: ['Экономика', 'Менеджмент', 'Сфера обслуживания'],
345: ['Экономика'],
346: ['Психология', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Экономика'],
347: ['Экономика', 'Менеджмент', 'Юриспруденция', 'Государственное и муниципальное управление'],
348: ['Математика', 'Государственное и муниципальное управление', 'Бизнес-информатика', 'Экономика', 'Менеджмент'],
349: ['Журналистика и литературное творчество'],
350: ['Экономика', 'Химическая и биотехнологии'],
351: ['Информатика и вычислительная техника'],
353: ['Металлургия', 'Менеджмент', 'Лингвистика и иностранные языки', 'Журналистика и литературное творчество', 'Геология', 'Дизайн', 'Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информационная безопасность', 'Технологические машины и оборудование', 'Информатика и вычислительная техника', 'Экономика', 'Архитектура и градостроительство', 'Юриспруденция', 'Строительство', 'Государственное и муниципальное управление', 'Математика', 'Психология', 'Физическая культура', 'Филология', 'Энергетика и энергетическое машиностроение', 'Социальная работа', 'Электронная техника, радиотехника и связь', 'Политология', 'Библиотеки и архивы', 'Бизнес-информатика', 'Полиграфия и упаковка', 'Автоматика и управление', 'Пищевые технологии', 'Химическая и биотехнологии', 'Экология', 'Технологии легкой промышленности'],
354: ['Здравоохранение', 'Сельское и рыбное хозяйство', 'Строительство', 'Химия', 'Нефтегазовое дело', 'Экономика', 'Геодезия и землеустройство', 'Юриспруденция', 'Химическая и биотехнологии', 'Сфера обслуживания', 'Реклама и связи с общественностью', 'Энергетика и энергетическое машиностроение', 'Менеджмент', 'Государственное и муниципальное управление', 'Информационная безопасность'],
355: ['Здравоохранение', 'Психология', 'Журналистика и литературное творчество', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Профессиональное обучение', 'Международные отношения', 'Экономика', 'Биология', 'Энергетика и энергетическое машиностроение', 'История', 'Сфера обслуживания', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Химия'],
356: ['Архитектура и градостроительство', 'Транспортные средства', 'Экономика', 'Строительство', 'Менеджмент'],
357: ['Здравоохранение'],
358: ['Архитектура и градостроительство', 'Юриспруденция', 'Менеджмент', 'Экономика', 'Реклама и связи с общественностью', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Лингвистика и иностранные языки', 'Сфера обслуживания'],
359: ['Экономика', 'Юриспруденция', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Сфера обслуживания', 'Менеджмент'],
360: ['Информатика и вычислительная техника', 'Информационная безопасность', 'Электронная техника, радиотехника и связь', 'Энергетика и энергетическое машиностроение', 'Экономика'],
361: ['Экономика', 'Бизнес-информатика', 'Юриспруденция', 'Государственное и муниципальное управление', 'Менеджмент', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника'],
362: ['Лингвистика и иностранные языки', 'Физика', 'Энергетика и энергетическое машиностроение', 'Юриспруденция', 'Химия', 'Материалы', 'Социология', 'Бизнес-информатика', 'Электронная техника, радиотехника и связь', 'Экономика', 'Авиационная и ракетно-космическая техника', 'Математика', 'Государственное и муниципальное управление', 'Психология', 'Автоматика и управление', 'Информатика и вычислительная техника'],
363: ['Юриспруденция'],
364: ['Здравоохранение', 'Юриспруденция'],
365: ['Экономика', 'Филология', 'Математика', 'Лингвистика и иностранные языки'],
352: ['Экономика', 'Информатика и вычислительная техника', 'Дизайн', 'Бизнес-информатика', 'Физика', 'Менеджмент', 'Материалы', 'Приборостроение и оптотехника', 'Информационная безопасность', 'Химия', 'Государственное и муниципальное управление', 'Электронная техника, радиотехника и связь', 'Математика', 'Библиотеки и архивы', 'Юриспруденция', 'Химическая и биотехнологии', 'Машиностроение', 'География', 'Автоматика и управление', 'Экология', 'Управление качеством', 'Сфера обслуживания'],
366: ['Транспортные средства', 'Сельское и рыбное хозяйство', 'Экономика', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Педагогическое образование', 'Сфера обслуживания', 'Менеджмент', 'Экология', 'Лесное дело', 'Управление качеством', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Химическая и биотехнологии', 'Геодезия и землеустройство', 'Социальная работа'],
367: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Психология', 'Лингвистика и иностранные языки'],
368: ['Информатика и вычислительная техника', 'Транспортные средства', 'Психология', 'Экономика', 'Менеджмент', 'Информационная безопасность', 'Юриспруденция', 'Морская техника', 'Социальная работа', 'Нефтегазовое дело', 'Электронная техника, радиотехника и связь', 'Управление водным транспортом', 'Автоматика и управление', 'Экология', 'Технологические машины и оборудование'],
369: ['Информационная безопасность', 'Приборостроение и оптотехника', 'Авиационная и ракетно-космическая техника', 'Энергетика и энергетическое машиностроение', 'Менеджмент', 'Автоматика и управление', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Бизнес-информатика', 'Экономика', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Электронная техника, радиотехника и связь', 'Авиационные системы (эксплуатация)', 'Экология', 'Математика', 'Управление качеством', 'Социальная работа', 'Сфера обслуживания', 'Материалы', 'Металлургия', 'Технологические машины и оборудование'],
370: ['Строительство', 'Энергетика и энергетическое машиностроение', 'Сфера обслуживания', 'Транспортные средства', 'Менеджмент', 'Архитектура и градостроительство', 'Информатика и вычислительная техника', 'Машиностроение', 'Экономика', 'Экология', 'Технологические машины и оборудование', 'Автоматика и управление'],
371: ['Архитектура и градостроительство'],
372: ['Психология', 'Менеджмент', 'Политология', 'Социология', 'Теория искусств', 'Юриспруденция'],
373: ['Политология', 'Юриспруденция', 'Менеджмент', 'Психология', 'Социология'],
374: ['Психология', 'Политология', 'Социология', 'Менеджмент'],
375: ['Лингвистика и иностранные языки', 'Дизайн', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Филология', 'Государственное и муниципальное управление', 'Бизнес-информатика', 'Юриспруденция', 'Реклама и связи с общественностью', 'Физическая культура', 'Востоковедение и африканистика', 'Социальная работа', 'Психология', 'История', 'Социология', 'Актерское исполнительство'],
376: ['Экономика', 'Международные отношения', 'Юриспруденция', 'Государственное и муниципальное управление', 'Менеджмент'],
377: ['Биология', 'Химическая и биотехнологии', 'Сельское и рыбное хозяйство', 'Пищевые технологии', 'Сфера обслуживания'],
378: ['Менеджмент', 'Транспортные средства', 'Морская техника', 'Управление водным транспортом'],
379: ['Экономика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Психология', 'Юриспруденция', 'Педагогическое образование', 'Журналистика и литературное творчество', 'Лингвистика и иностранные языки', 'Менеджмент', 'Математика', 'Информатика и вычислительная техника', 'Издательское дело'],
380: ['Сфера обслуживания', 'Физическая культура', 'Менеджмент', 'Экономика'],
381: ['Государственное и муниципальное управление', 'Менеджмент', 'Журналистика и литературное творчество', 'Социология', 'Юриспруденция', 'Реклама и связи с общественностью', 'Экология', 'Политология', 'Сфера обслуживания', 'Международные отношения', 'Экономика'],
382: ['Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Международные отношения', 'Юриспруденция', 'Религиоведение и теология', 'Библиотеки и архивы', 'Культурология', 'Журналистика и литературное творчество', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Социология', 'Психология', 'Информационная безопасность', 'Политология', 'Сфера обслуживания'],
383: ['Здравоохранение', 'Психология', 'Менеджмент', 'Экономика'],
384: ['Экономика', 'Юриспруденция', 'Физика', 'Государственное и муниципальное управление', 'Здравоохранение', 'Лингвистика и иностранные языки', 'Педагогическое образование', 'Биология', 'Математика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Психология', 'Филология', 'Менеджмент', 'Экология', 'Политология', 'Дизайн', 'Физическая культура', 'История'],
385: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Психология', 'Социальная работа', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника', 'Математика', 'Государственное и муниципальное управление'],
386: ['Информатика и вычислительная техника', 'Авиационные системы (эксплуатация)', 'Менеджмент', 'Авиационная и ракетно-космическая техника', 'Информационная безопасность', 'Экология', 'Транспортные средства', 'Реклама и связи с общественностью'],
387: ['Технологические машины и оборудование', 'Экономика', 'Вооружение', 'Транспортные средства', 'Физика', 'Приборостроение и оптотехника', 'Химическая и биотехнологии', 'Машиностроение', 'Информационная безопасность', 'Бизнес-информатика', 'Юриспруденция', 'Автоматика и управление', 'Авиационная и ракетно-космическая техника', 'Материалы', 'Дизайн', 'Лингвистика и иностранные языки', 'Менеджмент', 'Математика', 'Электронная техника, радиотехника и связь', 'Ядерные физика и технологии', 'Энергетика и энергетическое машиностроение', 'Социология', 'Информатика и вычислительная техника', 'Экология', 'Управление качеством'],
388: ['Машиностроение', 'Информатика и вычислительная техника', 'Менеджмент', 'Автоматика и управление', 'Технологические машины и оборудование', 'Экономика', 'Управление качеством', 'Приборостроение и оптотехника', 'Материалы'],
389: ['Информатика и вычислительная техника', 'Менеджмент', 'Автоматика и управление', 'Юриспруденция', 'Информационная безопасность', 'География', 'Архитектура и градостроительство', 'Приборостроение и оптотехника', 'Государственное и муниципальное управление', 'Геодезия и землеустройство', 'Экология', 'Экономика'],
390: ['Теория искусств', 'Здравоохранение', 'История', 'Журналистика и литературное творчество', 'Химическая и биотехнологии', 'Филология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Физика', 'Экономика', 'Менеджмент', 'Материалы', 'Социология', 'Философия', 'Биология', 'Химия', 'Политология', 'Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Культурология', 'Государственное и муниципальное управление', 'Психология', 'Международные отношения', 'Математика', 'География', 'Востоковедение и африканистика', 'Геология', 'Юриспруденция', 'Сфера обслуживания', 'Экология', 'Религиоведение и теология', 'Почвоведение'],
391: ['Экономика', 'Управление качеством', 'Сфера обслуживания', 'Автоматика и управление', 'Биология', 'Сельское и рыбное хозяйство', 'Энергетика и энергетическое машиностроение', 'Полиграфия и упаковка', 'Пищевые технологии', 'Технологические машины и оборудование', 'Менеджмент', 'Химическая и биотехнологии', 'Информатика и вычислительная техника', 'Экология', 'Транспортные средства'],
392: ['Сфера обслуживания', 'Реклама и связи с общественностью', 'Педагогическое образование', 'Менеджмент', 'Психология', 'Физическая культура'],
393: ['Экология', 'Реклама и связи с общественностью', 'Сельское и рыбное хозяйство', 'Дизайн', 'Менеджмент', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника', 'Технологии легкой промышленности', 'Экономика', 'Биология', 'Юриспруденция', 'Педагогическое образование', 'Пищевые технологии', 'Автоматика и управление', 'Лесное дело', 'Государственное и муниципальное управление', 'Лингвистика и иностранные языки', 'Журналистика и литературное творчество', 'Энергетика и энергетическое машиностроение', 'Химическая и биотехнологии', 'Психология', 'Сфера обслуживания'],
394: ['Юриспруденция'],
395: ['Психология', 'Информатика и вычислительная техника', 'Лингвистика и иностранные языки', 'Менеджмент', 'Сфера обслуживания', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Юриспруденция', 'Экономика', 'Дизайн', 'Государственное и муниципальное управление'],
396: ['Экономика', 'Юриспруденция', 'Реклама и связи с общественностью', 'Психология', 'Журналистика и литературное творчество', 'Международные отношения', 'Менеджмент', 'Педагогическое образование', 'Информатика и вычислительная техника'],
397: ['Государственное и муниципальное управление', 'Международные отношения', 'Информатика и вычислительная техника', 'Журналистика и литературное творчество', 'Дизайн', 'Менеджмент', 'Экономика', 'Реклама и связи с общественностью', 'Юриспруденция', 'Психология', 'Сфера обслуживания', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Актерское исполнительство'],
398: ['Государственное и муниципальное управление', 'Юриспруденция'],
399: ['Психология', 'Менеджмент', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
400: ['Юриспруденция'],
401: ['Дизайн', 'Архитектура и градостроительство', 'Информатика и вычислительная техника', 'Менеджмент', 'Юриспруденция', 'Строительство', 'Педагогическое образование', 'Геодезия и землеустройство', 'Экономика', 'Психология', 'Лингвистика и иностранные языки', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Реклама и связи с общественностью'],
402: ['Здравоохранение'],
403: ['Государственное и муниципальное управление', 'Экономика', 'Лингвистика и иностранные языки', 'Менеджмент', 'Информатика и вычислительная техника', 'Психология', 'Педагогическое образование', 'Юриспруденция', 'Востоковедение и африканистика', 'Реклама и связи с общественностью', 'Сфера обслуживания'],
404: ['Журналистика и литературное творчество', 'Менеджмент', 'Реклама и связи с общественностью'],
405: ['Экономика'],
406: ['Юриспруденция', 'Менеджмент', 'Государственное и муниципальное управление', 'Экономика'],
407: ['Психология', 'Филология', 'Математика', 'Государственное и муниципальное управление', 'Реклама и связи с общественностью', 'История', 'Лингвистика и иностранные языки', 'Журналистика и литературное творчество', 'Социология', 'Информатика и вычислительная техника', 'Биология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Физика', 'Педагогическое образование', 'Юриспруденция', 'Политология', 'Менеджмент', 'Физическая культура', 'Социальная работа', 'География', 'Культурология', 'Философия', 'Сфера обслуживания', 'Дизайн', 'Химия', 'Экология'],
408: ['Информатика и вычислительная техника', 'Информационная безопасность', 'Химическая и биотехнологии', 'Менеджмент', 'Издательское дело', 'Строительство', 'Дизайн', 'Математика', 'Полиграфия и упаковка', 'Журналистика и литературное творчество', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Экономика', 'Архитектура и градостроительство', 'Технологические машины и оборудование', 'Машиностроение', 'Реклама и связи с общественностью', 'Транспортные средства', 'Электронная техника, радиотехника и связь', 'Материалы', 'Экология', 'Бизнес-информатика', 'Государственное и муниципальное управление', 'Нефтегазовое дело'],
409: ['Филология', 'Экономика', 'Юриспруденция', 'Психология'],
410: ['Психология', 'Менеджмент', 'Экономика', 'Юриспруденция', 'Государственное и муниципальное управление', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
411: ['Юриспруденция', 'Государственное и муниципальное управление', 'Менеджмент', 'Дизайн', 'Экономика', 'Психология'],
412: ['Психология', 'Педагогическое образование', 'Государственное и муниципальное управление', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
413: ['Менеджмент', 'Экономика', 'Юриспруденция'],
414: ['Математика', 'Электронная техника, радиотехника и связь', 'Автоматика и управление', 'Экономика', 'Реклама и связи с общественностью', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Информационная безопасность'],
415: ['Менеджмент', 'Педагогическое образование', 'Строительство', 'Энергетика и энергетическое машиностроение', 'Экономика', 'Информатика и вычислительная техника'],
416: ['Реклама и связи с общественностью', 'Юриспруденция', 'Педагогическое образование', 'Бизнес-информатика', 'Политология', 'Государственное и муниципальное управление', 'Менеджмент', 'Сфера обслуживания', 'Экономика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника'],
417: ['Химическая и биотехнологии', 'Математика', 'Информатика и вычислительная техника', 'Автоматика и управление', 'Физика', 'Информационная безопасность'],
418: ['Информатика и вычислительная техника', 'Юриспруденция', 'Журналистика и литературное творчество', 'Дизайн', 'Менеджмент', 'Экономика', 'Геодезия и землеустройство', 'Бизнес-информатика', 'Реклама и связи с общественностью', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Библиотеки и архивы', 'Информационная безопасность'],
419: ['Бизнес-информатика', 'Экономика', 'Психология', 'Дизайн', 'Менеджмент', 'Государственное и муниципальное управление', 'Юриспруденция', 'Сфера обслуживания'],
420: ['Экономика', 'Юриспруденция'],
421: ['Здравоохранение', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Менеджмент', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Математика', 'Дизайн', 'Журналистика и литературное творчество', 'Экономика', 'Сфера обслуживания', 'Биология', 'Бизнес-информатика', 'Социальная работа', 'Психология'],
422: ['Журналистика и литературное творчество', 'Педагогическое образование', 'Экономика', 'Юриспруденция', 'Здравоохранение'],
423: ['Автоматика и управление', 'Информатика и вычислительная техника', 'Менеджмент'],
424: ['Государственное и муниципальное управление'],
425: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Экономика', 'Юриспруденция', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью', 'Математика', 'Химическая и биотехнологии', 'Менеджмент', 'Сфера обслуживания', 'Технологические машины и оборудование', 'Социальная работа'],
426: ['Информатика и вычислительная техника', 'Математика', 'Экономика', 'Менеджмент', 'Лингвистика и иностранные языки', 'Автоматика и управление', 'Профессиональное обучение', 'Авиационная и ракетно-космическая техника', 'Приборостроение и оптотехника', 'Энергетика и энергетическое машиностроение', 'Лесное дело', 'Транспортные средства', 'Технологические машины и оборудование'],
427: ['Строительство'],
428: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Физическая культура', 'Дизайн'],
429: ['Информатика и вычислительная техника', 'Психология', 'Экономика', 'Менеджмент', 'Лингвистика и иностранные языки', 'Бизнес-информатика', 'Юриспруденция', 'Государственное и муниципальное управление', 'Дизайн', 'Автоматика и управление', 'Экология', 'Сфера обслуживания', 'Энергетика и энергетическое машиностроение', 'Строительство', 'Геодезия и землеустройство', 'Математика', 'Архитектура и градостроительство'],
430: ['Управление качеством', 'Информатика и вычислительная техника', 'Менеджмент', 'Юриспруденция', 'Экономика', 'Психология', 'Государственное и муниципальное управление'],
431: ['Технологические машины и оборудование', 'Информатика и вычислительная техника', 'Экономика'],
432: ['Физическая культура', 'Менеджмент', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
434: ['Экономика', 'Менеджмент', 'Юриспруденция'],
435: ['Дизайн'],
433: ['Экономика', 'Культурология', 'Психология'],
436: ['Филология', 'Здравоохранение', 'Информатика и вычислительная техника', 'Математика', 'Менеджмент', 'Информационная безопасность', 'Журналистика и литературное творчество', 'Политология', 'Юриспруденция', 'Архитектура и градостроительство', 'Экономика', 'Педагогическое образование', 'Психология', 'Реклама и связи с общественностью', 'Сфера обслуживания', 'Управление качеством', 'Лингвистика и иностранные языки', 'Дизайн', 'География', 'Энергетика и энергетическое машиностроение', 'Сельское и рыбное хозяйство', 'История', 'Химическая и биотехнологии', 'Биология', 'Экология', 'Геодезия и землеустройство', 'Приборостроение и оптотехника', 'Электронная техника, радиотехника и связь', 'Строительство', 'Транспортные средства'],
437: ['Автоматика и управление', 'Транспортные средства', 'Менеджмент', 'Экономика', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Строительство', 'Архитектура и градостроительство', 'Экология', 'Сфера обслуживания', 'Управление качеством', 'Математика'],
438: ['Реклама и связи с общественностью', 'Химия', 'Информатика и вычислительная техника', 'Психология', 'История', 'Дизайн', 'Технологические машины и оборудование', 'Математика', 'Культурология', 'Юриспруденция', 'Биология', 'Издательское дело', 'Экономика', 'Лингвистика и иностранные языки', 'Здравоохранение', 'Менеджмент', 'Социология', 'Сфера обслуживания', 'Журналистика и литературное творчество', 'Филология', 'Физическая культура', 'Международные отношения', 'Государственное и муниципальное управление', 'Информационная безопасность', 'Политология', 'Бизнес-информатика', 'Социальная работа', 'Библиотеки и архивы', 'Физика', 'Электронная техника, радиотехника и связь', 'Экология'],
442: ['Технологические машины и оборудование', 'Информатика и вычислительная техника', 'Металлургия', 'Геология', 'Материалы', 'Лингвистика и иностранные языки', 'Бизнес-информатика', 'Экономика', 'Электронная техника, радиотехника и связь', 'Физика', 'Энергетика и энергетическое машиностроение', 'Автоматика и управление', 'Менеджмент', 'Государственное и муниципальное управление', 'Транспортные средства', 'Сфера обслуживания'],
439: ['Юриспруденция', 'Экономика', 'Менеджмент', 'Математика', 'Журналистика и литературное творчество', 'Информатика и вычислительная техника', 'Информационная безопасность', 'Лингвистика и иностранные языки', 'Психология', 'Сфера обслуживания', 'Социальная работа', 'Политология', 'Филология', 'Геология', 'Социология', 'Педагогическое образование', 'Издательское дело', 'Химия', 'Реклама и связи с общественностью', 'Философия', 'История', 'Дизайн', 'География', 'Физическая культура', 'Международные отношения', 'Культурология', 'Библиотеки и архивы', 'Экология', 'Биология', 'Почвоведение', 'Автоматика и управление', 'Управление качеством', 'Физика', 'Сельское и рыбное хозяйство'],
440: ['Машиностроение', 'Материалы', 'Геология', 'Автоматика и управление', 'Лингвистика и иностранные языки', 'Химическая и биотехнологии', 'Информатика и вычислительная техника', 'Приборостроение и оптотехника', 'Нефтегазовое дело', 'Менеджмент', 'Экономика', 'Ядерные физика и технологии', 'Энергетика и энергетическое машиностроение', 'Экология', 'Дизайн', 'Электронная техника, радиотехника и связь', 'Математика', 'Физика'],
443: ['Информатика и вычислительная техника', 'Журналистика и литературное творчество', 'Архитектура и градостроительство', 'Психология', 'География', 'Востоковедение и африканистика', 'Юриспруденция', 'Культурология', 'Информационная безопасность', 'Математика', 'Международные отношения', 'Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Бизнес-информатика', 'Философия', 'Экономика', 'Химия', 'Дизайн', 'Электронная техника, радиотехника и связь', 'Менеджмент', 'Филология', 'Физика', 'Биология', 'История', 'Государственное и муниципальное управление', 'Политология', 'Социология', 'Теория искусств'],
444: ['Менеджмент', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Филология', 'Дизайн', 'Бизнес-информатика', 'Математика', 'Информатика и вычислительная техника', 'Экономика'],
445: ['Бизнес-информатика', 'Информатика и вычислительная техника', 'Дизайн', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Экономика', 'История', 'Менеджмент'],
446: ['Информатика и вычислительная техника', 'Менеджмент', 'Физика', 'Политология', 'Экономика', 'История', 'Дизайн', 'Государственное и муниципальное управление', 'Социология', 'Востоковедение и африканистика', 'Филология', 'Математика', 'Юриспруденция', 'Бизнес-информатика', 'Реклама и связи с общественностью'],
447: ['Ядерные физика и технологии', 'Реклама и связи с общественностью', 'Дизайн', 'Лингвистика и иностранные языки', 'Энергетика и энергетическое машиностроение', 'Менеджмент', 'Автоматика и управление', 'Электронная техника, радиотехника и связь', 'Математика', 'Приборостроение и оптотехника', 'Бизнес-информатика', 'Информатика и вычислительная техника', 'Экономика', 'Строительство', 'Управление качеством', 'Информационная безопасность', 'Технологические машины и оборудование', 'Машиностроение'],
448: ['Математика', 'Электронная техника, радиотехника и связь', 'Бизнес-информатика', 'Экономика', 'Ядерные физика и технологии', 'Реклама и связи с общественностью', 'Дизайн', 'Строительство', 'Менеджмент', 'Приборостроение и оптотехника', 'Лингвистика и иностранные языки', 'Автоматика и управление', 'Информатика и вычислительная техника', 'Энергетика и энергетическое машиностроение', 'Машиностроение', 'Информационная безопасность'],
449: ['Материалы', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника', 'Юриспруденция', 'Менеджмент', 'Электронная техника, радиотехника и связь', 'Приборостроение и оптотехника', 'Дизайн', 'Автоматика и управление', 'Экология'],
450: ['Математика', 'Автоматика и управление', 'Юриспруденция', 'Информатика и вычислительная техника', 'Приборостроение и оптотехника', 'Информационная безопасность', 'Менеджмент', 'Электронная техника, радиотехника и связь', 'Дизайн', 'Материалы', 'Психология', 'Лингвистика и иностранные языки'],
441: ['Лингвистика и иностранные языки', 'Химия', 'Архитектура и градостроительство', 'Авиационная и ракетно-космическая техника', 'Информатика и вычислительная техника', 'Строительство', 'Математика', 'Юриспруденция', 'История', 'Международные отношения', 'Социология', 'Физическая культура', 'Менеджмент', 'Пищевые технологии', 'Энергетика и энергетическое машиностроение', 'Транспортные средства', 'Педагогическое образование', 'Реклама и связи с общественностью', 'Автоматика и управление', 'Технологические машины и оборудование', 'Машиностроение', 'Психология', 'Филология', 'Металлургия', 'Электронная техника, радиотехника и связь', 'Журналистика и литературное творчество', 'Бизнес-информатика', 'Информационная безопасность', 'Государственное и муниципальное управление', 'Экономика', 'Экология', 'Сфера обслуживания', 'Политология', 'Приборостроение и оптотехника', 'Дизайн', 'Геодезия и землеустройство', 'Химическая и биотехнологии', 'Физика', 'Вооружение'],
451: ['Приборостроение и оптотехника', 'Математика', 'Автоматика и управление', 'Международные отношения', 'Экономика', 'Бизнес-информатика', 'Электронная техника, радиотехника и связь', 'Физика', 'Ядерные физика и технологии', 'Информационная безопасность', 'Энергетика и энергетическое машиностроение', 'Материалы', 'Информатика и вычислительная техника'],
452: ['Юриспруденция', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Энергетика и энергетическое машиностроение', 'Экономика', 'Менеджмент', 'Информатика и вычислительная техника', 'Педагогическое образование', 'Профессиональное обучение'],
453: ['Экономика', 'Юриспруденция', 'Менеджмент', 'Информатика и вычислительная техника', 'Психология'],
454: ['Информатика и вычислительная техника', 'Технологические машины и оборудование', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Химическая и биотехнологии'],
455: ['Информационная безопасность', 'Экономика', 'Юриспруденция', 'Математика', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление'],
456: ['Юриспруденция', 'Экономика', 'Математика'],
457: ['Сельское и рыбное хозяйство', 'Экономика', 'Менеджмент', 'Геодезия и землеустройство'],
458: ['Информатика и вычислительная техника', 'Сельское и рыбное хозяйство', 'Лесное дело', 'Сфера обслуживания', 'Менеджмент', 'Экономика'],
459: ['Лесное дело', 'Сфера обслуживания', 'Культурология', 'Информатика и вычислительная техника', 'Геодезия и землеустройство', 'Дизайн', 'Архитектура и градостроительство', 'Строительство', 'Экология', 'Энергетика и энергетическое машиностроение', 'Управление качеством'],
460: ['Информатика и вычислительная техника', 'Менеджмент'],
461: ['Экономика', 'Электронная техника, радиотехника и связь', 'Информатика и вычислительная техника'],
462: ['Лингвистика и иностранные языки', 'Филология', 'Международные отношения', 'Журналистика и литературное творчество', 'Педагогическое образование', 'Реклама и связи с общественностью', 'Менеджмент', 'Экономика', 'Сфера обслуживания', 'Государственное и муниципальное управление'],
463: ['Экономика', 'Философия', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Профессиональное обучение', 'Информатика и вычислительная техника', 'Менеджмент', 'Психология', 'Дизайн', 'Педагогическое образование', 'Сфера обслуживания', 'Экология', 'География'],
464: ['Нефтегазовое дело', 'Электронная техника, радиотехника и связь', 'Менеджмент', 'Автоматика и управление', 'Технологические машины и оборудование', 'Информационная безопасность', 'Математика', 'Информатика и вычислительная техника', 'Химическая и биотехнологии', 'Ядерные физика и технологии', 'Транспортные средства', 'Библиотеки и архивы', 'Реклама и связи с общественностью', 'Материалы', 'Энергетика и энергетическое машиностроение', 'Приборостроение и оптотехника', 'Машиностроение', 'Вооружение'],
465: ['Социальная работа', 'Реклама и связи с общественностью', 'Менеджмент', 'Международные отношения', 'Психология', 'Физика', 'Экономика', 'Государственное и муниципальное управление', 'Здравоохранение', 'Сфера обслуживания', 'Физическая культура', 'Математика', 'Политология', 'Биология', 'Юриспруденция', 'Химия', 'Бизнес-информатика', 'Информатика и вычислительная техника', 'Библиотеки и архивы', 'История', 'Социология', 'Филология', 'Информационная безопасность', 'Журналистика и литературное творчество', 'Экология'],
466: ['Юриспруденция', 'Экономика', 'Психология', 'Менеджмент'],
467: ['Социология', 'Менеджмент', 'Экономика', 'Юриспруденция', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Политология'],
468: ['Дизайн', 'Педагогическое образование', 'Информационная безопасность', 'Журналистика и литературное творчество', 'Психология', 'Нефтегазовое дело', 'Информатика и вычислительная техника', 'Энергетика и энергетическое машиностроение', 'Реклама и связи с общественностью', 'Экология', 'Физическая культура', 'Менеджмент', 'Автоматика и управление', 'Сфера обслуживания', 'Лингвистика и иностранные языки', 'Архитектура и градостроительство', 'Социальная работа', 'Библиотеки и архивы', 'Математика'],
469: ['Нефтегазовое дело'],
470: ['Педагогическое образование', 'Экономика', 'Пищевые технологии', 'Юриспруденция', 'Психология', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Управление качеством', 'Менеджмент'],
471: ['Информатика и вычислительная техника', 'Энергетика и энергетическое машиностроение', 'Химическая и биотехнологии', 'Пищевые технологии', 'Экономика'],
472: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника'],
473: ['Информатика и вычислительная техника', 'Строительство', 'Экономика', 'Транспортные средства', 'Вооружение'],
474: ['Педагогическое образование', 'Строительство', 'Экономика', 'Юриспруденция', 'Лингвистика и иностранные языки', 'Дизайн', 'Здравоохранение', 'Информатика и вычислительная техника', 'Менеджмент', 'Государственное и муниципальное управление', 'Журналистика и литературное творчество', 'Психология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'История', 'Математика', 'Архитектура и градостроительство', 'Филология', 'Автоматика и управление', 'Биология', 'Электронная техника, радиотехника и связь', 'Энергетика и энергетическое машиностроение', 'Транспортные средства', 'Технологические машины и оборудование', 'Экология', 'География', 'Геодезия и землеустройство'],
475: ['Государственное и муниципальное управление', 'Экономика', 'Менеджмент'],
476: ['Ядерные физика и технологии'],
477: ['Экономика', 'Юриспруденция', 'Лингвистика и иностранные языки', 'Педагогическое образование', 'Профессиональное обучение', 'Психология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Менеджмент', 'Государственное и муниципальное управление', 'Социология', 'Экология', 'Математика', 'Информатика и вычислительная техника'],
478: ['Менеджмент', 'Информатика и вычислительная техника', 'Энергетика и энергетическое машиностроение', 'Экономика', 'Сфера обслуживания', 'Химическая и биотехнологии', 'Химия', 'Автоматика и управление'],
479: ['Международные отношения', 'Экономика', 'Юриспруденция', 'Психология'],
480: ['Строительство'],
481: ['Лингвистика и иностранные языки'],
482: ['Бизнес-информатика', 'Экономика', 'Реклама и связи с общественностью', 'Менеджмент'],
483: ['Информатика и вычислительная техника', 'Бизнес-информатика', 'Транспортные средства', 'Лесное дело', 'Экономика', 'Юриспруденция', 'Государственное и муниципальное управление', 'Менеджмент', 'Биология', 'Сельское и рыбное хозяйство', 'Пищевые технологии', 'Профессиональное обучение', 'Строительство', 'Экология'],
484: ['Дизайн', 'Социология', 'Строительство', 'Архитектура и градостроительство', 'Экономика', 'Лингвистика и иностранные языки', 'Сфера обслуживания', 'Управление качеством', 'Информатика и вычислительная техника', 'Экология'],
485: ['Здравоохранение', 'Психология', 'Сестринское дело2'],
486: ['Химия', 'Менеджмент', 'Психология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Дизайн', 'Филология', 'Журналистика и литературное творчество', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Социальная работа', 'Реклама и связи с общественностью', 'Экономика', 'Биология', 'Экология', 'Информатика и вычислительная техника', 'Профессиональное обучение'],
487: ['Физика', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Химическая и биотехнологии', 'Менеджмент', 'Информационная безопасность', 'Психология', 'Материалы', 'Юриспруденция', 'Бизнес-информатика', 'Социология', 'Социальная работа', 'Международные отношения', 'Экономика', 'Авиационные системы (эксплуатация)', 'Авиационная и ракетно-космическая техника', 'Приборостроение и оптотехника', 'Электронная техника, радиотехника и связь', 'Технологические машины и оборудование', 'Экология', 'Математика', 'Филология', 'Информатика и вычислительная техника', 'Транспортные средства', 'Лингвистика и иностранные языки', 'Пищевые технологии', 'Реклама и связи с общественностью', 'Вооружение'],
488: ['Дизайн', 'Реклама и связи с общественностью', 'Архитектура и градостроительство'],
489: ['Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Бизнес-информатика', 'Реклама и связи с общественностью', 'Социология', 'Психология', 'Экономика', 'Математика', 'Юриспруденция', 'Международные отношения', 'Сфера обслуживания', 'Менеджмент', 'Экология', 'Политология'],
490: ['Психология', 'История', 'Журналистика и литературное творчество', 'Здравоохранение', 'Филология', 'Физика', 'Математика', 'Химия', 'Бизнес-информатика', 'Философия', 'Информатика и вычислительная техника', 'Менеджмент', 'Экономика', 'Востоковедение и африканистика', 'Юриспруденция', 'Лингвистика и иностранные языки', 'Биология', 'Автоматика и управление', 'Геология', 'Социология'],
491: ['Дизайн', 'Менеджмент', 'Психология', 'Технологии легкой промышленности', 'Полиграфия и упаковка', 'Сфера обслуживания'],
492: ['Юриспруденция'],
493: ['Экономика', 'Химическая и биотехнологии', 'Информатика и вычислительная техника', 'Металлургия', 'Технологические машины и оборудование', 'Энергетика и энергетическое машиностроение'],
494: ['Информатика и вычислительная техника'],
495: ['Менеджмент', 'Нефтегазовое дело', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Экономика', 'Сельское и рыбное хозяйство', 'Геодезия и землеустройство', 'Строительство', 'Бизнес-информатика', 'Экология', 'Лесное дело'],
496: ['Менеджмент', 'Экономика'],
497: ['Здравоохранение', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Материалы', 'Экономика', 'Химия', 'Ядерные физика и технологии', 'Менеджмент', 'Математика', 'Биология', 'Приборостроение и оптотехника', 'Дизайн'],
498: ['Юриспруденция'],
499: ['Юриспруденция', 'Менеджмент', 'Экономика', 'Сфера обслуживания', 'Государственное и муниципальное управление', 'Лингвистика и иностранные языки', 'Бизнес-информатика', 'Политология'],
500: ['Приборостроение и оптотехника', 'Информатика и вычислительная техника', 'Химическая и биотехнологии', 'Экономика'],
501: ['Сельское и рыбное хозяйство'],
502: ['Юриспруденция'],
503: ['Юриспруденция', 'Геодезия и землеустройство', 'Менеджмент', 'Сельское и рыбное хозяйство', 'Информатика и вычислительная техника', 'Экономика', 'Пищевые технологии', 'Экология', 'Лесное дело'],
504: ['Здравоохранение'],
505: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Дизайн', 'Биология', 'Профессиональное обучение', 'Социология'],
506: ['Реклама и связи с общественностью', 'Сфера обслуживания', 'Менеджмент', 'Дизайн', 'Нефтегазовое дело', 'Автоматика и управление', 'Экономика', 'Государственное и муниципальное управление', 'Технологии легкой промышленности', 'Психология', 'Информатика и вычислительная техника', 'Математика', 'Информационная безопасность', 'Строительство', 'Технологические машины и оборудование', 'Энергетика и энергетическое машиностроение', 'Электронная техника, радиотехника и связь', 'Материалы', 'Химическая и биотехнологии'],
507: ['Экономика', 'Политология', 'Социальная работа', 'Журналистика и литературное творчество', 'Филология', 'Государственное и муниципальное управление', 'Международные отношения', 'Педагогическое образование', 'Социология', 'Информационная безопасность', 'Сфера обслуживания', 'Реклама и связи с общественностью', 'Юриспруденция', 'Психология', 'Менеджмент', 'Лингвистика и иностранные языки', 'Религиоведение и теология', 'История', 'Информатика и вычислительная техника', 'Охрана памятников', 'Бизнес-информатика', 'Библиотеки и архивы', 'Физическая культура', 'Актерское исполнительство', 'Математика', 'Химия', 'Химическая и биотехнологии', 'Философия', 'Культурология', 'Экология', 'Физика'],
508: ['Информационная безопасность', 'Реклама и связи с общественностью', 'Автоматика и управление', 'Экономика', 'Информатика и вычислительная техника', 'Менеджмент', 'Журналистика и литературное творчество', 'Транспортные средства', 'Бизнес-информатика', 'Сфера обслуживания', 'Энергетика и энергетическое машиностроение', 'Приборостроение и оптотехника', 'Управление качеством'],
509: ['Транспортные средства', 'Информатика и вычислительная техника', 'Управление водным транспортом', 'Морская техника'],
510: ['Экономика'],
511: ['Бизнес-информатика', 'Экономика', 'Менеджмент', 'Государственное и муниципальное управление'],
512: ['Сельское и рыбное хозяйство', 'Экономика', 'Юриспруденция', 'Информационная безопасность', 'Автоматика и управление', 'Экология', 'Геодезия и землеустройство', 'Информатика и вычислительная техника'],
513: ['Здравоохранение', 'Психология'],
514: ['Педагогическое образование', 'Профессиональное обучение', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
515: ['Лингвистика и иностранные языки', 'Филология', 'Дизайн', 'Социология', 'Архитектура и градостроительство', 'Авиационная и ракетно-космическая техника', 'Информатика и вычислительная техника', 'Менеджмент', 'Издательское дело', 'Психология', 'Информационная безопасность', 'Журналистика и литературное творчество', 'Экономика', 'Государственное и муниципальное управление', 'Реклама и связи с общественностью', 'Сфера обслуживания', 'Математика', 'Юриспруденция', 'История', 'Бизнес-информатика', 'Технологические машины и оборудование', 'Строительство', 'Политология', 'География', 'Экология', 'Химическая и биотехнологии', 'Геология', 'Приборостроение и оптотехника', 'Энергетика и энергетическое машиностроение', 'Транспортные средства', 'Автоматика и управление', 'Химия', 'Физика', 'Электронная техника, радиотехника и связь', 'Биология', 'Философия', 'Геодезия и землеустройство', 'Пищевые технологии'],
516: ['Юриспруденция'],
517: ['Менеджмент'],
518: ['Менеджмент', 'Государственное и муниципальное управление'],
519: ['Менеджмент', 'Экономика'],
520: ['Сельское и рыбное хозяйство', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Энергетика и энергетическое машиностроение', 'Экономика', 'Транспортные средства', 'Менеджмент', 'Строительство', 'Экология', 'Лесное дело', 'Химическая и биотехнологии', 'Пищевые технологии'],
521: ['Филология', 'Экономика', 'Лингвистика и иностранные языки', 'Здравоохранение', 'Педагогическое образование', 'Международные отношения', 'Психология', 'Архитектура и градостроительство', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Сфера обслуживания', 'Журналистика и литературное творчество', 'Математика', 'Информатика и вычислительная техника', 'Юриспруденция', 'Менеджмент', 'Политология', 'Биология', 'Физическая культура', 'Электронная техника, радиотехника и связь', 'Экология', 'Бизнес-информатика', 'Пищевые технологии', 'Профессиональное обучение', 'Социальная работа', 'Философия', 'Дизайн', 'Строительство', 'Технологии легкой промышленности', 'Информационная безопасность', 'История', 'Энергетика и энергетическое машиностроение', 'Транспортные средства', 'Химия', 'Химическая и биотехнологии', 'Автоматика и управление'],
522: ['Психология', 'Юриспруденция', 'Журналистика и литературное творчество', 'Физическая культура', 'Архитектура и градостроительство', 'Строительство', 'Приборостроение и оптотехника', 'Химическая и биотехнологии', 'Экология', 'Философия', 'Информатика и вычислительная техника', 'Биология', 'Здравоохранение', 'Социальная работа', 'Филология', 'Химия', 'Транспортные средства', 'Менеджмент', 'Сфера обслуживания', 'Дизайн', 'Технологические машины и оборудование', 'История', 'Пищевые технологии', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Экономика', 'Технологии легкой промышленности', 'Информационная безопасность', 'Электронная техника, радиотехника и связь', 'Лингвистика и иностранные языки', 'Автоматика и управление', 'Математика', 'Политология'],
523: ['Экономика', 'Менеджмент'],
524: ['Экономика', 'Юриспруденция', 'Менеджмент', 'Информатика и вычислительная техника', 'Энергетика и энергетическое машиностроение', 'Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
525: ['Юриспруденция'],
526: ['Юриспруденция', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Экономика'],
527: ['Информатика и вычислительная техника', 'Экономика', 'Сфера обслуживания', 'Сельское и рыбное хозяйство', 'Транспортные средства', 'Геодезия и землеустройство', 'Менеджмент'],
528: ['Приборостроение и оптотехника', 'Химическая и биотехнологии', 'Сфера обслуживания', 'Экономика', 'Бизнес-информатика', 'Профессиональное обучение', 'Информатика и вычислительная техника', 'Автоматика и управление', 'Экология', 'Лингвистика и иностранные языки', 'Управление качеством', 'Менеджмент', 'Технологические машины и оборудование', 'Пищевые технологии'],
529: ['Реклама и связи с общественностью', 'Государственное и муниципальное управление', 'Технологические машины и оборудование', 'Экономика', 'Бизнес-информатика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Биология', 'Физическая культура', 'Математика', 'Информационная безопасность', 'Информатика и вычислительная техника', 'Менеджмент', 'Социология', 'Международные отношения', 'Здравоохранение', 'Сфера обслуживания', 'Химия', 'Журналистика и литературное творчество', 'Юриспруденция', 'Лингвистика и иностранные языки', 'Педагогическое образование', 'Психология', 'Машиностроение', 'Электронная техника, радиотехника и связь', 'Энергетика и энергетическое машиностроение', 'Приборостроение и оптотехника', 'Автоматика и управление', 'Библиотеки и архивы', 'Социальная работа', 'Экология', 'Транспортные средства', 'Вооружение', 'Материалы'],
530: ['Информатика и вычислительная техника', 'Менеджмент', 'Архитектура и градостроительство', 'Сфера обслуживания', 'Экономика', 'Транспортные средства', 'Строительство', 'Дизайн', 'Геодезия и землеустройство', 'Экология', 'Управление качеством'],
531: ['Энергетика и энергетическое машиностроение', 'Экология', 'Бизнес-информатика', 'Сфера обслуживания', 'Информатика и вычислительная техника'],
532: ['Экономика', 'Менеджмент'],
534: ['Психология', 'Здравоохранение', 'Менеджмент', 'Информатика и вычислительная техника', 'Химическая и биотехнологии', 'Математика', 'Сестринское дело2', 'Приборостроение и оптотехника', 'Лингвистика и иностранные языки', 'Материалы'],
533: ['Сестринское дело2', 'Здравоохранение', 'Психология'],
535: ['Здравоохранение', 'Химическая и биотехнологии'],
536: ['Сельское и рыбное хозяйство', 'Информатика и вычислительная техника', 'Сфера обслуживания', 'Строительство', 'Экономика', 'Лесное дело', 'Экология', 'Менеджмент', 'Геодезия и землеустройство', 'Транспортные средства', 'Биология'],
537: ['Информатика и вычислительная техника', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Бизнес-информатика'],
538: ['Здравоохранение', 'Психология', 'Сестринское дело2'],
539: ['Филология', 'Бизнес-информатика', 'Дизайн', 'Математика', 'Педагогическое образование', 'Политология', 'Лингвистика и иностранные языки', 'Психология', 'Журналистика и литературное творчество', 'Юриспруденция', 'Международные отношения', 'История', 'Биология', 'Сфера обслуживания', 'Экономика', 'Реклама и связи с общественностью', 'Социология', 'Социальная работа', 'География', 'Химия', 'Менеджмент', 'Экология', 'Государственное и муниципальное управление', 'Философия', 'Теория искусств', 'Культурология', 'Геология', 'Информатика и вычислительная техника', 'Здравоохранение', 'Электронная техника, радиотехника и связь', 'Сельское и рыбное хозяйство', 'Информационная безопасность', 'Физика', 'Геодезия и землеустройство', 'Материалы'],
540: ['Пищевые технологии', 'Информатика и вычислительная техника', 'Менеджмент', 'Экономика', 'Сфера обслуживания'],
541: ['Транспортные средства', 'Строительство'],
542: ['Архитектура и градостроительство', 'Лингвистика и иностранные языки', 'Социология', 'Энергетика и энергетическое машиностроение', 'Информационная безопасность', 'Автоматика и управление', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Химическая и биотехнологии', 'Нефтегазовое дело', 'Геология', 'Реклама и связи с общественностью', 'Экономика', 'Строительство', 'Менеджмент', 'Транспортные средства', 'Математика', 'Управление качеством', 'Машиностроение', 'Электронная техника, радиотехника и связь', 'Технологические машины и оборудование', 'Геодезия и землеустройство', 'Экология'],
543: ['Экономика', 'Государственное и муниципальное управление', 'Юриспруденция', 'Менеджмент'],
544: ['Управление качеством', 'Информационная безопасность', 'Геодезия и землеустройство', 'Транспортные средства', 'Психология', 'Информатика и вычислительная техника', 'Архитектура и градостроительство', 'Менеджмент', 'Экономика', 'Энергетика и энергетическое машиностроение', 'Строительство', 'Бизнес-информатика', 'Экология', 'Сфера обслуживания', 'Приборостроение и оптотехника'],
545: ['Математика', 'Здравоохранение', 'Дизайн', 'Менеджмент', 'Лингвистика и иностранные языки', 'Международные отношения', 'Информатика и вычислительная техника', 'Педагогическое образование', 'Строительство', 'Экономика', 'Журналистика и литературное творчество', 'Психология', 'Юриспруденция', 'Сфера обслуживания', 'Социология', 'История', 'Социальная работа', 'Филология', 'Политология', 'Приборостроение и оптотехника', 'Биология', 'Экология', 'Транспортные средства', 'Энергетика и энергетическое машиностроение', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
546: ['Автоматика и управление', 'Государственное и муниципальное управление', 'Экономика', 'Экология', 'Архитектура и градостроительство', 'Сфера обслуживания', 'Информатика и вычислительная техника', 'Менеджмент', 'Реклама и связи с общественностью', 'Нефтегазовое дело', 'Энергетика и энергетическое машиностроение', 'Информационная безопасность', 'Геодезия и землеустройство', 'Строительство', 'Машиностроение', 'Технологические машины и оборудование', 'Социальная работа', 'Транспортные средства', 'Электронная техника, радиотехника и связь', 'Материалы', 'Химическая и биотехнологии'],
547: ['Технологии легкой промышленности', 'Дизайн', 'Сфера обслуживания', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Реклама и связи с общественностью', 'Экономика', 'Информационная безопасность'],
548: ['Информатика и вычислительная техника', 'Бизнес-информатика', 'Информационная безопасность', 'Реклама и связи с общественностью', 'Менеджмент', 'Автоматика и управление', 'Электронная техника, радиотехника и связь', 'Математика', 'Приборостроение и оптотехника'],
549: ['Юриспруденция'],
550: ['Менеджмент', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Социальная работа', 'Юриспруденция', 'Международные отношения', 'Экономика', 'Реклама и связи с общественностью', 'Политология'],
551: ['Пищевые технологии', 'Автоматика и управление', 'Экономика'],
552: ['Информатика и вычислительная техника', 'Экономика', 'Юриспруденция'],
553: ['Педагогическое образование', 'Информатика и вычислительная техника', 'Юриспруденция', 'Психология', 'Государственное и муниципальное управление'],
554: ['Информатика и вычислительная техника', 'Экономика', 'Технологические машины и оборудование', 'Машиностроение', 'Транспортные средства'],
555: ['Филология', 'Математика', 'Геология'],
556: ['Педагогическое образование', 'Филология', 'История', 'Теория искусств', 'Экономика', 'Социальная работа', 'Математика', 'Религиоведение и теология', 'Социология', 'Сфера обслуживания'],
557: ['Юриспруденция', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника', 'Экономика', 'Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Сфера обслуживания', 'Дизайн'],
558: ['Здравоохранение'],
559: ['Юриспруденция'],
560: ['Психология', 'Юриспруденция', 'Менеджмент', 'Экономика'],
561: ['Экономика', 'Сельское и рыбное хозяйство'],
562: ['Экономика', 'Педагогическое образование', 'Сельское и рыбное хозяйство'],
563: ['Экономика'],
564: ['Государственное и муниципальное управление'],
565: ['Юриспруденция', 'Реклама и связи с общественностью', 'Экономика', 'Лингвистика и иностранные языки', 'История', 'Психология', 'Филология', 'Педагогическое образование', 'Здравоохранение', 'Биология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Технологии легкой промышленности', 'Строительство', 'Менеджмент', 'Информатика и вычислительная техника', 'Дизайн', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Религиоведение и теология', 'Журналистика и литературное творчество', 'Международные отношения', 'Транспортные средства', 'Энергетика и энергетическое машиностроение', 'География', 'Социальная работа', 'Технологические машины и оборудование', 'Математика'],
566: ['Информатика и вычислительная техника'],
567: ['Международные отношения', 'Сфера обслуживания', 'Журналистика и литературное творчество', 'Информатика и вычислительная техника', 'Религиоведение и теология', 'Психология', 'Государственное и муниципальное управление', 'Политология', 'Менеджмент', 'Педагогическое образование', 'Юриспруденция', 'Экономика', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Бизнес-информатика', 'Архитектура и градостроительство', 'Дизайн', 'Востоковедение и африканистика', 'Информационная безопасность', 'История', 'Социальная работа'],
568: ['Дизайн', 'Информационная безопасность', 'Сфера обслуживания', 'Юриспруденция', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Архитектура и градостроительство', 'Строительство', 'Экономика', 'Менеджмент', 'Реклама и связи с общественностью', 'Пищевые технологии', 'Энергетика и энергетическое машиностроение'],
569: ['Здравоохранение', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Менеджмент'],
570: ['Юриспруденция'],
571: ['Международные отношения', 'Экономика', 'Реклама и связи с общественностью', 'Юриспруденция', 'Журналистика и литературное творчество', 'Политология', 'Социология', 'Сфера обслуживания', 'Математика', 'Психология', 'Информатика и вычислительная техника', 'История', 'Теория искусств', 'Государственное и муниципальное управление', 'Менеджмент', 'Бизнес-информатика', 'Дизайн', 'Управление качеством'],
572: ['Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Юриспруденция', 'Экономика', 'Менеджмент'],
573: ['Менеджмент', 'Экономика', 'Юриспруденция', 'Информатика и вычислительная техника', 'Сфера обслуживания'],
574: ['Химическая и биотехнологии', 'Здравоохранение', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Экономика', 'Реклама и связи с общественностью', 'Менеджмент', 'Технологические машины и оборудование', 'Пищевые технологии', 'Автоматика и управление', 'Сельское и рыбное хозяйство', 'Биология', 'Сфера обслуживания', 'Полиграфия и упаковка'],
575: ['Энергетика и энергетическое машиностроение', 'Строительство', 'География', 'Геодезия и землеустройство', 'Химическая и биотехнологии', 'Государственное и муниципальное управление', 'Транспортные средства', 'Профессиональное обучение', 'Менеджмент', 'Сельское и рыбное хозяйство', 'Информатика и вычислительная техника', 'Биология', 'Лесное дело', 'Реклама и связи с общественностью', 'Экономика', 'Сфера обслуживания', 'Пищевые технологии', 'Экология', 'Технологические машины и оборудование', 'Управление качеством', 'Архитектура и градостроительство'],
576: ['Менеджмент', 'Нефтегазовое дело', 'Экология', 'Информатика и вычислительная техника', 'Экономика', 'Геология', 'Строительство'],
577: ['Филология', 'Юриспруденция', 'Сельское и рыбное хозяйство', 'Педагогическое образование', 'Экология', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью', 'География', 'Информационная безопасность', 'Экономика', 'Вооружение', 'Охрана памятников', 'Дизайн', 'Менеджмент', 'Бизнес-информатика', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Физика'],
578: ['Реклама и связи с общественностью', 'Экономика', 'Менеджмент', 'Лингвистика и иностранные языки', 'Психология', 'Дизайн', 'Теория искусств', 'Востоковедение и африканистика', 'Культурология', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Библиотеки и архивы', 'Информационная безопасность', 'Политология', 'Информатика и вычислительная техника', 'История', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Международные отношения', 'Охрана памятников', 'Философия', 'Социология', 'Филология', 'Журналистика и литературное творчество', 'Юриспруденция', 'Религиоведение и теология'],
579: ['Теория искусств', 'Физическая культура', 'Психология', 'Педагогическое образование', 'Математика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'История', 'Реклама и связи с общественностью', 'Юриспруденция', 'Биология', 'Химия', 'Международные отношения', 'Культурология', 'Менеджмент', 'Социология', 'Философия', 'Филология', 'Политология', 'Лингвистика и иностранные языки', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Экология', 'География', 'Экономика', 'Сфера обслуживания', 'Физика', 'Актерское исполнительство', 'Религиоведение и теология', 'Социальная работа'],
580: ['Педагогическое образование', 'Профессиональное обучение', 'Информатика и вычислительная техника', 'Психология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Менеджмент', 'Энергетика и энергетическое машиностроение', 'Социальная работа'],
581: ['Бизнес-информатика', 'Математика', 'История', 'Физическая культура', 'Психология', 'Социальная работа', 'Культурология', 'Юриспруденция', 'Здравоохранение', 'Информатика и вычислительная техника', 'Международные отношения', 'Политология', 'Сфера обслуживания', 'Информационная безопасность', 'Дизайн', 'Реклама и связи с общественностью', 'Государственное и муниципальное управление', 'Менеджмент', 'Педагогическое образование', 'Журналистика и литературное творчество', 'Лингвистика и иностранные языки', 'Социология', 'Экономика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Библиотеки и архивы', 'Экология', 'Религиоведение и теология', 'Сестринское дело2', 'Философия'],
582: ['Реклама и связи с общественностью', 'Менеджмент', 'Лингвистика и иностранные языки', 'Журналистика и литературное творчество', 'Экономика', 'Химическая и биотехнологии', 'Технологические машины и оборудование', 'Теория искусств', 'Юриспруденция', 'Охрана памятников', 'Дизайн', 'Сфера обслуживания', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Социология', 'Филология', 'Математика', 'Технологии легкой промышленности', 'Психология', 'Здравоохранение', 'Бизнес-информатика', 'Государственное и муниципальное управление', 'Культурология', 'Автоматика и управление', 'Полиграфия и упаковка', 'Экология', 'Энергетика и энергетическое машиностроение', 'Управление качеством'],
583: ['Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Педагогическое образование', 'Менеджмент', 'Юриспруденция', 'Сельское и рыбное хозяйство'],
584: ['Экология', 'Информатика и вычислительная техника', 'Технологические машины и оборудование', 'Машиностроение', 'Менеджмент', 'Бизнес-информатика', 'Автоматика и управление', 'Юриспруденция', 'Нефтегазовое дело', 'Геология', 'Информационная безопасность', 'Экономика', 'Химическая и биотехнологии', 'Международные отношения', 'Приборостроение и оптотехника', 'Управление качеством', 'Энергетика и энергетическое машиностроение'],
585: ['Юриспруденция', 'Экономика', 'Государственное и муниципальное управление', 'Менеджмент'],
586: ['Социология', 'Экономика', 'Журналистика и литературное творчество', 'Педагогическое образование', 'Психология'],
587: ['Сфера обслуживания', 'Юриспруденция', 'Менеджмент', 'Дизайн', 'Экономика', 'Государственное и муниципальное управление'],
588: ['Биология', 'Психология', 'Здравоохранение', 'Социальная работа'],
589: ['Государственное и муниципальное управление', 'Сфера обслуживания', 'Психология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Экономика', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Издательское дело', 'Юриспруденция', 'Бизнес-информатика', 'Информатика и вычислительная техника', 'Менеджмент', 'Математика', 'Энергетика и энергетическое машиностроение', 'Технологические машины и оборудование', 'Социальная работа'],
590: ['Юриспруденция'],
591: ['Религиоведение и теология', 'Сестринское дело2', 'Журналистика и литературное творчество', 'Бизнес-информатика', 'Лингвистика и иностранные языки', 'Математика', 'Биология', 'Транспортные средства', 'Сельское и рыбное хозяйство', 'Сфера обслуживания', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Здравоохранение', 'Энергетика и энергетическое машиностроение', 'Реклама и связи с общественностью', 'Автоматика и управление', 'Технологические машины и оборудование', 'Политология', 'Лесное дело', 'Менеджмент', 'Философия', 'Химическая и биотехнологии', 'Филология', 'Социология', 'Экономика', 'Психология', 'Международные отношения', 'Химия', 'Государственное и муниципальное управление', 'История', 'Экология', 'Юриспруденция', 'Архитектура и градостроительство', 'Физика', 'Востоковедение и африканистика', 'Нефтегазовое дело', 'Строительство', 'Геодезия и землеустройство', 'Информатика и вычислительная техника', 'Теория искусств', 'Геология', 'Управление качеством'],
592: ['Реклама и связи с общественностью', 'Информатика и вычислительная техника', 'Юриспруденция', 'Экономика', 'Психология', 'Менеджмент', 'Государственное и муниципальное управление', 'Педагогическое образование', 'Сфера обслуживания', 'Пищевые технологии'],
593: ['Информатика и вычислительная техника', 'Математика', 'Строительство', 'Международные отношения', 'Государственное и муниципальное управление', 'Юриспруденция', 'Экономика', 'Автоматика и управление', 'Информационная безопасность', 'Менеджмент', 'Управление водным транспортом', 'Транспортные средства', 'Энергетика и энергетическое машиностроение', 'Лингвистика и иностранные языки', 'Архитектура и градостроительство', 'Авиационная и ракетно-космическая техника', 'Реклама и связи с общественностью', 'Бизнес-информатика', 'Электронная техника, радиотехника и связь', 'Экология', 'Сфера обслуживания', 'Машиностроение', 'Геодезия и землеустройство', 'Управление качеством', 'Психология', 'Журналистика и литературное творчество', 'Социология'],
594: ['Химическая и биотехнологии', 'Материалы', 'Экология', 'Технологические машины и оборудование', 'Информатика и вычислительная техника', 'Химия', 'Менеджмент', 'Управление качеством'],
595: ['Материалы', 'Экология', 'Технологические машины и оборудование', 'Химическая и биотехнологии', 'Информатика и вычислительная техника', 'Менеджмент', 'Химия', 'Управление качеством', 'Лингвистика и иностранные языки', 'Юриспруденция'],
596: ['Политология', 'Журналистика и литературное творчество', 'Информационная безопасность', 'Психология', 'Дизайн', 'Социология', 'Сфера обслуживания', 'Международные отношения', 'Государственное и муниципальное управление', 'Реклама и связи с общественностью', 'Экология', 'Лингвистика и иностранные языки', 'Пищевые технологии', 'Математика', 'Юриспруденция', 'Информатика и вычислительная техника', 'Менеджмент', 'Бизнес-информатика', 'Технологические машины и оборудование', 'Экономика'],
597: ['Психология', 'Сестринское дело2', 'Здравоохранение'],
598: ['Технологические машины и оборудование', 'Реклама и связи с общественностью', 'Энергетика и энергетическое машиностроение', 'Менеджмент', 'Экономика', 'Сфера обслуживания', 'Государственное и муниципальное управление', 'Транспортные средства', 'Юриспруденция', 'Информатика и вычислительная техника', 'Строительство', 'Экология', 'Геодезия и землеустройство'],
599: ['Государственное и муниципальное управление', 'Международные отношения', 'Педагогическое образование', 'Менеджмент', 'Бизнес-информатика', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью', 'Сфера обслуживания', 'Юриспруденция', 'Управление качеством', 'Экономика', 'Журналистика и литературное творчество', 'Математика', 'Лингвистика и иностранные языки', 'Информационная безопасность', 'Социальная работа'],
600: ['Юриспруденция', 'Государственное и муниципальное управление'],
601: ['Юриспруденция'],
602: ['Информатика и вычислительная техника', 'Экономика', 'Юриспруденция'],
604: ['Экономика', 'Энергетика и энергетическое машиностроение', 'Технологические машины и оборудование', 'Менеджмент', 'Информатика и вычислительная техника'],
603: ['Юриспруденция', 'Государственное и муниципальное управление', 'Экономика', 'Информатика и вычислительная техника'],
605: ['Технологические машины и оборудование'],
606: ['Психология', 'Философия', 'Теория искусств', 'Филология', 'Религиоведение и теология', 'Культурология', 'Педагогическое образование'],
607: ['Менеджмент', 'Сфера обслуживания', 'Информатика и вычислительная техника', 'Экономика', 'Энергетика и энергетическое машиностроение', 'Управление качеством', 'Авиационная и ракетно-космическая техника'],
608: ['Строительство', 'Экономика', 'Энергетика и энергетическое машиностроение', 'Менеджмент', 'Сельское и рыбное хозяйство', 'Транспортные средства', 'Пищевые технологии', 'Биология', 'Сфера обслуживания'],
609: ['Здравоохранение', 'Психология', 'Сестринское дело2'],
610: ['Информатика и вычислительная техника', 'Математика', 'Автоматика и управление', 'Электронная техника, радиотехника и связь', 'Информационная безопасность', 'Приборостроение и оптотехника', 'Государственное и муниципальное управление', 'Экономика', 'Химическая и биотехнологии', 'Бизнес-информатика', 'Энергетика и энергетическое машиностроение', 'Управление качеством', 'Менеджмент'],
611: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Международные отношения', 'Лингвистика и иностранные языки', 'Экономика', 'Журналистика и литературное творчество', 'Реклама и связи с общественностью', 'Юриспруденция', 'Государственное и муниципальное управление', 'Химия', 'Педагогическое образование', 'Физическая культура', 'Сфера обслуживания', 'Религиоведение и теология', 'Психология', 'Менеджмент', 'Социология', 'История', 'Биология', 'Математика', 'География', 'Социальная работа', 'Экология', 'Бизнес-информатика', 'Политология'],
612: ['Экономика', 'Строительство', 'Дизайн', 'Архитектура и градостроительство', 'Энергетика и энергетическое машиностроение', 'Менеджмент', 'Транспортные средства', 'Технологические машины и оборудование'],
613: ['Экономика', 'Юриспруденция'],
614: ['Сельское и рыбное хозяйство', 'Биология', 'Профессиональное обучение', 'Транспортные средства', 'Экономика', 'Геодезия и землеустройство', 'Государственное и муниципальное управление'],
615: ['Юриспруденция', 'Экономика', 'Психология'],
616: ['Экономика', 'Государственное и муниципальное управление', 'Лесное дело', 'Сельское и рыбное хозяйство', 'Менеджмент', 'Профессиональное обучение', 'Биология', 'Геодезия и землеустройство'],
617: ['Психология', 'Здравоохранение', 'Сестринское дело2'],
618: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Сфера обслуживания', 'Лингвистика и иностранные языки', 'Журналистика и литературное творчество', 'Экология', 'Международные отношения', 'Физическая культура', 'Экономика', 'Менеджмент'],
619: ['Машиностроение', 'Экология', 'Технологические машины и оборудование', 'Архитектура и градостроительство', 'Математика', 'Педагогическое образование', 'Дизайн', 'Информатика и вычислительная техника', 'Строительство', 'Нефтегазовое дело', 'Транспортные средства', 'Энергетика и энергетическое машиностроение', 'Менеджмент', 'Автоматика и управление', 'Государственное и муниципальное управление', 'Экономика', 'Информационная безопасность', 'Технологии легкой промышленности', 'Химия', 'Лесное дело', 'Геология', 'Профессиональное обучение', 'Химическая и биотехнологии', 'Пищевые технологии', 'Электронная техника, радиотехника и связь', 'Материалы'],
620: ['Информатика и вычислительная техника', 'Менеджмент', 'Экономика', 'Транспортные средства', 'Строительство', 'Энергетика и энергетическое машиностроение', 'Экология', 'Автоматика и управление'],
621: ['Социология', 'Государственное и муниципальное управление', 'Экономика', 'Информатика и вычислительная техника', 'Юриспруденция', 'Реклама и связи с общественностью', 'Математика', 'Бизнес-информатика', 'Сфера обслуживания', 'Менеджмент', 'Геодезия и землеустройство'],
622: ['Информатика и вычислительная техника', 'Биология', 'Государственное и муниципальное управление', 'Бизнес-информатика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Менеджмент', 'Филология', 'Педагогическое образование', 'Юриспруденция', 'Реклама и связи с общественностью', 'Авиационная и ракетно-космическая техника', 'Информационная безопасность', 'Международные отношения', 'Социология', 'Химия', 'История', 'Математика', 'Экономика', 'Психология', 'Журналистика и литературное творчество', 'Авиационные системы (эксплуатация)', 'Лингвистика и иностранные языки', 'Машиностроение', 'Транспортные средства', 'Приборостроение и оптотехника', 'Физика', 'Автоматика и управление', 'Управление качеством', 'Технологические машины и оборудование', 'Электронная техника, радиотехника и связь', 'Энергетика и энергетическое машиностроение', 'Социальная работа', 'Металлургия'],
623: ['Лингвистика и иностранные языки', 'Педагогическое образование', 'Юриспруденция', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Международные отношения', 'Психология', 'Бизнес-информатика', 'Социология', 'Менеджмент'],
624: ['Сельское и рыбное хозяйство', 'Биология'],
625: ['Здравоохранение', 'Химическая и биотехнологии', 'Сфера обслуживания', 'Химия'],
627: ['Геология', 'Менеджмент', 'Геодезия и землеустройство', 'Нефтегазовое дело', 'Технологические машины и оборудование', 'Энергетика и энергетическое машиностроение', 'Электронная техника, радиотехника и связь', 'Транспортные средства', 'Архитектура и градостроительство', 'Строительство', 'Экономика', 'Управление качеством', 'Автоматика и управление', 'Машиностроение', 'Химическая и биотехнологии', 'Экология', 'Информатика и вычислительная техника', 'Материалы', 'Приборостроение и оптотехника', 'Металлургия'],
628: ['Сельское и рыбное хозяйство', 'Юриспруденция', 'Сфера обслуживания', 'Биология', 'Экономика', 'Строительство', 'Менеджмент', 'Информатика и вычислительная техника', 'Геодезия и землеустройство', 'Транспортные средства', 'Государственное и муниципальное управление', 'Энергетика и энергетическое машиностроение', 'Лесное дело', 'Экология', 'Пищевые технологии'],
629: ['Архитектура и градостроительство', 'Юриспруденция', 'Экология', 'Строительство', 'Геодезия и землеустройство', 'Дизайн', 'Менеджмент', 'Автоматика и управление', 'Транспортные средства', 'Лесное дело', 'Информатика и вычислительная техника', 'Экономика', 'Энергетика и энергетическое машиностроение', 'Математика', 'Сфера обслуживания', 'Технологические машины и оборудование', 'Управление качеством', 'Охрана памятников'],
630: ['Социология', 'Социальная работа', 'Психология', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
631: ['Химическая и биотехнологии', 'Строительство', 'Экономика', 'Управление качеством', 'Дизайн', 'Лесное дело', 'Менеджмент', 'Геодезия и землеустройство', 'Экология', 'Информатика и вычислительная техника', 'Транспортные средства', 'Автоматика и управление', 'Технологические машины и оборудование', 'Энергетика и энергетическое машиностроение'],
632: ['Энергетика и энергетическое машиностроение', 'Бизнес-информатика', 'Менеджмент', 'Социология', 'Экономика', 'Машиностроение', 'Автоматика и управление', 'Морская техника', 'Юриспруденция', 'Информатика и вычислительная техника', 'Вооружение', 'Информационная безопасность', 'Технологические машины и оборудование', 'Материалы', 'Экология'],
633: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Психология', 'Здравоохранение', 'Сестринское дело2'],
634: ['Химическая и биотехнологии', 'Реклама и связи с общественностью', 'Менеджмент', 'Бизнес-информатика', 'Экономика', 'Информатика и вычислительная техника', 'Химия', 'Материалы', 'Автоматика и управление', 'Строительство', 'Экология', 'Технологические машины и оборудование'],
635: ['Химия', 'Менеджмент', 'Экономика', 'Культурология', 'Материалы', 'Журналистика и литературное творчество', 'Информатика и вычислительная техника', 'Нефтегазовое дело', 'Религиоведение и теология', 'Юриспруденция', 'Теория искусств', 'Биология', 'Геодезия и землеустройство', 'Сфера обслуживания', 'Охрана памятников', 'Востоковедение и африканистика', 'География', 'Дизайн', 'Автоматика и управление', 'Математика', 'Социология', 'Сестринское дело2', 'Философия', 'Физическая культура', 'Филология', 'Почвоведение', 'Бизнес-информатика', 'Здравоохранение', 'Физика', 'Государственное и муниципальное управление', 'Лингвистика и иностранные языки', 'Политология', 'Международные отношения', 'Психология', 'Экология', 'История', 'Геология', 'Реклама и связи с общественностью', 'Социальная работа', 'Актерское исполнительство'],
636: ['Электронная техника, радиотехника и связь', 'Государственное и муниципальное управление', 'Авиационная и ракетно-космическая техника', 'Авиационные системы (эксплуатация)', 'Информатика и вычислительная техника', 'Сфера обслуживания', 'Приборостроение и оптотехника', 'Транспортные средства', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Реклама и связи с общественностью', 'Экономика', 'Менеджмент', 'Энергетика и энергетическое машиностроение', 'Бизнес-информатика', 'Автоматика и управление', 'Математика', 'Физика', 'Информационная безопасность', 'Международные отношения', 'Управление качеством', 'Экология', 'Культурология'],
637: ['Биология', 'Сельское и рыбное хозяйство'],
638: ['Реклама и связи с общественностью', 'Транспортные средства', 'Менеджмент', 'Юриспруденция', 'Экономика', 'Информатика и вычислительная техника', 'Авиационные системы (эксплуатация)', 'Авиационная и ракетно-космическая техника', 'Сфера обслуживания', 'Экология'],
639: ['Реклама и связи с общественностью', 'Автоматика и управление', 'Технологические машины и оборудование', 'Теория искусств', 'Экономика', 'Сфера обслуживания', 'Профессиональное обучение', 'Информатика и вычислительная техника', 'Менеджмент', 'Химия', 'Социальная работа', 'Журналистика и литературное творчество', 'Математика', 'Энергетика и энергетическое машиностроение', 'Технологии легкой промышленности', 'Дизайн', 'Издательское дело', 'Химическая и биотехнологии', 'Информационная безопасность', 'Полиграфия и упаковка', 'Экология', 'Управление качеством'],
640: ['Электронная техника, радиотехника и связь', 'Информатика и вычислительная техника', 'Приборостроение и оптотехника', 'Информационная безопасность', 'Менеджмент', 'Международные отношения', 'Реклама и связи с общественностью', 'Бизнес-информатика', 'Автоматика и управление', 'Экология'],
641: ['Математика', 'Бизнес-информатика', 'Международные отношения', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Социология', 'Сфера обслуживания', 'Менеджмент', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью', 'Информационная безопасность', 'Управление качеством', 'Экономика', 'Государственное и муниципальное управление'],
642: ['Приборостроение и оптотехника', 'Управление качеством', 'Лингвистика и иностранные языки', 'Менеджмент', 'Информационная безопасность', 'Реклама и связи с общественностью', 'Электронная техника, радиотехника и связь', 'Математика', 'Автоматика и управление', 'Экология', 'Информатика и вычислительная техника', 'Энергетика и энергетическое машиностроение'],
626: ['Журналистика и литературное творчество', 'Социальная работа', 'Социология', 'Юриспруденция', 'Психология', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Менеджмент', 'Теория искусств', 'Экономика'],
643: ['Информатика и вычислительная техника', 'Актерское исполнительство'],
644: ['Экономика', 'Менеджмент', 'Юриспруденция'],
645: ['Юриспруденция'],
646: ['Физика'],
647: ['Физика'],
648: ['Юриспруденция', 'Машиностроение', 'Архитектура и градостроительство', 'Информационная безопасность', 'Информатика и вычислительная техника', 'Дизайн', 'Химическая и биотехнологии', 'Автоматика и управление', 'Пищевые технологии', 'Менеджмент', 'Строительство', 'Бизнес-информатика', 'Физика', 'Энергетика и энергетическое машиностроение', 'Металлургия', 'Приборостроение и оптотехника', 'Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Электронная техника, радиотехника и связь', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Издательское дело', 'Математика', 'Экология', 'Международные отношения', 'Транспортные средства', 'Экономика', 'Технологические машины и оборудование', 'Сфера обслуживания', 'Государственное и муниципальное управление', 'Ядерные физика и технологии', 'Управление качеством', 'Материалы'],
649: ['Педагогическое образование', 'Экономика', 'Менеджмент', 'Реклама и связи с общественностью', 'Издательское дело', 'Информатика и вычислительная техника', 'Психология', 'Юриспруденция', 'Бизнес-информатика', 'Лингвистика и иностранные языки', 'Государственное и муниципальное управление', 'Сфера обслуживания'],
650: ['Экономика', 'Менеджмент', 'Бизнес-информатика'],
651: ['Информатика и вычислительная техника', 'Юриспруденция', 'Экономика', 'Менеджмент'],
652: ['Информатика и вычислительная техника', 'Экономика', 'Технологические машины и оборудование'],
653: ['Экономика', 'Юриспруденция'],
654: ['Строительство', 'Экология', 'Химическая и биотехнологии', 'Лесное дело', 'Геодезия и землеустройство', 'Сельское и рыбное хозяйство', 'Менеджмент', 'Управление качеством', 'Пищевые технологии', 'Транспортные средства', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Экономика', 'Энергетика и энергетическое машиностроение'],
655: ['Здравоохранение', 'Сестринское дело2', 'Психология', 'Химическая и биотехнологии'],
656: ['Химическая и биотехнологии', 'Энергетика и энергетическое машиностроение', 'Нефтегазовое дело', 'Приборостроение и оптотехника', 'Лингвистика и иностранные языки', 'Геодезия и землеустройство', 'Математика', 'Экономика', 'Технологические машины и оборудование', 'Дизайн', 'Менеджмент', 'Информатика и вычислительная техника', 'Информационная безопасность', 'Строительство', 'Электронная техника, радиотехника и связь', 'Реклама и связи с общественностью', 'Управление качеством', 'Транспортные средства', 'Экология', 'Автоматика и управление', 'Архитектура и градостроительство', 'Библиотеки и архивы', 'Психология', 'Машиностроение', 'Сфера обслуживания', 'Социальная работа', 'Ядерные физика и технологии', 'Юриспруденция', 'Социология', 'Материалы'],
657: ['Здравоохранение'],
658: ['Государственное и муниципальное управление', 'Информационная безопасность', 'Психология', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Химическая и биотехнологии', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Химия', 'Журналистика и литературное творчество', 'Филология', 'Юриспруденция', 'Сфера обслуживания', 'Математика', 'Здравоохранение', 'Международные отношения', 'Информатика и вычислительная техника', 'Экономика', 'Педагогическое образование', 'Менеджмент', 'История', 'Бизнес-информатика', 'Политология', 'Социология', 'Философия', 'Культурология', 'Биология', 'Автоматика и управление', 'География', 'Геология', 'Экология', 'Социальная работа', 'Электронная техника, радиотехника и связь', 'Физика'],
659: ['Экономика', 'Менеджмент', 'Информатика и вычислительная техника', 'Лингвистика и иностранные языки', 'Государственное и муниципальное управление', 'Сфера обслуживания'],
660: ['Информатика и вычислительная техника', 'Технологические машины и оборудование', 'Экономика', 'Ядерные физика и технологии', 'Электронная техника, радиотехника и связь', 'Математика', 'Физика'],
661: ['Юриспруденция', 'Информатика и вычислительная техника', 'Лингвистика и иностранные языки', 'Строительство', 'Востоковедение и африканистика', 'Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Математика', 'Нефтегазовое дело', 'Государственное и муниципальное управление', 'Экономика'],
662: ['Юриспруденция', 'Энергетика и энергетическое машиностроение', 'Строительство', 'Экономика'],
663: ['Энергетика и энергетическое машиностроение'],
664: ['Информатика и вычислительная техника', 'Экономика', 'Строительство', 'Менеджмент'],
665: ['Психология', 'Информатика и вычислительная техника', 'Политология', 'Управление водным транспортом', 'Реклама и связи с общественностью', 'Пищевые технологии', 'Строительство', 'Здравоохранение', 'Дизайн', 'Физическая культура', 'Информационная безопасность', 'Электронная техника, радиотехника и связь', 'Лингвистика и иностранные языки', 'Сфера обслуживания', 'Журналистика и литературное творчество', 'Экология', 'Юриспруденция', 'Педагогическое образование', 'Энергетика и энергетическое машиностроение', 'Ядерные физика и технологии', 'Филология', 'Государственное и муниципальное управление', 'Автоматика и управление', 'Химическая и биотехнологии', 'Архитектура и градостроительство', 'Востоковедение и африканистика', 'Экономика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'История', 'Социология', 'Менеджмент', 'Морская техника'],
666: ['Экономика', 'Менеджмент', 'Юриспруденция'],
667: ['Юриспруденция', 'Сфера обслуживания', 'Психология', 'Государственное и муниципальное управление'],
668: ['Экономика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Международные отношения', 'Филология', 'Психология', 'Физическая культура', 'Юриспруденция', 'Журналистика и литературное творчество', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Бизнес-информатика', 'Менеджмент', 'Политология', 'Биология', 'Педагогическое образование', 'Социология', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Математика', 'Информационная безопасность', 'Лесное дело', 'Энергетика и энергетическое машиностроение', 'История', 'Здравоохранение', 'Экология', 'Геология', 'Приборостроение и оптотехника', 'Транспортные средства', 'Строительство', 'Нефтегазовое дело', 'География', 'Философия', 'Химическая и биотехнологии'],
669: ['Здравоохранение', 'Психология', 'Сестринское дело2'],
670: ['Юриспруденция'],
671: ['Юриспруденция', 'Журналистика и литературное творчество', 'Информатика и вычислительная техника', 'Геология', 'Менеджмент', 'Биология', 'Экономика', 'Педагогическое образование', 'Государственное и муниципальное управление'],
672: ['Психология', 'Педагогическое образование', 'Лесное дело', 'Сестринское дело2', 'Архитектура и градостроительство', 'Международные отношения', 'Менеджмент', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'История', 'Журналистика и литературное творчество', 'Математика', 'Геодезия и землеустройство', 'Филология', 'Экология', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Юриспруденция', 'Здравоохранение', 'Реклама и связи с общественностью', 'Сфера обслуживания', 'Экономика', 'Электронная техника, радиотехника и связь', 'Биология', 'Социальная работа', 'Политология', 'Физическая культура', 'Энергетика и энергетическое машиностроение', 'Профессиональное обучение', 'Физика', 'Химическая и биотехнологии', 'Строительство', 'Культурология', 'Геология'],
673: ['Здравоохранение', 'Сестринское дело2'],
674: ['Юриспруденция'],
675: ['Психология', 'Социология', 'Государственное и муниципальное управление', 'Менеджмент', 'Международные отношения', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Экономика', 'Юриспруденция', 'Сфера обслуживания', 'Журналистика и литературное творчество', 'Бизнес-информатика', 'Политология'],
676: ['Экономика', 'Юриспруденция', 'Менеджмент'],
677: ['Юриспруденция'],
678: ['Юриспруденция', 'Экономика'],
679: ['Лингвистика и иностранные языки', 'Дизайн', 'Экономика', 'Юриспруденция', 'Информатика и вычислительная техника', 'Здравоохранение', 'Сельское и рыбное хозяйство', 'Строительство'],
680: ['Лесное дело', 'Здравоохранение', 'Экономика', 'Юриспруденция', 'Информатика и вычислительная техника', 'Лингвистика и иностранные языки', 'Сельское и рыбное хозяйство', 'Энергетика и энергетическое машиностроение', 'Строительство', 'Технологические машины и оборудование', 'Транспортные средства'],
681: ['Геология', 'Энергетика и энергетическое машиностроение', 'Технологические машины и оборудование', 'Экономика', 'Юриспруденция', 'Менеджмент', 'Строительство', 'Дизайн', 'Информатика и вычислительная техника', 'Транспортные средства', 'Металлургия', 'Электронная техника, радиотехника и связь', 'Архитектура и градостроительство', 'Автоматика и управление', 'Государственное и муниципальное управление', 'Нефтегазовое дело', 'Экология', 'Пищевые технологии', 'Сфера обслуживания'],
683: ['Государственное и муниципальное управление', 'Юриспруденция', 'Менеджмент', 'Экономика'],
682: ['Юриспруденция'],
684: ['Юриспруденция', 'Экономика', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью', 'Сфера обслуживания', 'Психология', 'Менеджмент'],
685: ['Государственное и муниципальное управление', 'Международные отношения', 'Пищевые технологии', 'Химия', 'Реклама и связи с общественностью', 'Здравоохранение', 'Социология', 'Энергетика и энергетическое машиностроение', 'Информационная безопасность', 'Строительство', 'Информатика и вычислительная техника', 'Филология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Геология', 'Дизайн', 'Экономика', 'География', 'Транспортные средства', 'История', 'Экология', 'Психология', 'Химическая и биотехнологии', 'Физика', 'Математика', 'Бизнес-информатика', 'Журналистика и литературное творчество', 'Нефтегазовое дело', 'Технологические машины и оборудование', 'Менеджмент', 'Педагогическое образование', 'Физическая культура', 'Биология', 'Электронная техника, радиотехника и связь', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Сфера обслуживания', 'Геодезия и землеустройство', 'Социальная работа', 'Управление качеством'],
686: ['Строительство', 'Экономика', 'Информатика и вычислительная техника', 'Менеджмент'],
687: ['Транспортные средства'],
688: ['Электронная техника, радиотехника и связь', 'Информатика и вычислительная техника', 'Информационная безопасность'],
689: ['Юриспруденция'],
690: ['Здравоохранение'],
691: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
692: ['Информатика и вычислительная техника', 'Филология', 'Менеджмент', 'Здравоохранение', 'Сфера обслуживания', 'Биология', 'Журналистика и литературное творчество', 'Физическая культура', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Экономика', 'Педагогическое образование', 'Технологии легкой промышленности', 'Психология', 'Юриспруденция', 'Математика', 'История', 'Востоковедение и африканистика', 'Химия', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Социология', 'Экология', 'География', 'Пищевые технологии', 'Физика', 'Государственное и муниципальное управление', 'Социальная работа'],
693: ['Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Экономика', 'Химическая и биотехнологии'],
694: ['Математика', 'Экономика', 'Педагогическое образование', 'Экология', 'Транспортные средства', 'Менеджмент', 'Юриспруденция', 'Биология', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
695: ['Педагогическое образование', 'Юриспруденция', 'Экономика'],
696: ['Экономика'],
697: ['Строительство', 'Архитектура и градостроительство', 'Информатика и вычислительная техника', 'Транспортные средства', 'Профессиональное обучение', 'Менеджмент', 'Экономика', 'Энергетика и энергетическое машиностроение', 'Экология', 'Автоматика и управление', 'Информационная безопасность'],
698: ['Педагогическое образование', 'Архитектура и градостроительство', 'Менеджмент', 'Информатика и вычислительная техника', 'Экономика', 'Библиотеки и архивы', 'Социальная работа', 'Экология', 'Энергетика и энергетическое машиностроение', 'Транспортные средства', 'Геология', 'Строительство', 'Реклама и связи с общественностью', 'Электронная техника, радиотехника и связь', 'Сфера обслуживания'],
699: ['Менеджмент', 'Биология', 'Психология', 'Здравоохранение', 'Сестринское дело2'],
700: ['Информатика и вычислительная техника', 'Морская техника', 'Транспортные средства', 'Управление водным транспортом', 'Менеджмент', 'Экономика', 'Строительство', 'Энергетика и энергетическое машиностроение', 'Экология'],
701: ['Экология', 'Геодезия и землеустройство', 'Экономика', 'Информатика и вычислительная техника', 'Юриспруденция', 'Менеджмент', 'Информационная безопасность', 'География', 'Геология', 'Приборостроение и оптотехника'],
702: ['Экономика', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Менеджмент', 'Профессиональное обучение', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Социальная работа', 'Информационная безопасность', 'Автоматика и управление', 'Геодезия и землеустройство', 'Транспортные средства', 'Авиационные системы (эксплуатация)', 'Технологические машины и оборудование', 'Электронная техника, радиотехника и связь', 'Машиностроение', 'Энергетика и энергетическое машиностроение', 'Физика', 'Психология', 'Химическая и биотехнологии', 'Лесное дело', 'Авиационная и ракетно-космическая техника', 'Экология'],
703: ['Государственное и муниципальное управление', 'Юриспруденция', 'Экономика', 'Реклама и связи с общественностью', 'Информатика и вычислительная техника', 'Строительство', 'Психология', 'Менеджмент', 'Транспортные средства', 'Экология', 'Управление качеством'],
704: ['Математика', 'Электронная техника, радиотехника и связь', 'Информационная безопасность', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Реклама и связи с общественностью', 'Экология', 'Экономика', 'Менеджмент', 'Социология'],
705: ['Государственное и муниципальное управление', 'Менеджмент', 'Юриспруденция', 'Реклама и связи с общественностью', 'Психология', 'Экономика', 'Международные отношения'],
706: ['Химическая и биотехнологии', 'Технологические машины и оборудование', 'Автоматика и управление'],
707: ['Лингвистика и иностранные языки'],
708: ['Пищевые технологии', 'Информатика и вычислительная техника', 'Экономика', 'Менеджмент', 'Сфера обслуживания', 'Реклама и связи с общественностью', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Юриспруденция', 'Сельское и рыбное хозяйство'],
709: ['Менеджмент', 'Библиотеки и архивы', 'Биология', 'Физическая культура', 'Психология', 'Химия', 'Информационная безопасность', 'Сфера обслуживания', 'География', 'Бизнес-информатика', 'История', 'Государственное и муниципальное управление', 'Педагогическое образование', 'Строительство', 'Международные отношения', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Дизайн', 'Социология', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника', 'Филология', 'Философия', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Геология', 'Реклама и связи с общественностью', 'Нефтегазовое дело', 'Экология', 'Социальная работа', 'Архитектура и градостроительство', 'Журналистика и литературное творчество', 'Теория искусств', 'Математика', 'Религиоведение и теология', 'Юриспруденция', 'Химическая и биотехнологии', 'Экономика', 'Транспортные средства', 'Культурология', 'Пищевые технологии', 'Издательское дело', 'Машиностроение', 'Металлургия', 'Технологические машины и оборудование', 'Ядерные физика и технологии', 'Физика'],
710: ['Юриспруденция', 'Психология'],
711: ['Экономика', 'Государственное и муниципальное управление', 'Геодезия и землеустройство', 'Сельское и рыбное хозяйство', 'Транспортные средства'],
712: ['Здравоохранение', 'Психология'],
713: ['Социология', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Юриспруденция', 'Экономика', 'Лингвистика и иностранные языки', 'Журналистика и литературное творчество', 'Дизайн', 'Менеджмент', 'Математика', 'Международные отношения', 'Социальная работа', 'Архитектура и градостроительство', 'Строительство', 'Психология', 'Экология'],
714: ['Экономика', 'Менеджмент', 'Пищевые технологии'],
715: ['Юриспруденция'],
716: ['Юриспруденция', 'Экономика', 'Государственное и муниципальное управление', 'Менеджмент'],
717: ['Экономика', 'Менеджмент', 'Сфера обслуживания'],
718: ['Юриспруденция'],
719: ['Экономика', 'Менеджмент', 'Юриспруденция', 'Бизнес-информатика'],
720: ['Дизайн', 'Экономика', 'Информатика и вычислительная техника', 'Менеджмент', 'Сфера обслуживания'],
721: ['Экономика'],
722: ['Архитектура и градостроительство', 'Сфера обслуживания', 'Химическая и биотехнологии', 'Строительство', 'Информатика и вычислительная техника', 'Энергетика и энергетическое машиностроение'],
723: ['Педагогическое образование', 'Психология', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
724: ['Архитектура и градостроительство', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Дизайн', 'Физическая культура', 'Юриспруденция', 'Строительство', 'Сфера обслуживания', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Экономика', 'Государственное и муниципальное управление', 'Психология', 'Реклама и связи с общественностью', 'Менеджмент'],
725: ['Экономика', 'Журналистика и литературное творчество', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Биология', 'Филология', 'История', 'Сельское и рыбное хозяйство', 'Экология'],
726: ['Юриспруденция'],
727: ['Государственное и муниципальное управление', 'Экономика', 'Сфера обслуживания', 'Менеджмент', 'Юриспруденция', 'Социальная работа', 'Реклама и связи с общественностью', 'Информатика и вычислительная техника', 'Пищевые технологии', 'Бизнес-информатика', 'Социология'],
728: ['Экономика', 'Сельское и рыбное хозяйство', 'Бизнес-информатика', 'Менеджмент', 'Транспортные средства', 'Геодезия и землеустройство', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Сфера обслуживания', 'Энергетика и энергетическое машиностроение', 'Экология', 'Пищевые технологии'],
729: ['Сестринское дело2', 'Психология', 'Здравоохранение', 'Химическая и биотехнологии', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Социальная работа'],
730: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование'],
731: ['Юриспруденция', 'Экономика', 'Менеджмент'],
732: ['Юриспруденция', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника', 'Педагогическое образование', 'Менеджмент', 'Государственное и муниципальное управление'],
733: ['Менеджмент', 'Государственное и муниципальное управление', 'Юриспруденция'],
734: ['Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Информатика и вычислительная техника', 'Менеджмент', 'Экономика', 'Технологические машины и оборудование', 'Бизнес-информатика', 'Геология'],
735: ['Педагогическое образование', 'Экономика', 'Менеджмент', 'Государственное и муниципальное управление', 'Геодезия и землеустройство'],
736: ['Нефтегазовое дело', 'Геология'],
737: ['Педагогическое образование', 'Математика', 'Экономика', 'Юриспруденция', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Химия', 'Биология', 'Государственное и муниципальное управление', 'Физика', 'Информатика и вычислительная техника'],
738: ['Юриспруденция', 'Педагогическое образование', 'Экономика', 'Математика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Государственное и муниципальное управление'],
739: ['Менеджмент', 'Информатика и вычислительная техника', 'Автоматика и управление', 'Материалы', 'Авиационная и ракетно-космическая техника'],
740: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Дизайн', 'Физическая культура', 'Библиотеки и архивы', 'Педагогическое образование', 'Журналистика и литературное творчество', 'Экономика', 'Менеджмент'],
741: ['Здравоохранение', 'Политология', 'Бизнес-информатика', 'История', 'Юриспруденция', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника', 'Менеджмент', 'Строительство', 'Экология', 'Экономика', 'Государственное и муниципальное управление', 'Психология', 'Реклама и связи с общественностью', 'Электронная техника, радиотехника и связь', 'Педагогическое образование', 'Химия', 'Энергетика и энергетическое машиностроение', 'Биология', 'Физическая культура', 'Автоматика и управление', 'Математика', 'Охрана памятников', 'Физика'],
742: ['Транспортные средства', 'Нефтегазовое дело'],
743: ['Юриспруденция', 'Экономика'],
744: ['Здравоохранение', 'Информационная безопасность', 'Юриспруденция', 'Психология', 'Архитектура и градостроительство', 'Реклама и связи с общественностью', 'Сфера обслуживания', 'История', 'Экономика', 'Менеджмент', 'Журналистика и литературное творчество', 'Филология', 'Педагогическое образование', 'Математика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Политология', 'Социальная работа', 'Экология', 'Физическая культура', 'Информатика и вычислительная техника', 'Дизайн', 'Физика'],
745: ['Экономика', 'Строительство', 'Геодезия и землеустройство', 'Технологические машины и оборудование', 'Лесное дело'],
746: ['История', 'Профессиональное обучение', 'Лингвистика и иностранные языки', 'Педагогическое образование', 'Юриспруденция', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Психология', 'Информатика и вычислительная техника', 'Менеджмент'],
747: ['Экономика', 'Юриспруденция', 'Менеджмент', 'Государственное и муниципальное управление'],
748: ['Экономика', 'Юриспруденция', 'Менеджмент', 'Реклама и связи с общественностью', 'Информатика и вычислительная техника', 'Архитектура и градостроительство', 'Строительство', 'Экология', 'Информационная безопасность', 'Дизайн', 'Нефтегазовое дело', 'Энергетика и энергетическое машиностроение', 'Электронная техника, радиотехника и связь', 'Транспортные средства', 'Бизнес-информатика', 'Автоматика и управление', 'Приборостроение и оптотехника', 'Сфера обслуживания', 'Химическая и биотехнологии', 'Управление качеством'],
749: ['Биология', 'Экономика', 'Сфера обслуживания', 'Психология', 'Юриспруденция', 'Педагогическое образование', 'История', 'Архитектура и градостроительство', 'Физическая культура', 'Филология', 'Информационная безопасность', 'Международные отношения', 'Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Информатика и вычислительная техника', 'Здравоохранение', 'Журналистика и литературное творчество', 'Дизайн', 'Социальная работа', 'Менеджмент', 'Экология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Электронная техника, радиотехника и связь', 'Социология', 'Охрана памятников', 'Государственное и муниципальное управление', 'Актерское исполнительство', 'Религиоведение и теология', 'Бизнес-информатика', 'Культурология', 'Политология', 'Химия', 'Математика'],
750: ['Государственное и муниципальное управление', 'Юриспруденция', 'Менеджмент', 'Экономика'],
751: ['Юриспруденция', 'Информатика и вычислительная техника', 'Экономика'],
752: ['Менеджмент'],
753: ['Транспортные средства', 'Менеджмент', 'Экономика', 'Сельское и рыбное хозяйство', 'Химическая и биотехнологии', 'Лесное дело', 'Сфера обслуживания'],
754: ['Здравоохранение', 'Психология'],
755: ['Экономика', 'Реклама и связи с общественностью', 'Менеджмент', 'Социология', 'Психология', 'Информатика и вычислительная техника', 'Строительство', 'Химия', 'Энергетика и энергетическое машиностроение', 'Геодезия и землеустройство', 'Транспортные средства', 'Автоматика и управление', 'Химическая и биотехнологии', 'Технологические машины и оборудование', 'Приборостроение и оптотехника', 'Экология', 'Геология'],
756: ['Бизнес-информатика', 'Химия', 'Сфера обслуживания', 'Реклама и связи с общественностью', 'Физическая культура', 'Журналистика и литературное творчество', 'Политология', 'Государственное и муниципальное управление', 'Филология', 'Юриспруденция', 'Международные отношения', 'Педагогическое образование', 'История', 'Менеджмент', 'Издательское дело', 'География', 'Экономика', 'Психология', 'Лингвистика и иностранные языки', 'Информационная безопасность', 'Математика', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Социология', 'Биология', 'Библиотеки и архивы', 'Социальная работа', 'Информатика и вычислительная техника', 'Экология', 'Физика', 'Пищевые технологии', 'Лесное дело'],
757: ['Психология', 'Юриспруденция', 'Менеджмент', 'Экономика'],
758: ['Государственное и муниципальное управление', 'Экономика', 'Менеджмент'],
759: ['Математика', 'Педагогическое образование'],
760: ['Геология', 'Металлургия', 'Лесное дело', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Информатика и вычислительная техника', 'Технологические машины и оборудование'],
762: ['Экономика', 'Информатика и вычислительная техника'],
763: ['Информатика и вычислительная техника'],
761: ['Информатика и вычислительная техника', 'Технологические машины и оборудование', 'Экономика'],
764: ['Электронная техника, радиотехника и связь', 'Технологии легкой промышленности', 'Сфера обслуживания', 'Экономика', 'Технологические машины и оборудование'],
765: ['Технологии легкой промышленности', 'Информатика и вычислительная техника', 'Сфера обслуживания', 'Электронная техника, радиотехника и связь', 'Экономика', 'Менеджмент'],
766: ['Психология', 'Информатика и вычислительная техника', 'Математика', 'Государственное и муниципальное управление', 'Менеджмент', 'Бизнес-информатика', 'Социология', 'Экономика', 'Дизайн', 'Информационная безопасность', 'Реклама и связи с общественностью', 'Автоматика и управление', 'Электронная техника, радиотехника и связь', 'Авиационная и ракетно-космическая техника', 'Технологические машины и оборудование', 'Управление качеством'],
767: ['Психология', 'Здравоохранение', 'Сестринское дело2'],
768: ['Лингвистика и иностранные языки', 'Международные отношения', 'Педагогическое образование', 'Экономика', 'Архитектура и градостроительство', 'Дизайн', 'Филология', 'Журналистика и литературное творчество', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Реклама и связи с общественностью', 'Юриспруденция', 'Информатика и вычислительная техника', 'Менеджмент', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Психология', 'Информационная безопасность', 'Бизнес-информатика', 'Социальная работа', 'Математика', 'Геология', 'Технологические машины и оборудование', 'Строительство', 'Экология', 'Автоматика и управление', 'Нефтегазовое дело', 'Электронная техника, радиотехника и связь', 'Транспортные средства', 'Геодезия и землеустройство', 'Управление качеством'],
769: ['Энергетика и энергетическое машиностроение', 'Автоматика и управление', 'Химическая и биотехнологии'],
770: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Профессиональное обучение', 'Лингвистика и иностранные языки', 'Биология', 'Психология', 'Социальная работа'],
771: ['Менеджмент', 'Реклама и связи с общественностью', 'Информатика и вычислительная техника', 'Дизайн', 'Экономика'],
772: ['Дизайн', 'Юриспруденция', 'Менеджмент', 'Экономика', 'Информатика и вычислительная техника', 'Лингвистика и иностранные языки', 'Педагогическое образование', 'Журналистика и литературное творчество', 'История', 'Математика', 'Социология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Транспортные средства', 'Филология', 'Управление качеством'],
773: ['Экология', 'Экономика', 'Информатика и вычислительная техника', 'Строительство', 'Архитектура и градостроительство', 'Транспортные средства', 'Сфера обслуживания', 'Нефтегазовое дело', 'Геодезия и землеустройство'],
774: ['Педагогическое образование', 'Лингвистика и иностранные языки', 'Профессиональное обучение', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника', 'Экономика', 'Менеджмент'],
775: ['Экономика', 'Менеджмент', 'Сфера обслуживания', 'Государственное и муниципальное управление', 'Юриспруденция', 'Социальная работа', 'Информатика и вычислительная техника', 'Информационная безопасность', 'Бизнес-информатика', 'Экология', 'Электронная техника, радиотехника и связь', 'Управление качеством', 'Автоматика и управление', 'Авиационные системы (эксплуатация)'],
776: ['Сельское и рыбное хозяйство', 'Юриспруденция', 'Экономика'],
777: ['Технологические машины и оборудование'],
778: ['Экономика', 'Юриспруденция'],
779: ['Геология', 'Педагогическое образование', 'Экономика', 'Лесное дело', 'Юриспруденция', 'Физическая культура', 'Строительство', 'Информатика и вычислительная техника', 'География', 'Биология', 'Математика', 'Химия', 'Социальная работа', 'Транспортные средства', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Менеджмент', 'Энергетика и энергетическое машиностроение', 'Сфера обслуживания', 'Международные отношения', 'Сельское и рыбное хозяйство', 'Филология', 'История', 'Библиотеки и архивы', 'Государственное и муниципальное управление'],
780: ['Филология', 'Лингвистика и иностранные языки', 'Здравоохранение', 'Педагогическое образование', 'История', 'Сфера обслуживания', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Математика', 'Психология', 'Профессиональное обучение', 'Экология', 'Сельское и рыбное хозяйство', 'Информатика и вычислительная техника', 'Физическая культура', 'Экономика', 'Биология', 'Библиотеки и архивы', 'Менеджмент', 'Социальная работа', 'Химия'],
781: ['Архитектура и градостроительство', 'Дизайн', 'Машиностроение', 'Психология', 'Вооружение', 'Социология', 'Информационная безопасность', 'Экономика', 'Математика', 'Электронная техника, радиотехника и связь', 'Педагогическое образование', 'Биология', 'Информатика и вычислительная техника', 'Строительство', 'Физическая культура', 'Геодезия и землеустройство', 'Политология', 'Юриспруденция', 'Государственное и муниципальное управление', 'Химия', 'Журналистика и литературное творчество', 'Менеджмент', 'Здравоохранение', 'Управление качеством', 'Химическая и биотехнологии', 'Лингвистика и иностранные языки', 'Реклама и связи с общественностью', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Технологические машины и оборудование', 'Приборостроение и оптотехника', 'Транспортные средства', 'Авиационная и ракетно-космическая техника', 'Религиоведение и теология', 'Сфера обслуживания', 'Экология', 'Материалы', 'Геология'],
782: ['Юриспруденция'],
783: ['Экономика', 'Государственное и муниципальное управление', 'Менеджмент'],
784: ['Менеджмент', 'Экономика'],
785: ['Менеджмент', 'Экономика', 'Бизнес-информатика', 'Государственное и муниципальное управление'],
786: ['Дизайн', 'Социальная работа', 'Архитектура и градостроительство', 'Теория искусств', 'Сфера обслуживания'],
787: ['Сестринское дело2', 'Здравоохранение'],
788: ['Математика', 'Биология', 'Государственное и муниципальное управление', 'Физическая культура', 'Информатика и вычислительная техника', 'Автоматика и управление', 'Экономика', 'Социология', 'География', 'Менеджмент', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Реклама и связи с общественностью', 'Химическая и биотехнологии', 'Международные отношения', 'Психология', 'Журналистика и литературное творчество', 'Химия', 'Юриспруденция', 'Физика', 'Информационная безопасность', 'Лесное дело', 'Сфера обслуживания', 'История', 'Экология', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Филология', 'Теория искусств', 'Библиотеки и архивы'],
789: ['Транспортные средства', 'Сфера обслуживания', 'Дизайн', 'Архитектура и градостроительство', 'Геодезия и землеустройство', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Реклама и связи с общественностью', 'Нефтегазовое дело', 'Бизнес-информатика', 'Политология', 'Строительство', 'Менеджмент', 'Информатика и вычислительная техника', 'Экология', 'Машиностроение', 'Химическая и биотехнологии', 'Математика', 'Геология', 'Пищевые технологии', 'Лингвистика и иностранные языки', 'Управление качеством', 'Социология', 'Приборостроение и оптотехника', 'Лесное дело', 'Материалы', 'Технологические машины и оборудование'],
790: ['Энергетика и энергетическое машиностроение', 'Информатика и вычислительная техника', 'Менеджмент', 'Экономика', 'Сельское и рыбное хозяйство'],
791: ['Биология', 'Юриспруденция', 'Журналистика и литературное творчество', 'Дизайн', 'Экономика', 'Филология', 'Математика', 'Психология', 'Нефтегазовое дело', 'Международные отношения', 'Информатика и вычислительная техника', 'История', 'Лингвистика и иностранные языки', 'Сфера обслуживания', 'Менеджмент', 'Физическая культура', 'Государственное и муниципальное управление', 'Реклама и связи с общественностью', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Социология', 'Политология', 'Библиотеки и архивы', 'Химия', 'Экология', 'Социальная работа', 'География', 'Информационная безопасность', 'Геология', 'Материалы', 'Физика', 'Химическая и биотехнологии', 'Бизнес-информатика', 'Энергетика и энергетическое машиностроение'],
792: ['Экономика', 'Сельское и рыбное хозяйство', 'Транспортные средства'],
793: ['Юриспруденция', 'Лингвистика и иностранные языки', 'Социальная работа', 'Педагогическое образование', 'Журналистика и литературное творчество', 'Менеджмент', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Профессиональное обучение', 'Биология', 'Сфера обслуживания'],
794: ['Экономика', 'Математика', 'Архитектура и градостроительство', 'Строительство', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью', 'Менеджмент', 'Лингвистика и иностранные языки', 'Издательское дело', 'Энергетика и энергетическое машиностроение', 'Авиационная и ракетно-космическая техника', 'Нефтегазовое дело'],
795: ['Физическая культура', 'Математика', 'Информатика и вычислительная техника', 'Юриспруденция', 'Государственное и муниципальное управление', 'Экология', 'Журналистика и литературное творчество', 'Здравоохранение', 'Бизнес-информатика', 'Реклама и связи с общественностью', 'Экономика', 'Лингвистика и иностранные языки', 'Международные отношения', 'Нефтегазовое дело', 'Биология', 'Сфера обслуживания', 'Менеджмент', 'Психология', 'Социальная работа', 'Информационная безопасность', 'Электронная техника, радиотехника и связь', 'Лесное дело', 'Библиотеки и архивы', 'Социология', 'Политология'],
796: ['Авиационные системы (эксплуатация)', 'Авиационная и ракетно-космическая техника', 'Экология', 'Управление качеством'],
797: ['Юриспруденция', 'Экономика', 'Государственное и муниципальное управление'],
799: ['Информатика и вычислительная техника', 'Автоматика и управление'],
800: ['Информатика и вычислительная техника'],
798: ['Математика', 'Автоматика и управление', 'Химия', 'Приборостроение и оптотехника', 'Менеджмент', 'Лингвистика и иностранные языки', 'Электронная техника, радиотехника и связь', 'Информационная безопасность', 'Физика', 'Химическая и биотехнологии', 'Информатика и вычислительная техника', 'Экология', 'Бизнес-информатика', 'Профессиональное обучение', 'Энергетика и энергетическое машиностроение', 'Транспортные средства', 'Ядерные физика и технологии', 'Пищевые технологии', 'Экономика'],
801: ['Менеджмент', 'Юриспруденция', 'Реклама и связи с общественностью', 'Дизайн', 'Информатика и вычислительная техника', 'Бизнес-информатика', 'Государственное и муниципальное управление', 'Психология', 'Экономика', 'Сфера обслуживания', 'Социология', 'Архитектура и градостроительство'],
802: ['Юриспруденция', 'Менеджмент', 'Экономика', 'Бизнес-информатика', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Международные отношения', 'Социальная работа'],
803: ['Профессиональное обучение', 'Сельское и рыбное хозяйство', 'Химическая и биотехнологии', 'Менеджмент', 'Сфера обслуживания', 'Экономика', 'Геодезия и землеустройство'],
804: ['Дизайн', 'Архитектура и градостроительство'],
805: ['Геодезия и землеустройство', 'Менеджмент', 'Геология', 'Информатика и вычислительная техника', 'Экология', 'Машиностроение', 'Экономика', 'Энергетика и энергетическое машиностроение', 'Автоматика и управление', 'Технологические машины и оборудование', 'Транспортные средства'],
806: ['Строительство', 'Экономика', 'Информатика и вычислительная техника', 'Автоматика и управление', 'Геодезия и землеустройство', 'Транспортные средства', 'Лесное дело', 'Технологические машины и оборудование', 'Сфера обслуживания', 'Экология', 'Химическая и биотехнологии', 'Менеджмент'],
807: ['Психология', 'Здравоохранение', 'Сестринское дело2'],
808: ['Педагогическое образование', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Международные отношения', 'Психология', 'Реклама и связи с общественностью', 'Социология', 'Информатика и вычислительная техника'],
809: ['Строительство', 'Автоматика и управление', 'Экономика', 'Транспортные средства', 'Менеджмент', 'Экология', 'Сфера обслуживания', 'Информатика и вычислительная техника', 'Социология', 'Информационная безопасность', 'Энергетика и энергетическое машиностроение'],
810: ['Экономика', 'Математика', 'Информатика и вычислительная техника', 'Юриспруденция', 'Информационная безопасность', 'Государственное и муниципальное управление', 'Управление качеством', 'Химическая и биотехнологии', 'Бизнес-информатика', 'Сфера обслуживания', 'Менеджмент', 'Пищевые технологии', 'Геодезия и землеустройство', 'Технологические машины и оборудование'],
811: ['Юриспруденция'],
812: ['Экономика', 'Менеджмент', 'Юриспруденция', 'Государственное и муниципальное управление'],
813: ['Реклама и связи с общественностью', 'Менеджмент', 'Информатика и вычислительная техника', 'Экономика'],
814: ['Информатика и вычислительная техника', 'Электронная техника, радиотехника и связь'],
815: ['Филология', 'Международные отношения', 'История', 'Технологические машины и оборудование', 'Информатика и вычислительная техника', 'Геодезия и землеустройство', 'Сфера обслуживания', 'Социология', 'Ядерные физика и технологии', 'Лингвистика и иностранные языки', 'Энергетика и энергетическое машиностроение', 'Строительство', 'Издательское дело', 'Экономика', 'Архитектура и градостроительство', 'Автоматика и управление', 'Теория искусств', 'Культурология', 'Бизнес-информатика', 'Электронная техника, радиотехника и связь', 'Библиотеки и архивы', 'Физика', 'Математика', 'Педагогическое образование', 'Транспортные средства', 'Биология', 'Социальная работа', 'Государственное и муниципальное управление', 'Приборостроение и оптотехника', 'Реклама и связи с общественностью', 'Психология', 'Физическая культура', 'Востоковедение и африканистика', 'Религиоведение и теология', 'Юриспруденция', 'Информационная безопасность', 'Полиграфия и упаковка', 'Дизайн', 'Менеджмент', 'Философия', 'Здравоохранение', 'Политология', 'Экология', 'Журналистика и литературное творчество', 'Машиностроение', 'Химия', 'Химическая и биотехнологии', 'Управление качеством', 'География', 'Материалы'],
816: ['Юриспруденция'],
817: ['Бизнес-информатика', 'Государственное и муниципальное управление', 'Экономика', 'Менеджмент', 'Реклама и связи с общественностью'],
818: ['Информационная безопасность', 'Транспортные средства', 'Энергетика и энергетическое машиностроение', 'Автоматика и управление', 'Математика', 'Авиационные системы (эксплуатация)', 'Технологические машины и оборудование', 'Менеджмент', 'Экономика', 'Экология', 'Государственное и муниципальное управление', 'Бизнес-информатика', 'Информатика и вычислительная техника', 'Электронная техника, радиотехника и связь', 'Авиационная и ракетно-космическая техника', 'Приборостроение и оптотехника', 'Машиностроение', 'Материалы', 'Управление качеством'],
819: ['Химическая и биотехнологии', 'Автоматика и управление', 'Нефтегазовое дело', 'Сфера обслуживания', 'Государственное и муниципальное управление', 'Строительство', 'Материалы', 'Геология', 'Экология', 'Энергетика и энергетическое машиностроение', 'Технологии легкой промышленности', 'Дизайн', 'Международные отношения', 'Архитектура и градостроительство', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью', 'Менеджмент', 'Социальная работа', 'Экономика', 'Технологические машины и оборудование', 'Машиностроение', 'Политология', 'Пищевые технологии'],
820: ['Журналистика и литературное творчество', 'Востоковедение и африканистика', 'Лингвистика и иностранные языки', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Менеджмент', 'Математика', 'Международные отношения', 'Филология', 'Социология', 'Социальная работа', 'Психология', 'История', 'Юриспруденция', 'Бизнес-информатика', 'Информационная безопасность', 'Реклама и связи с общественностью', 'Экономика', 'Педагогическое образование', 'Политология', 'Автоматика и управление'],
821: ['Юриспруденция', 'Бизнес-информатика', 'Менеджмент', 'Экономика'],
822: ['Экономика', 'Строительство', 'Геология', 'Реклама и связи с общественностью', 'Менеджмент', 'Энергетика и энергетическое машиностроение', 'Информатика и вычислительная техника'],
823: ['Авиационные системы (эксплуатация)', 'Электронная техника, радиотехника и связь'],
824: ['Менеджмент', 'Информатика и вычислительная техника', 'Авиационные системы (эксплуатация)'],
825: ['Информатика и вычислительная техника'],
826: ['Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Экономика'],
827: ['Автоматика и управление', 'Информатика и вычислительная техника'],
828: ['Физика', 'Информатика и вычислительная техника', 'Автоматика и управление'],
829: ['Юриспруденция', 'Экономика'],
830: ['Юриспруденция', 'Экономика'],
831: ['Юриспруденция', 'Экономика'],
832: ['Информатика и вычислительная техника', 'Экономика'],
833: ['Педагогическое образование'],
834: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
835: ['Менеджмент'],
836: ['Менеджмент', 'Экономика', 'Дизайн'],
837: ['Архитектура и градостроительство', 'Транспортные средства', 'Строительство'],
838: ['Управление водным транспортом', 'Морская техника'],
839: ['Информатика и вычислительная техника', 'Строительство'],
840: ['Информатика и вычислительная техника'],
841: ['Информатика и вычислительная техника'],
842: ['Экономика', 'Юриспруденция'],
843: ['Юриспруденция'],
844: ['Юриспруденция'],
845: ['Юриспруденция', 'Экономика'],
846: ['Экономика'],
847: ['Экономика', 'Юриспруденция'],
848: ['Юриспруденция', 'Педагогическое образование', 'Математика', 'Экономика', 'Менеджмент'],
849: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
850: ['Экономика', 'Юриспруденция'],
851: ['Экономика'],
852: ['Экономика', 'Государственное и муниципальное управление'],
853: ['Транспортные средства', 'Геология', 'Информатика и вычислительная техника'],
854: ['Экономика', 'Государственное и муниципальное управление', 'Нефтегазовое дело', 'Транспортные средства', 'Экология', 'Геодезия и землеустройство'],
855: ['Юриспруденция'],
856: ['Математика', 'Экономика', 'Государственное и муниципальное управление', 'Журналистика и литературное творчество', 'История', 'География', 'Филология', 'Менеджмент'],
857: ['Социология', 'Информатика и вычислительная техника', 'Геология', 'Экономика'],
859: ['Экология', 'Геология'],
860: ['Энергетика и энергетическое машиностроение'],
861: ['Экономика', 'Информатика и вычислительная техника', 'Энергетика и энергетическое машиностроение', 'Приборостроение и оптотехника', 'Строительство', 'Электронная техника, радиотехника и связь', 'Технологические машины и оборудование'],
858: ['Юриспруденция', 'Экономика', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Строительство', 'Управление качеством', 'Технологические машины и оборудование', 'Транспортные средства'],
862: ['Педагогическое образование'],
863: ['Автоматика и управление', 'Нефтегазовое дело', 'Технологические машины и оборудование', 'Химическая и биотехнологии'],
865: ['Менеджмент', 'Экономика', 'Информатика и вычислительная техника', 'Экология'],
866: ['Юриспруденция', 'Менеджмент', 'Реклама и связи с общественностью', 'Экономика'],
867: ['Юриспруденция', 'Психология'],
868: ['Педагогическое образование', 'Юриспруденция', 'Экономика'],
869: ['Экономика', 'Юриспруденция', 'Менеджмент'],
870: ['Экономика'],
871: ['Экономика', 'Информатика и вычислительная техника'],
872: ['Дизайн', 'Лингвистика и иностранные языки', 'История'],
873: ['Сфера обслуживания'],
874: ['Информационная безопасность', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Дизайн', 'Юриспруденция', 'Строительство', 'Экономика', 'Менеджмент', 'Технологические машины и оборудование'],
875: ['Информатика и вычислительная техника', 'Электронная техника, радиотехника и связь'],
876: ['Транспортные средства', 'Строительство'],
877: ['Юриспруденция', 'Экономика'],
878: ['Экономика', 'Юриспруденция'],
879: ['Юриспруденция', 'Экономика'],
880: ['Юриспруденция', 'Менеджмент'],
881: ['Экономика'],
864: ['Информатика и вычислительная техника', 'Юриспруденция', 'Экономика', 'Менеджмент'],
882: ['Экономика', 'Менеджмент', 'Энергетика и энергетическое машиностроение', 'Автоматика и управление', 'Химическая и биотехнологии'],
883: ['Технологические машины и оборудование', 'Экономика', 'Информатика и вычислительная техника', 'Экология', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Химическая и биотехнологии'],
884: ['Экономика', 'Транспортные средства'],
885: ['Юриспруденция'],
886: ['Экономика'],
887: ['Юриспруденция', 'Морская техника', 'Автоматика и управление', 'Педагогическое образование', 'Технологические машины и оборудование', 'Транспортные средства', 'Машиностроение'],
888: ['Сфера обслуживания', 'Государственное и муниципальное управление'],
889: ['Педагогическое образование'],
890: ['Нефтегазовое дело'],
891: ['Бизнес-информатика'],
892: ['Транспортные средства', 'Строительство'],
893: ['Металлургия'],
894: ['Технологические машины и оборудование'],
895: ['Информатика и вычислительная техника', 'Технологические машины и оборудование'],
896: ['Нефтегазовое дело', 'Технологические машины и оборудование'],
897: ['Информатика и вычислительная техника', 'Химическая и биотехнологии', 'Энергетика и энергетическое машиностроение', 'Автоматика и управление', 'Нефтегазовое дело'],
898: ['Автоматика и управление', 'Химическая и биотехнологии', 'Экология', 'Технологические машины и оборудование', 'Нефтегазовое дело'],
899: ['Менеджмент'],
903: ['Юриспруденция'],
902: ['Педагогическое образование'],
900: ['Юриспруденция', 'Информатика и вычислительная техника'],
901: ['Юриспруденция', 'Экономика', 'Информатика и вычислительная техника'],
904: ['Психология', 'Экономика', 'Юриспруденция', 'Сфера обслуживания', 'Информатика и вычислительная техника', 'Менеджмент', 'Социология', 'Политология', 'Бизнес-информатика', 'Лингвистика и иностранные языки', 'Философия', 'Реклама и связи с общественностью', 'Государственное и муниципальное управление', 'Информационная безопасность', 'Математика'],
905: ['Экономика', 'Юриспруденция', 'Пищевые технологии', 'Менеджмент', 'Реклама и связи с общественностью', 'Информатика и вычислительная техника', 'Сфера обслуживания'],
906: ['Электронная техника, радиотехника и связь', 'Информатика и вычислительная техника'],
907: ['Менеджмент', 'Лингвистика и иностранные языки', 'Сельское и рыбное хозяйство', 'Социальная работа', 'Юриспруденция', 'Информатика и вычислительная техника', 'Здравоохранение', 'Экономика', 'Филология', 'История', 'Педагогическое образование', 'Журналистика и литературное творчество', 'Строительство', 'Психология', 'Экология', 'Биология'],
908: ['Строительство', 'Технологические машины и оборудование', 'Информатика и вычислительная техника', 'Экономика', 'Транспортные средства'],
909: ['Здравоохранение'],
910: ['Математика', 'Бизнес-информатика'],
911: ['Юриспруденция'],
912: ['Строительство'],
913: ['Экономика', 'Юриспруденция', 'Менеджмент'],
914: ['Строительство', 'Менеджмент', 'Информатика и вычислительная техника', 'Юриспруденция', 'Автоматика и управление', 'Энергетика и энергетическое машиностроение', 'Архитектура и градостроительство', 'Экономика', 'Транспортные средства', 'Технологические машины и оборудование'],
915: ['Экономика', 'Юриспруденция', 'Менеджмент', 'Информатика и вычислительная техника', 'Государственное и муниципальное управление', 'Сфера обслуживания', 'Пищевые технологии', 'Бизнес-информатика'],
916: ['Экономика', 'Государственное и муниципальное управление', 'Менеджмент'],
917: ['Биология', 'Журналистика и литературное творчество', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Здравоохранение', 'Информационная безопасность', 'Международные отношения', 'Экономика', 'Психология', 'Реклама и связи с общественностью', 'Математика', 'Педагогическое образование', 'Менеджмент', 'Лингвистика и иностранные языки', 'История', 'Юриспруденция', 'Социология', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Филология', 'Бизнес-информатика', 'Химия', 'Лесное дело', 'Социальная работа', 'Экология', 'Материалы', 'Технологические машины и оборудование', 'Физика', 'Сельское и рыбное хозяйство', 'Философия', 'Религиоведение и теология'],
918: ['Транспортные средства', 'Строительство'],
919: ['Экономика', 'Менеджмент', 'Юриспруденция', 'Политология', 'Бизнес-информатика', 'Государственное и муниципальное управление'],
920: ['Государственное и муниципальное управление', 'Экономика'],
921: ['Государственное и муниципальное управление', 'Социология', 'Сфера обслуживания', 'Педагогическое образование', 'Архитектура и градостроительство', 'Лингвистика и иностранные языки', 'Экономика', 'Социальная работа', 'Реклама и связи с общественностью', 'Дизайн', 'Журналистика и литературное творчество', 'Автоматика и управление', 'Менеджмент', 'Юриспруденция', 'История', 'Физическая культура', 'Биология', 'Математика', 'Информатика и вычислительная техника', 'Информационная безопасность', 'Экология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Энергетика и энергетическое машиностроение', 'Психология'],
922: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Профессиональное обучение'],
923: ['Информатика и вычислительная техника', 'Педагогическое образование', 'Профессиональное обучение', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Социальная работа', 'Сфера обслуживания', 'Государственное и муниципальное управление'],
924: ['Бизнес-информатика', 'Экономика', 'Электронная техника, радиотехника и связь', 'Юриспруденция', 'Сфера обслуживания', 'Химия', 'Здравоохранение', 'Государственное и муниципальное управление', 'Лингвистика и иностранные языки', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника', 'Математика', 'Менеджмент', 'Биология', 'Психология'],
925: ['Экономика', 'Здравоохранение', 'Журналистика и литературное творчество', 'Государственное и муниципальное управление', 'Лингвистика и иностранные языки', 'Юриспруденция', 'Филология', 'Менеджмент', 'Бизнес-информатика', 'Международные отношения', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Экология', 'Сфера обслуживания'],
926: ['Информатика и вычислительная техника', 'Экономика', 'Приборостроение и оптотехника'],
927: ['Здравоохранение'],
928: ['Юриспруденция', 'Экономика', 'Информатика и вычислительная техника', 'Менеджмент', 'Государственное и муниципальное управление'],
929: ['Менеджмент', 'Сельское и рыбное хозяйство', 'Транспортные средства', 'Экономика', 'Экология', 'Геодезия и землеустройство', 'Сфера обслуживания'],
930: ['Сельское и рыбное хозяйство', 'Менеджмент', 'Экономика', 'Транспортные средства', 'Геодезия и землеустройство', 'Информатика и вычислительная техника', 'Экология'],
931: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Педагогическое образование', 'Лингвистика и иностранные языки', 'Физическая культура', 'Профессиональное обучение', 'Информатика и вычислительная техника', 'Реклама и связи с общественностью', 'Экология', 'Государственное и муниципальное управление'],
932: ['Сфера обслуживания', 'Строительство', 'Здравоохранение', 'Юриспруденция', 'Химия', 'Журналистика и литературное творчество', 'Психология', 'Менеджмент', 'Экономика', 'Лингвистика и иностранные языки', 'Бизнес-информатика', 'Электронная техника, радиотехника и связь', 'Технологические машины и оборудование', 'Математика', 'Дизайн', 'Информатика и вычислительная техника', 'Энергетика и энергетическое машиностроение', 'Политология', 'Машиностроение', 'Транспортные средства', 'Информационная безопасность', 'Государственное и муниципальное управление', 'Филология', 'История', 'Экология', 'Библиотеки и архивы', 'Химическая и биотехнологии', 'География', 'Архитектура и градостроительство'],
933: ['Педагогическое образование', 'Профессиональное обучение', 'Информатика и вычислительная техника', 'Психолого-педагогическое и специальное (дефектологическое) образование'],
934: ['Технологические машины и оборудование', 'Информатика и вычислительная техника', 'Экономика', 'Строительство', 'Менеджмент'],
935: ['Педагогическое образование'],
936: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Физическая культура', 'Педагогическое образование'],
937: ['Строительство', 'Экономика', 'Автоматика и управление'],
938: ['Информатика и вычислительная техника', 'Технологии легкой промышленности', 'Нефтегазовое дело', 'Технологические машины и оборудование'],
939: ['Химия', 'Информационная безопасность', 'Здравоохранение', 'Лингвистика и иностранные языки', 'Сфера обслуживания', 'Информатика и вычислительная техника', 'Юриспруденция', 'Приборостроение и оптотехника', 'Математика', 'Социология', 'Международные отношения', 'Журналистика и литературное творчество', 'Государственное и муниципальное управление', 'Менеджмент', 'Строительство', 'Автоматика и управление', 'Экономика', 'Архитектура и градостроительство', 'Пищевые технологии', 'Транспортные средства', 'Энергетика и энергетическое машиностроение', 'Технологии легкой промышленности', 'Машиностроение', 'Экология', 'Бизнес-информатика', 'Электронная техника, радиотехника и связь', 'Химическая и биотехнологии', 'Геодезия и землеустройство', 'Технологические машины и оборудование'],
940: ['Сфера обслуживания', 'Филология', 'Юриспруденция', 'Экономика', 'Лингвистика и иностранные языки', 'Информатика и вычислительная техника', 'Физическая культура', 'Менеджмент', 'Социальная работа', 'Нефтегазовое дело', 'Экология', 'Химия', 'Журналистика и литературное творчество', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Энергетика и энергетическое машиностроение'],
941: ['Экономика', 'Менеджмент', 'Информационная безопасность', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Дизайн', 'Информатика и вычислительная техника', 'Юриспруденция', 'Бизнес-информатика', 'Государственное и муниципальное управление', 'Электронная техника, радиотехника и связь', 'Строительство', 'Транспортные средства', 'Нефтегазовое дело', 'Социальная работа', 'Математика', 'Энергетика и энергетическое машиностроение', 'Химическая и биотехнологии', 'Геология', 'Архитектура и градостроительство'],
942: ['Экономика', 'Дизайн', 'Юриспруденция'],
943: ['Государственное и муниципальное управление', 'Политология', 'Юриспруденция', 'Экономика', 'Менеджмент'],
944: ['Энергетика и энергетическое машиностроение', 'Транспортные средства', 'Сельское и рыбное хозяйство', 'Экология', 'Профессиональное обучение'],
945: ['Психолого-педагогическое и специальное (дефектологическое) образование', 'Профессиональное обучение', 'Лингвистика и иностранные языки', 'Педагогическое образование', 'Информатика и вычислительная техника', 'Экология'],
946: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Информатика и вычислительная техника'],
947: ['Психология', 'Здравоохранение'],
948: ['Юриспруденция', 'Лингвистика и иностранные языки', 'Экономика', 'Менеджмент', 'Реклама и связи с общественностью', 'Сфера обслуживания'],
949: ['Экономика', 'Менеджмент', 'Юриспруденция', 'Психология', 'Информатика и вычислительная техника', 'Сфера обслуживания'],
950: ['Филология', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'Автоматика и управление', 'Психология', 'Информационная безопасность', 'Электронная техника, радиотехника и связь', 'Педагогическое образование', 'Геология', 'Физика', 'Дизайн', 'Религиоведение и теология', 'Архитектура и градостроительство', 'Международные отношения', 'Журналистика и литературное творчество', 'Бизнес-информатика', 'Математика', 'Экономика', 'История', 'Социальная работа', 'Информатика и вычислительная техника', 'Теория искусств', 'Юриспруденция', 'Сфера обслуживания', 'Социология', 'Приборостроение и оптотехника', 'Философия', 'Государственное и муниципальное управление', 'География', 'Политология', 'Менеджмент', 'Реклама и связи с общественностью', 'Лингвистика и иностранные языки', 'Биология', 'Культурология', 'Химия', 'Профессиональное обучение', 'Ядерные физика и технологии'],
951: ['Машиностроение', 'Геология'],
952: ['Менеджмент', 'Сельское и рыбное хозяйство', 'Информатика и вычислительная техника', 'Сфера обслуживания', 'Лесное дело', 'Экономика', 'Пищевые технологии', 'Экология', 'Геодезия и землеустройство'],
953: ['Транспортные средства', 'Строительство', 'Энергетика и энергетическое машиностроение'],
954: ['Экономика', 'Юриспруденция'],
955: ['Сельское и рыбное хозяйство'],
956: ['Психология', 'Здравоохранение'],
957: ['Педагогическое образование', 'Психолого-педагогическое и специальное (дефектологическое) образование', 'География', 'Лингвистика и иностранные языки', 'Журналистика и литературное творчество', 'Профессиональное обучение', 'Религиоведение и теология', 'Социальная работа', 'Биология', 'Международные отношения', 'Социология', 'Менеджмент', 'Сфера обслуживания', 'Реклама и связи с общественностью'],
958: ['Строительство', 'Менеджмент', 'Информатика и вычислительная техника', 'Химическая и биотехнологии', 'Архитектура и градостроительство', 'Экономика', 'Химия', 'Дизайн', 'Автоматика и управление', 'Технологические машины и оборудование', 'Профессиональное обучение', 'Энергетика и энергетическое машиностроение', 'Транспортные средства', 'Экология', 'Материалы', 'Управление качеством'],
959: ['Филология', 'Юриспруденция', 'Лингвистика и иностранные языки', 'Математика', 'Реклама и связи с общественностью', 'Государственное и муниципальное управление', 'Информатика и вычислительная техника', 'Социология', 'Сфера обслуживания', 'Политология', 'Психология', 'Социальная работа', 'Экономика', 'История', 'Информационная безопасность', 'Менеджмент', 'Биология', 'Химия', 'Экология', 'Физика', 'Электронная техника, радиотехника и связь'],
960: ['Информатика и вычислительная техника', 'Экономика', 'Юриспруденция'],
961: ['Экономика', 'Менеджмент', 'Реклама и связи с общественностью', 'Журналистика и литературное творчество', 'Государственное и муниципальное управление']}
# кастомные стили
st.markdown("""
<style>
    div[data-testid="stSidebarCollapseButton"] {
        display: none;
    }
    button[data-testid="stSidebarNavCollapseButton"] {
        visibility: hidden;
        display: none;
    }
    .main-header { font-size: 2.2rem; color: #1e3a8a; text-align: center; margin-bottom: 2rem; font-weight: bold; }
    .result-header { text-align: center; }
    .result-header h2 { color: #1e3a8a; font-weight: bold; font-size: 1.5rem; word-wrap: break-word;}
    .result-header h4 { color: #555; }
    .section-title-uni { color: #333; font-weight: bold; font-size: 1.2rem; margin-top: 2rem; margin-bottom: 1rem; border-left: 4px solid #dc2626; padding-left: 10px; }
    .section-title-prog { color: #333; font-weight: bold; font-size: 1.2rem; margin-top: 2rem; margin-bottom: 1rem; border-left: 4px solid #1e3a8a; padding-left: 10px; }
</style>
""", unsafe_allow_html=True)




# ЗАГРУЗКА КОМПОНЕНТОВ ДЛЯ ОБЕИХ МОДЕЛЕЙ
# Модель 1: Спрос на университет
prediction_components = load_prediction_components()

# Модель 2: Спрос на программу
prog_prediction_components = load_program_model_components()
# БОКОВАЯ ПАНЕЛЬ
with st.sidebar:
    st.image(
        "https://lomonosov-msu.ru/media/cache/event_logo/file/event/8714/rus_logo_e69966316674c7035e14f995352b4b6eccb36f86.png",
        width=250)
    st.header("Параметры прогноза")

    selected_university_name = st.selectbox("Наименование ВУЗа:", options=list(universities.values()), index=1)


    selected_university_index = None
    for index, name in universities.items():
        if name == selected_university_name:
            selected_university_index = index
            break

    available_programs = program_groups.get(selected_university_index, [])
    selected_program = st.selectbox("Направление обучения:", options=available_programs)

    year = st.slider("Год прогноза:", 2024, 2030, 2026)
    predicted_cost_thousands = st.number_input("Прогнозная стоимость (тыс. руб./год):", min_value=100, max_value=800,
                                               value=250, step=10)
    avg_ege_p = st.number_input("Средний балл ЕГЭ на платное направление:", min_value=50.00, max_value=100.00, value=70.00, step=0.10)
    avg_ege_b = st.number_input("Средний балл ЕГЭ на бюджтное направление:", min_value=50.00, max_value=100.00, value=85.00, step=0.10)

    with st.expander("Экономические показатели"):
        mrot_thousands = st.number_input("МРОТ (тыс. руб.):", value=22.0, step=0.5)
        avg_salary_thousands = st.number_input("Средняя зарплата (тыс. руб.):", value=85.0, step=1.0)
        cpi_index = st.slider("Индекс потр. цен:", 100.0, 300.0, 200.0, 0.1)  # Как в демо
        inflation_rate_percent = st.slider("Уровень инфляции (%):", 1.0, 20.0, 7.0, 0.1)

    predict_button = st.button("🚀 Запустить прогноз", type="primary", use_container_width=True)

# ОСНОВНАЯ ОБЛАСТЬ
if not predict_button:
    st.info("Задайте параметры в боковой панели и нажмите 'Запустить прогноз'")
    st.stop()

with st.spinner('Выполняется комплексное прогнозирование...'):
    # --------------------------------------------------------------------------
    # 1. ПРОГНОЗ ПО ВСЕМ УНИВЕРСИТЕТАМ
    # --------------------------------------------------------------------------

    common_features = {
        "year": year, "cost_of_education_rub": predicted_cost_thousands,
        "mrot_rub": mrot_thousands, "avg_salary_rub": avg_salary_thousands,
        "cpi_index": cpi_index, "inflation_rate_percent": inflation_rate_percent,
        "avg_ege_paid": avg_ege_p, "avg_ege_budget": avg_ege_b
    }
    st.write("Выполняется прогноз для каждого университета...")
    all_demands_dict = {}
    TOTAL_MARKET_SIZE = 450000
    progress_bar = st.progress(0)
    for i, (uni_id, uni_name) in enumerate(universities.items()):
        features_for_this_uni = common_features.copy()
        features_for_this_uni['university'] = uni_id
        predicted_share = predict_demand_share(features_for_this_uni, prediction_components)
        all_demands_dict[uni_name] = int(predicted_share * TOTAL_MARKET_SIZE)
        progress_bar.progress((i + 1) / len(universities))
    progress_bar.empty()
    st.success("Прогноз по всем университетам завершен!")

    # Сохраняем оригинальный прогноз для выбранного вуза
    predicted_demand_uni = all_demands_dict.get(selected_university_name, 0)

    # --------------------------------------------------------------------------
    # 2. ПРОГНОЗ ПО ВСЕМ ПРОГРАММАМ ВЫБРАННОГО УНИВЕРСИТЕТА
    # --------------------------------------------------------------------------
    all_program_demands_dict = {}

    if available_programs and prog_prediction_components:
        st.write(
            f"Выполняется детальный прогноз для {len(available_programs)} программ в {selected_university_name}...")

        common_prog_features = common_features.copy()  # Используем те же общие фичи

        for i, prog_name in enumerate(available_programs):
            #is_debug_target = (prog_name == selected_program)
            is_debug_target = False
            features_for_this_prog = prepare_program_features(
                common_inputs_from_widgets=common_prog_features,
                university_id=selected_university_index,
                university_name=selected_university_name,
                program_name=prog_name,
                is_debug_target=is_debug_target
            )
            predicted_share_prog = predict_program_demand_streamlit(
                features_for_this_prog, prog_prediction_components, is_debug_target
            )
            # считаем долю от оригинального прогноза по вузу
            absolute_demand_prog = int(predicted_share_prog * predicted_demand_uni)
            all_program_demands_dict[prog_name] = absolute_demand_prog

    # --------------------------------------------------------------------------
    # 3. ПОДГОТОВКА ДАННЫХ ДЛЯ ВИЗУАЛИЗАЦИИ
    # --------------------------------------------------------------------------
    # Прогноз для выбранной программы
    predicted_demand_prog = all_program_demands_dict.get(selected_program, 0)
    # Сумма по программам для отображения
    sum_of_all_programs = sum(all_program_demands_dict.values())
    # Переменная для отображения итогового числа в вузе
    display_demand_uni = sum_of_all_programs if sum_of_all_programs > 0 else predicted_demand_uni

# ==============================================================================
# ВИЗУАЛИЗАЦИЯ
# ==============================================================================

# Заголовок
st.markdown(
    f'<div class="result-header"><h2>{selected_university_name}</h2><h4>Направление обучения - {selected_program}</h4><h3>Прогноз на {year} г.</h3></div>',
    unsafe_allow_html=True)
st.markdown("---")

# --------------------------------------------------------------------------
# БЛОК 1: УРОВЕНЬ СПРОСА СРЕДИ ДРУГИХ ВУЗОВ
# --------------------------------------------------------------------------
st.markdown('<p class="section-title-uni">Уровень спроса среди других ВУЗов</p>', unsafe_allow_html=True)
col1, col2 = st.columns([2, 3])

with col1:
    # Процент считаем от ОРИГИНАЛЬНОГО прогноза
    percentage_uni = (predicted_demand_uni / TOTAL_MARKET_SIZE) * 100 if TOTAL_MARKET_SIZE > 0 else 0
    fig_gauge_uni = go.Figure(
        go.Indicator(mode="gauge+number", value=percentage_uni, number={'suffix': '%', 'font': {'size': 48}},
                     gauge={'shape': "angular", 'axis': {'range': [None, 10]}, 'bar': {'color': "#dc2626"}}))
    # Число показываем СУММАРНОЕ
    fig_gauge_uni.update_layout(height=250, margin=dict(l=20, r=20, t=60, b=20), title={
        'text': f"Общее количество<br>поступивших в ВУЗ: <b>{display_demand_uni:,}</b>", 'y': 0.95, 'x': 0.5,
        'xanchor': 'center', 'yanchor': 'top'})
    st.plotly_chart(fig_gauge_uni, use_container_width=True)
with col2:

    # 1. Берем прогнозы и сортируем всех по убыванию
    uni_demand_pairs = sorted(all_demands_dict.items(), key=lambda item: item[1], reverse=True)

    # 2. Находим индекс (позицию в рейтинге) нашего выбранного университета
    try:
        selected_uni_index = \
        [i for i, (name, demand) in enumerate(uni_demand_pairs) if name == selected_university_name][0]
    except IndexError:
        print("ERROR index not found")
        # Если вуз не найден  просто показываем топ-10
        final_chart_data = uni_demand_pairs[:10]
    else:

        # Определяем срезы для конкурентов "до" и "после"
        start_index = max(0, selected_uni_index - 5)
        end_index = min(len(uni_demand_pairs), selected_uni_index + 5)  # +4 вуза после и +1 наш

        # Формируем итоговый список для графика
        final_chart_data = uni_demand_pairs[start_index:end_index]

    # 4. Сортируем итоговый список для красивого отображения на графике (от меньшего к большему)
    final_chart_data.sort(key=lambda item: item[1])


    if final_chart_data:
        chart_universities, chart_demands = zip(*final_chart_data)

        colors = ['#dc2626' if univ == selected_university_name else '#6b7280' for univ in chart_universities]

        fig_bar_uni = go.Figure(go.Bar(x=chart_demands, y=chart_universities, orientation='h', marker_color=colors))
        fig_bar_uni.update_layout(
            title="Сравнение с ближайшими конкурентами",
            xaxis_title="Кол-во абитуриентов (прогноз)",
            yaxis_title="",
            height=350,
            margin=dict(l=10, r=10, t=30, b=10),
            showlegend=False,
            xaxis=dict(showticklabels=False)
        )
        st.plotly_chart(fig_bar_uni, use_container_width=True)
    else:
        st.write("Нет данных для сравнения.")

# --------------------------------------------------------------------------
# БЛОК 2: УРОВЕНЬ СПРОСА НА НАПРАВЛЕНИЕ ВНУТРИ ВУЗА
# --------------------------------------------------------------------------
st.markdown('<p class="section-title-prog">Уровень спроса на направление внутри ВУЗа</p>', unsafe_allow_html=True)
col3, col4 = st.columns([2, 3])

with col3:
    # Процент для программы считаем относительно СУММЫ по программам
    percentage_prog = (predicted_demand_prog / sum_of_all_programs) * 100 if sum_of_all_programs > 0 else 0
    fig_gauge_prog = go.Figure(
        go.Indicator(mode="gauge+number", value=percentage_prog, number={'suffix': '%', 'font': {'size': 48}},
                     gauge={'shape': "angular", 'axis': {'range': [None, 30]}, 'bar': {'color': "#1e3a8a"}}))
    fig_gauge_prog.update_layout(height=250, margin=dict(l=20, r=20, t=60, b=20),
                                 title={'text': f"Прогноз спроса<br>на направление: <b>{predicted_demand_prog:,}</b>",
                                        'y': 0.95, 'x': 0.5, 'xanchor': 'center', 'yanchor': 'top'})
    st.plotly_chart(fig_gauge_prog, use_container_width=True)

with col4:
    if all_program_demands_dict:
        # Этот код уже готовит правильные данные
        prog_demand_pairs = list(all_program_demands_dict.items())
        prog_demand_pairs.sort(key=lambda item: item[1], reverse=True)
        selected_prog_data = (selected_program, predicted_demand_prog)
        top_prog_competitors = [item for item in prog_demand_pairs if item[0] != selected_program][:9]
        final_prog_chart_data = [selected_prog_data] + top_prog_competitors
        final_prog_chart_data.sort(key=lambda item: item[1])
        chart_programs, chart_program_demands = zip(*final_prog_chart_data)

        colors_prog = ['#1e3a8a' if prog == selected_program else '#6b7280' for prog in chart_programs]

        fig_bar_prog = go.Figure(
            go.Bar(
                x=chart_program_demands,
                y=chart_programs,
                orientation='h',
                marker_color=colors_prog,
                text=chart_program_demands,  # <-- Возвращаем этот параметр
                textposition='auto',  # <-- Позиция текста (auto обычно хорошо работает)
                textfont=dict(color='rgba(0, 0, 0, 0.8)')  # <-- Цвет текста для лучшей читаемости
            )
        )


        fig_bar_prog.update_layout(
            title="Сравнение с топ-направлениями в ВУЗе",
            xaxis_title="Кол-во абитуриентов",
            yaxis_title="",
            height=350,
            margin=dict(l=10, r=10, t=30, b=10),  # Уменьшаем отступы для компактности
            showlegend=False
        )
        st.plotly_chart(fig_bar_prog, use_container_width=True)
    else:
        st.write("Прогнозы по программам для данного ВУЗа не отображаются.")
